Repository: CodeCollect/krusader
Catalog: doc/i18n/*/basic-functions.docbook.po
Languages: fr

source: Basic Functions
fr: Fonctionnalités de base

source: Controls
fr: Contrôles

source: General
fr: Général

source: This is a rather short but important section that will go into the details of controlling &krusader;. This section does not try to cover all the various key combinations for two reasons: <orderedlist numeration="arabic"> <listitem> <para>there are just too many of them</para> </listitem> <listitem> <para>most of &krusader; actions are configurable in the <link linkend="konfig-looknfeel">Konfigurator Look &amp; Feel page</link></para> </listitem> </orderedlist>We will only mention the most important keyboard shortcuts with the default configuration, but keep in mind that most of the <link linkend="key_bindings">Key-Bindings</link> are configurable. If you find that you use a certain command a lot and want to know the shortcut for this command, or you want to change this command shortcut, then check out the <link linkend="key_bindings">Key-Bindings</link> tab at the <link linkend="konfig-looknfeel">Konfigurator Look &amp; Feel page</link>.
fr: C'est une section courte mais importante qui va détailler les façons de contrôler &krusader; Cette section n'essaie pas de couvrir toutes les combinaisons de touches possibles pour deux raisons : <orderedlist numeration="arabic"> <listitem> <para>il y en a trop</para> </listitem> <listitem> <para>la plupart des actions de &krusader; sont configurables dans la <link linkend="konfig-looknfeel">page d'apparence &amp; ergonomie de Konfigurator</link></para> </listitem> </orderedlist>Nous mentionnerons les raccourcis clavier les plus importants avec la configuration par défaut, mais gardez à l'esprit que la plupart des <link linkend="key_bindings">combinaisons</link> sont configurables. Si vous trouvez que vous utilisez beaucoup une certaine commande et que vous voulez connaitre le raccourci pour cette commande, ou que vous voulez modifier ce raccourci de commande, regardez l'onglet <link linkend="key_bindings">Combinaison</link> dans la <link linkend="konfig-looknfeel">page d'apparence &amp; ergonomie de Konfigurator</link>.

source: Moving Around
fr: Se déplacer dans...

source: By Moving Around we mean the transfer of the keyboard and mouse focus between the different parts of the &krusader; <link linkend="mainwindow">main window</link>. The focus can be in one of five places: the Left or Right Panel, the Menu Bar, the Command Line or the Terminal Emulator. The panel that has the focus is called the Active Panel. An Active Panel will remain active until the other panel receives the focus (i.e.: if the Left Panel was active and you clicked on the Command Line - then the Left Panel remains the Active Panel). You must deliberately change which panel is active.
fr: Se déplacer dans... signifie le transfert du focus du clavier et de la souris entre les différentes parties de la <link linkend="mainwindow">fenêtre principale</link> de &krusader;. Le focus peut être dans une des cinq emplacements : le panneau gauche ou droit, la barre de menus, la ligne de commande ou l'émulateur de terminal. Le panneau qui a le focus est appelé le panneau actif. Un panneau actif restera actif jusqu'à ce que l'autre panneau reçoit le focus (&cad; si le panneau de gauche est actif et vous cliquez sur la ligne de commande - ensuite le panneau de gauche devient le panneau inactif).

source: The most common way to transfer the focus to a specific panel is to use the mouse to click on that panel. But you should be aware of the following:
fr: La façon la plus commune de transférer le focus à un panneau spécifique est d'utiliser la souris en cliquant sur ce panneau. Mais vous devez être attenif aux choses suivantes :

source: Clicking on the Toolbar, the FN keys bar or the Status Bar does *not* change the focus.
fr: Cliquer sur la barre d'outils, la barre de touches FN ou la barre d'état ne va PAS modifier le focus.

source: Pushing the <guibutton>"History"</guibutton> or the <guibutton>"Run in Terminal"</guibutton> buttons in the Command Line will not transfer the focus, so you have to click inside the Input Line.
fr: Appuyer sur les boutons <guibutton>Historique</guibutton> ou <guibutton>Lancer un terminal</guibutton> dans la ligne de commande ne transfèrera pas le focus, vous devez donc cliquer sur la ligne d'entrée.

source: When you choose a menu, the Menu Bar will become focused. It remains focused until you choose a command - the focus returns to the previous owner.
fr: Quand vous choisissez un menu, la barre de menus deviendra celle qui a le focus. Elle a le focus jusqu'à ce que vous choisissez une commande - le focus retourne au précédent propriétaire.

source: There are, of course, ways to use the keyboard to change the focus:
fr: Il y a, bien sûr, des façons d'utiliser le clavier pour modifier le focus :

source: The &Tab; Key will switch panels, if one of the panels has the focus or rotate between all the commands in a menu, if the Menu Bar is active.
fr: La touche &Tab; permet de naviguer entre les panneaux, si un de ces panneaux a le focus ou passe entre les commandes d'un menu, si la barre de menus est active.

source: The <keycombo action="simul">&Ctrl; <keycap>Down Arrow</keycap></keycombo> will take you from the Active Panel to the Command Line or Terminal Emulator, and the <keycombo action="simul">&Ctrl; <keycap>Up Arrow</keycap></keycombo> will take you back from the Command Line to the Active Panel.
fr: <keycombo action="simul">&Ctrl; <keycap>Flèche bas</keycap></keycombo> vous amènera du panneau actif à la ligne de commande ou un émulateur de terminal, et <keycombo action="simul">&Ctrl; <keycap>Flèche haut</keycap></keycombo> vous amènera de la ligne de commande à un panneau actif.

source: The <keycap>Esc</keycap> Key will make the Menu Bar return the focus, if it has it, to the previous Active Panel.
fr: La touche <keycap>Echap</keycap> redonnera le focus à la barre de menus, si cette barre l'a déjà, au précédent panneau actif.

source: If you happen to be inside the Terminal Emulator, you can use the &Tab; Key, or the mouse, to navigate to an Active Panel.
fr: Si vous êtes dans l'émulateur de terminal, vous pouvez utiliser la touche &Tab; ou la souris pour parcourir le panneau actif.

source: Pressing <keycombo action="simul">&Alt; <keycap>"Underlined Letter"</keycap></keycombo> from the Menu Bar will open that menu (unless this key combination is a "Reserved Key", used by one of &krusader;'s actions).
fr: Appuyer sur <keycombo action="simul">&Alt; <keycap>une lettre non définie</keycap></keycombo> de la barre de menus ouvrira le menu (à moins que cette combinaison de touches est une « touche réservée » utilisée par une des actions de &krusader;).

source: Selecting
fr: Sélectionner

source: &krusader; offers 4 <link linkend="mouse_selection_modes">Mouse Selection Modes</link>, only &krusader;'s Mouse Selection Mode is explained here.
fr: &krusader; offre quatre <link linkend="mouse_selection_modes">modes de sélection avec la souris</link>, seul le mode de sélection avec la souris est expliqué ici.

source: Selecting is a skill you need to master in order to get the most out of &krusader;. Since you can not select files in the Quick View Panel, and the Tree Panel only lets you select one directory at a time, this paragraph mainly explains how to select files in the List Panel filelist.
fr: Sélectionner est une habilité que vous devez parfaitement maitriser pour gérer &krusader;. Depuis que vous ne pouvez plus sélectionner des fichiers dans le panneau de vue rapide, et le panneau en arborescence ne vous permet seulement de sélectionner un dossier à la fois, ce paragraphe explique principalement comment sélectionner des fichiers dans la liste de fichiers du panneau en liste.

source: Moving the cursor is easy. Left-clicking on a file or directory (referred to herein as "elements" meaning files AND directories) will select it. Here are some useful pointers that will make &krusader; even easier to use (assuming you are using &krusader;'s Mouse Selection Mode):
fr: Déplacer le pointeur est facile. Cliquer-gauche sur un fichier ou / et un dossier le sélectionnera. Des façons utiles de sélectionner avec la souris sont présentées ici qui rendra &krusader; plus simple à utiliser (en considérant que vous utilisez &krusader; avec le mode de sélection de souris).

source: The <keycap>SPACE</keycap> and <keycap>Insert</keycap> key will toggle the selection of the file under the cursor without affecting the selection of other files/directories, the cursor will go one position down.
fr: Les touches <keycap>ESPACE</keycap> et <keycap>Inser</keycap> alternerons la sélection d'un fichier sous le pointeur sans affecter la sélection des autres fichiers et dossiers. Le curseur se déplacera d'un cran vers le bas.

source: Pressing the <keycap>SPACE</keycap> on a Directory under the cursor will <link linkend="calculate">calculate occupied space</link> without affecting the selection of other files/directories.
fr: Appuyer sur <keycap>ESPACE</keycap> sur un dossier sous le curseur <link linkend="calculate">calculera l'espace occupé</link> sans affecter la sélection des autres fichiers et dossiers.

source: <keycap>Left Clicking</keycap> on a file will select, or unselect, all previously selected files.
fr: <keycap>Cliquer-gauche</keycap> sur un fichier sélectionnera, ou désélectionnera tous les fichiers précédemment sélectionnés.

source: <keycombo action="simul">&Ctrl; <keycap>Left Clicking</keycap></keycombo> will toggle the selection of the file under the cursor without affecting the selection of other files/directories.
fr: <keycombo action="simul">&Ctrl; <keycap>Cliquer-gauche</keycap></keycombo> permutera la sélection des fichiers sous le pointeur sans affecter la sélection des autres fichiers et dossiers.

source: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Left Clicking</keycap></keycombo> will select all the elements between the previous cursor location and the new one.
fr: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Cliquer-gauche</keycap></keycombo> sélectionnera tous les éléments entre l'emplacement du curseur précédent et le nouveau.

source: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Home</keycap></keycombo> selects everything above the cursor (and deselects everything below the cursor, if selected).
fr: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Touche menu</keycap></keycombo> sélectionne tous les éléments au-dessus du curseur (et désélectionne tous les éléments sous le curseur, si sélectionné).

source: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>End</keycap></keycombo> selects everything below the cursor (and unselects everything above the cursor, if selected).
fr: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Fin</keycap></keycombo> sélectionne tous les éléments en-dessous du curseur (et désélectionne tous les éléments au-dessus du curseur, si sélectionnés)

source: The ".." entry is not selectable.
fr: L'entrée « .. » n'est pas sélectionnable.

source: The <link linkend="edit-menu">Edit menu</link> can offer more ways to select your files.
fr: Le menu <link linkend="edit-menu">Édition</link> peut offrir plus de façons de sélectionner des fichiers.

source: Executing Commands
fr: Exécuter des commandes

source: There is not a lot to say here, all you need to do is select some files (if you do not, &krusader; will operate on the file(s) or directory(s) that have the focus), choose a <link linkend="menu-commands">Command</link> from the Menu Bar or use a Keyboard Shortcut (or the Right Click Menu) and the selected Command executes. See also <link linkend="executing_files">Executing Files</link>.
fr: Il n'y a pas grand chose à dire ici, tout ce dont vous avez besoin est de sélectionner des fichiers (si vous ne le faites pas, &krusader; lancera une opération sur le ou les fichier(s) ou dossier(s) qui ont le focus), choisissez une <link linkend="menu-commands">Commande</link> depuis la barre de menus ou utilisez un raccourci clavier (ou un Menu par clic-droit) et la commande sélectionnée s'exécute. Voir aussi <link linkend="executing_files">Exécuter des fichiers</link>.

source: Quicksearch
fr: Recherche rapide

source: This feature will do a quick search for the file name in the Active List Panel.
fr: Cette fonctionnalité lance une recherche rapide pour les noms de fichiers dans le panneau en liste actif.

source: Type <keycap>foo</keycap>(one character) to do a quick search in the Active List Panel for a file beginning with "foo". A small quick search dialog box will open below the Active List Panel. Type the first few characters of the desired file name (more than one character allowed), the cursor will jump to that filename (if it exists), e.g. type "ab" to search for a file which begins with "ab". The <keycap>Up/Down Arrow</keycap>will jump to the next or previous match. <keycap>Esc</keycap> will close the quick search line. The cursor will stay on the last file found.
fr: Saisissez <keycap>toto</keycap> (un mot) pour lancer une recherche rapide dans le panneau actif pour un fichier commençant par « toto ». Une petite boîte de dialogue de recherche rapide s'ouvrira en dessous du panneau actif. Saisissez la première lettre du nom de fichier désiré (mais plus d'une lettre est permis), le curseur ira à ce nom de fichier (si il existe), &pex; saisissez « ab » pour rechercher un fichier commençant par « ab ». La <keycap>Flèche haut / bas</keycap> ira au prochain ou précédent fichier. <keycap>Echap</keycap> fermera la ligne de recherche rapide. Le curseur restera sur le dernier fichier trouvé.

source: If you press <keycombo action="simul">&Alt; <keycap>foo</keycap></keycombo>, the key binding shortcut will be executed. If there is no configured key binding, the remaining letter <keycap>foo</keycap>will be used for the quick search.
fr: Si vous appuyez sur <keycombo action="simul">&Alt; <keycap>toto</keycap></keycombo> la combinaison sera exécuté. Si aucune combinaison n'est configurée, la lettre restante <keycap>toto</keycap> sera utilisée pour la recherche rapide.

source: Use <link linkend="konfig-looknfeel">Konfigurator Look &amp; Feel page</link> to change from the default configuration.
fr: Utilisez la <link linkend="konfig-looknfeel">page d'apparence &amp; ergonomie de Konfigurator</link> pour modifier la configuration par défaut.

source: Context Menu
fr: Menu contextuel

source: &krusader; has many Context menus that allow you to do fast operations with the mouse, usually a right-click will open the Context menu (depending on your <link linkend="mouse_selection_modes">Mouse Selection Modes</link> settings). This list gives an overview of the most important context menus. Use them to discover the available commands.
fr: &krusader; a de nombreux menus contextuels qui vous permettent des opérations rapides avec la souris, habituellement un clic-droit ouvrira le menu contextuel (cela dépend de votre configuration de <link linkend="mouse_selection_modes">mode de sélection avec la souris</link>). Cette liste donne une vue d'ensemble des plus importants menus contextuels. Utilisez les pour découvrir les commandes disponibles.

source: <link linkend="mainwindow">Main Toolbar</link> (orientation, text position, icon size)
fr: <link linkend="mainwindow">Barre principale</link> (orientation, position du texte, taille de l'icône)

source: <link linkend="list_panel">List Panel</link> on a file or directory
fr: <link linkend="list_panel">Panneau en liste</link> sur un fichier ou un dossier

source: <link linkend="cmdline">Command Line</link> (undo, paste, text completion...)
fr: <link linkend="cmdline">ligne de commande</link> (annuler, coller, complètement de texte...)

source: <link linkend="termemu">Terminal emulator</link> (send signal, font, history...)
fr: <link linkend="termemu">Émulateur de terminal</link> (envoyer un signal, police, historique...)

source: <link linkend="folder-tabs">Folder tabs</link> (new, duplicate, close)
fr: <link linkend="folder-tabs">Onglets de dossier</link> (nouveau, dupliquer, fermer)

source: <link linkend="krusearcher">KruSearcher</link> Search results file list (F3 View, F4 Edit)
fr: <link linkend="krusearcher">KruSearcher</link> liste de fichiers de résultats de recherche (affichage avec F3, Édition avec F4)

source: <link linkend="mount-man">MountMan</link> (unmount, format...)
fr: <link linkend="mount-man">MountMan</link> (libérer, format)

source: <link linkend="synchronizer">Synchronize Directories</link> File List
fr: <link linkend="synchronizer">Synchroniser les dossiers</link> liste de fichiers

source: UserActions
fr: Actions utilisateur

source: &konqueror; Right-Click actions are shown in &krusader;
fr: Les actions par clic-droit de &konqueror; sont affichées dans &krusader;

source: Show/hide <link linkend="list_panel">Column Headers</link>
fr: Affiche ou cache les <link linkend="list_panel">en-têtes de colonne</link>

source: <link linkend="bookman">Bookmarks</link> enable/disable permanent bookmarks
fr: <link linkend="bookman">Signets</link> activer ou désactiver les signets permanents

source: Basic File Management
fr: Gestionnaire de fichiers basique

source: Executing Files
fr: Exécuter des fichiers

source: You can only execute files in the Active List Panel. To <keycap>execute</keycap> a file just <keycap>(double-)click on it or press Enter</keycap> when it is under the list cursor. &krusader; will open it in the default application for this file type (picture, text file...) or the file will be executed (script, binary...). If you want to use <keycap>another application</keycap> to open the file, <keycap>Right-Click</keycap> on the file and go to the "open with" sub-menu which will offer more options. &krusader; is compatible with &kde; default file manager for all file types except archives that are opened inside the &krusader; panel and not in an external application. See <link linkend="konfig-archives">the archives page in Konfigurator</link>for details.
fr: Vous pouvez seulement exécuter des fichiers dans le panneau actif. Pour <keycap>exécuter</keycap> un fichier, <keycap>double-cliquez simplement dessus ou appuyez sur &Enter;</keycap> quand celui-ci est sous la curseur. &krusader; ouvrira dans l'application par défaut pour ce type de fichiers (image, texte) ou le fichier sera exécuté (script, binaire). Si vous voulez utiliser une <keycap>autre application</keycap> pour ouvrir ce fichier, <keycap>cliquez-droit</keycap> sur le fichier et cliquez sur le sous-menu « Ouvrir avec... » qui vous offrira plus d'options. &krusader; est compatible avec le gestionnaire de fichiers par défaut de &kde; pour tous les types de fichiers exceptés les archives qui sont ouvertes à l'intérieur du panneau de &krusader; et non dans une application externe. Voir la <link linkend="konfig-archives">page d'archives dans Konfigurator</link> pour plus de détails.

source: Copying and Moving
fr: Copier et déplacer

source: To copy or move files/directories just select them and press <keycap>F5</keycap> to <keycap>copy</keycap> or <keycap>F6</keycap> to <keycap>move</keycap> them. If the <guimenuitem> Preserve attributes (only on local targets)</guimenuitem> option is checked, &krusader; will try to preserve all attributes (time, owner, group) of the local files according to the source depending on your permissions: <itemizedlist> <listitem> <para>User preserving if you are root</para> </listitem> <listitem> <para>Group preserving if you are root or member of the group</para> </listitem> <listitem> <para>Preserving the timestamp</para> </listitem> </itemizedlist>Using this option may slow down the copy/move process. A dialog will appear and allow you to choose the operation destination. The default destination is the other-panel browsed directory. If you enter a partial &URL;, &krusader; will use the current panel directory as the &URL; base.
fr: Pour copier et déplacer des fichiers, sélectionnez les simplement et appuyez sur <keycap>F5</keycap> pour les <keycap>copier</keycap> ou <keycap>F6</keycap> pour les <keycap>déplacer</keycap>. Si l'option <guimenuitem> Préserver les attributs (seulement pour les cibles locales)</guimenuitem> est cochée, &krusader; essaiera de préserver tous les attributs (heure, propriétaire, groupe) des fichiers locaux selon els sources et en accords avec vos droits d'accès : <itemizedlist> <listitem> <para>Utilisateur préservé si vous n'êtes pas le superutilisateur</para> </listitem> <listitem> <para>Groupe préservé si vous n'êtes pas le superutilisateur ou le membre du groupe</para> </listitem> <listitem> <para>Préserver l'horodatage</para> </listitem> </itemizedlist>Utiliser cette option va ralentir le processus de copie ou de déplacement. Une boîte de dialogue apparaîtra et vous permettra de choisir la destination de l'opération. La destination par défaut est le dossier parcouru sur l'autre panneau. Si vous entrez dans un &URL; partiel, &krusader; utilisera le dossier du panneau courant comme &URL; de base.

source: Queue manager
fr: Gestionnaire de files d'attente

source: Use <keycap>F5</keycap> (copy) or <keycap>F6</keycap> (move) and than <keycap>F2</keycap> to use it. Or the direct shortcuts: copy by queue <keycombo action="simul"><keycap>Backspace</keycap><keycap>F5</keycap></keycombo> , move by queue <keycombo action="simul"><keycap>Backspace</keycap><keycap>F6</keycap></keycombo> . Queueing is used for one-by-one copying. E.g. if you have a pen drive (which is slow), and you want to copy 40 files onto it, it's much better copying them one-by-one instead of starting to copy 40 files parallelly. That's why enqueuing is important. If you pack/unpack 40 files parallelly, you overload your computer, but adding them to a queue (which is not yet implemented into Krusader), is much more useful.
fr: Utilisez <keycap>F5</keycap> (copier) ou <keycap>F6</keycap> (déplacer) et <keycap>F2</keycap> pour l'utiliser. Ou les raccourcis de dossier : copier dans file d'attente <keycombo action="simul"><keycap>Backspace</keycap><keycap>F5</keycap></keycombo>, déplacer dans la file d'attente <keycombo action="simul"><keycap>Backspace</keycap><keycap>F6</keycap></keycombo>. La mise en file d'attente est utilisée en copiant un par un. &pex; si vous avez un clé USB qui est lente, et que vous voulez copier 40 fichiers dessus, il est préférable de les copier un par un à la place de démarrer 40 copies en parallèle. C'est pourquoi la mise en file d'attente est importante. Si vous décompressez ou compressez 40 fichiers en parallèle, vous surchargez votre ordinateur, mais les ajouter en file d'attente (qui n'est pas encore ajouté dans Krusader) est beaucoup plus utile.

source: Deleting
fr: Supprimer
