Repository: CodeCollect/krusader
Catalog: doc/i18n/*/basic-functions.docbook.po
Languages: fr

source: Deleting files/directories is done by selecting them and pressing <keycap>F8</keycap> or <keycap>Delete</keycap>. By <link linkend="konfig-general">default</link> it will be moved to &kde;'s Trash. You can open the KDE Trash with <filename>trash:/</filename> ("kdebase3-runtime" needs to be installed, otherwise the KDE trash protocol will not work). Phisically KDE Trash is located in <filename>~/.local/share/Trash/</filename> . <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Delete</keycap></keycombo> will delete the file permanently. A dialog will ask for your confirmation and will warn you when deleting non-empty directories. Of course only operations that you are permitted to do by the Operating System will be performed - you will be notified otherwise. If you do not wish to see the confirmation dialogs, you can disable them in the <link linkend="konfig-advanced">Konfigurator advanced tab</link>.
fr: Supprimer des fichiers et dossiers est réalisé en les sélectionnant et en appuyant sur <keycap>F8</keycap> ou <keycap>Suppr</keycap>. Par <link linkend="konfig-general">défaut</link> ils seront déplacés vers la corbeille de &kde;. Vous pouvez ouvrir la corbeille de KDE avec <filename>trash:/</filename> (« kdebase3-runtime » a besoin d'être installé, sinon le protocole de corbeille de KDE ne fonctionnera pas). La corbeille physique de KDE est située dans <filename>~/.local/share/Trash/</filename>. <keycombo action="simul"><keycap>Backspace</keycap> <keycap>Suppr</keycap></keycombo> supprimera le fichier de manière permanente. Une boîte de idalogue vous demandera une confirmation et vous préviendra que vous supprimez des dossiers non vides. Bien sûr seul les opérations dont vous avez les doirts d'accès sur votre ordinateur seront réalisées, sinon vous serez averti. Si vous ne souhaitez pas voir les boîtes de confirmation, vous pouvez les désactiver dans <link linkend="konfig-advanced">l'onglet avancé de Konfigurator/link>.

source: Shred Files
fr: Effacer définitivement des fichiers avec Shred

source: Shred was removed from KDE4 (and as consequence Krusader-2 for KDE4). The main reason is probably that shredding is filesystem dependent and even if you overwrite the file 100 times, it's not sure, that it'll be deleted from the disk finally. Quote from the kgpg posts: "The shred feature has been removed from the KDE library. Kgpg will not support this feature anymore. Moderns file systems use journalisation. So the shred feature should be implemented in the file system. Not in kgpg." But you might use a proper shred <link linkend="useractions">UserAction</link> for your filesystem. But keep in mind that if you want to be 100% shure that it's impossible that someone can read a deleted file, you need to destroy your harddrive hardware ...
fr: Shred a été supprimé de KDE4 (et par conséquent de Krusader-2 pour KDE4). La raison principale est probablement qu'effacer définitivement des fichiers est dépendant du système des fichiers et même si vous écrivez 100 fois le fichier, il n'est pas sûr qu'il sera supprimé finallement du disque. Extrait des topics de kgpg : « La fonctionnalité Shred a été supprimée des bibliothèques kDE. Kgpg ne gèrera plus cette fonctionnalité. Les systèmes de fichiers modernes utilisent la journalisation. La fonctionnalité Shred devrait être donc implantée dans le système de fichiers. Non dans kgpg ». Mais vous pouvez utiliser un shred propre dans les <link linkend="useractions">actions utilisateur</link> pour votre système de fichiers. Mais gardez à l'esprit que si vous voulez être sûr à 100 % que personne ne peut lire un fichier supprimé, vous avez besoin de détruire votre disque dur...

source: Renaming Files, Creating Directories and Link Handling
fr: Renommer des fichiers, créer des dossiers et gestion des liens

source: <keycap>Rename</keycap> the file under the cursor with the <keycap>F9</keycap> key or with two single mouse clicks. If only the file name needs to be renamed and not the extension, you can configure this in the <link linkend="konfig-looknfeel">Konfigurator Look &amp; Feel page</link>. <keycap>Create a new directory</keycap> with the <keycap>F7</keycap> key. <keycap>Right-clicking on a regular file</keycap> will give you the <keycap>option "New Symlink"</keycap>. A dialog will prompt you to enter a symlink name. That name will point to the file/directory you Right-Clicked on. If the file you Right-Clicked on is a symlink, you will also be presented with the "redirect link" option that will allow you to change the link target.
fr: <keycap>Renommer</keycap> le fichier sous le curseur avec la touche <keycap>F9</keycap> ou avec deux simples clics de souris. Si le nom de fichier a simplement besoin d'être renommé et non l'extension, vous pouvez configurer cela dans la <link linkend="konfig-looknfeel">page d'apparence &amp; ergonomie de Konfigurator</link>. <keycap>Créer un nouveau dossier</keycap> avec la touche <keycap>F7</keycap>. <keycap>Cliquer-droit sur un fichier régulier</keycap> vous donnera l'option <keycap>nouveau lien symbolique</keycap>. Une boîte de dialogue apparaîtra pour saisir un nom de lien symbolique. Ce nom pointera vers le fichier ou dossier où vous avez réalisé le clic-droit. Si le fichier sélectionné est un lien symbolique, un « lien de redirection » s'affichera qui vous permettra de modifier le lien cible.

source: Viewing and Editing files
fr: Afficher et modifier des fichiers

source: <link linkend="krviewer">KrViewer</link> has a chapter of its own.
fr: <link linkend="krviewer">KrViewer</link> a son propre chapitre.
