Repository: CodeCollect/krusader
Catalog: doc/i18n/*/bookmarks.docbook.po
Languages: fr

source: BookMan: Organize your Bookmarks
fr: BookMan : organiser vos signets

source: Bookmarks
fr: Signets

source: BookMan is &krusader;'s Bookmark tool for bookmarking folders, local- and <link linkend="remote-connections">remote URL's</link>, and later returning to them in a click of a button. The Bookman menu is divided into four sections:
fr: BookMan est un outil de signets pour &krusader; pour vos dossiers favoris locaux et les <link linkend="remote-connections">URL distants</link>, et pour retourner à ces signets plus tard en cliquant sur un bouton. Le menu de BookMan est divisé en quatre sections :

source: Your personal bookmarks
fr: Vos signets personnels

source: Popular &URL;'s
fr: URL les plus utilisés

source: <para>Permanent bookmarks</para>
fr: <para>Signets permanents</para>

source: <para>Manage bookmarks</para>
fr: <para>Gérer les signets</para>

source: You can bookmark inside a remote file system (&FTP; or SAMBA) and later use the bookmark to quickly connect to the remote machine, but you cannot bookmark inside an archive.
fr: Vous pouvez créer des signets dans un système de fichiers distant (comme &FTP; ou Samba) et utiliser les signets plus tard pour vous connecter rapidement à une machine distante, mais vous ne pouvez pas créer des signets à l'intérieur d'une archive.

source: <title>Bookmark menu</title>
fr: <title>Menu des signets</title>

source: <phrase>Bookmark menu</phrase>
fr: <phrase>Menu des signets</phrase>

source: Using Bookmarks
fr: Utilisation des signets

source: Usually, you click on the <guibutton>Bookmark</guibutton> button when you are in the target folder. For example, to bookmark <filename class="directory">/usr/tmp</filename>, navigate &krusader; there and click the <guibutton>Bookmark</guibutton> button and select <guimenuitem>Bookmark Current</guimenuitem>. When the <guilabel>Bookmark Current</guilabel> dialog box appears, the &URL; line will say <filename class="directory">/usr/tmp</filename>. <guilabel>Name</guilabel> is for the name you would like to give to the bookmark (e.g.: temporary folder). Hotkeys are supported by adding <literal>&amp;</literal> to the bookmark name &eg; <literal>&amp;sourceforge, &amp;home, down&amp;loads</literal> &etc;, so you can quickly call the bookmark name with <keycombo action="simul">&Alt; <keycap>foo</keycap></keycombo>. If you add the bookmark without entering a name, the bookmarks name will be the same as its target. <guilabel>URL</guilabel> is where the bookmark points to. <guilabel>Create in</guilabel> creates bookmark folders for organizing your bookmarks.
fr: Habituellement, vous cliquez sur le bouton <guibutton>Signets</guibutton> quand vous êtes dans le dossier cible. Par exemple, pour créer un signet pour <filename class="directory">/usr/tmp</filename>, placez vous dans ce dossier et cliquez sur le bouton <guibutton>Signets</guibutton> et sélectionnez <guimenuitem>Signet courant</guimenuitem>. Quand la boîte de dialogue <guimenuitem>Signet courant</guimenuitem> apparaît, la ligne d'URL affichera <filename class="directory">/usr/tmp</filename>. Le <guilabel>Nom</guilabel> est celui que vous voulez donner au signet (&pex; dossier temporaire). Les raccourcis clavier sont gérés en ajoutant <literal>&amp;</literal> au nom du signet, &pex; <literal>&amp;sourceforge, &amp;home, télé&amp;chargement</literal> &etc;. Vous pouvez donc rapidement appelé le nom du signet avec la combinaison de touches <keycombo action="simul">&Alt; <keycap>toto</keycap></keycombo>. Si vous ajoutez le signet sans saisir un nom, le nom du signet sera le même que celui de la cible de <guilabel>l'URL</guilabel> vers lequel pointe le signet. <guilabel>Créer dans</guilabel> crée des dossiers de signets pour l'organisation de vos signets.

source: Navigation in bookmarks:
fr: Navigation dans les signets :

source: Start typing letters
fr: Démarrer en saisissant des lettres

source: &eg; when you type <literal>'h'</literal> and only one bookmark starts with <literal>'h'</literal>, it is executed immediately - no enter needed
fr: &pex; quand vous saisissez un <literal>h</literal> et que seulement un signet démarre avec un <literal>h</literal>, il est immédiatement exécuté, pas besoin de saisir d'autres lettres.

source: If more than one bookmarks begins with <literal>'h'</literal>, you will have to continue adding letters, until you have specified enough and again, the bookmark is executed.
fr: Si plus d'un signet commence par un <literal>h</literal>, vous devrez continuer à ajouter des lettres jusqu'à ce que vous en avez spécifié assez et là encore le signet est exécuté.

source: Password handling
fr: Prise en charge du mot de passe

source: One of the benefits of the <link linkend="bookman">bookmark manager</link> is that the passwords are saved using &kde;'s services - where &eg; your &konqueror;/&kmail; password are saved. If you have a wallet, &kde; will save the passwords there. By clicking the bookmarks, a dialog will open and ask for your username and password. Supply them and click 'save password'. The passwords and usernames will be saved securely by &kde;'s wallet (make sure it is enabled by your distro). The downside here is that if you reinstall and do not backup your passwords from the wallet as well as &krusader;'s bookmark file, something will be lost.
fr: Un des avantages de la <link linkend="bookman">Gestion des signets</link> est que les mots de passe sont enregistrés en utilisant les services de &kde;, où &pex; votre mot de passe &konqueror;/&kmail; est enregistré. Si vous avez un portefeuille, &kde; enregistrera les mots de passe dedans. En cliquant sur les signets, une boîte de dialogue s'ouvrira et vous demandera votre nom d'utilisateur et mot de passe. Saisissez les et cliquez sur « Mémoriser le mot de passe ». Les mots de passe et noms d'utilisateur seront enregistrés de manière sécurisée par le portefeuille &kde; (veuillez vous assurer que le portefeuille est activé dans votre distribution). Le désavantage ici est que si vous ré-installez et ne faites pas de copie de vos mots de passe depuis le portefeuille ainsi que les signets de &krusader;, tout sera perdu.

source: <title>Popular URL's</title>
fr: <title>URL les plus utilisés</title>

source: <primary>Popular URL's</primary>
fr: <primary>URL les plus utilisés</primary>

source: Open the <guilabel>Popular URL's</guilabel> or use <keycombo action="simul">&Ctrl; <keycap>z</keycap></keycombo>
fr: Ouvrez les <guilabel>URL les plus utilisés</guilabel> ou utilisez <keycombo action="simul">&Ctrl; <keycap>Z</keycap></keycombo>

source: Type a few letters to narrow the search
fr: Saisissez des lettres pour restreinte la recherche

source: Press enter (you will go to the &URL; list)
fr: Appuyez sur &Enter; (cela vous amènera à la liste d'&URL;)

source: Press enter again and the panel is refreshed
fr: Appuyez encore une fois et le panneau est rafraîchit

source: <title>Permanent bookmarks</title>
fr: <title>Signets permanents</title>

source: <guilabel>Media</guilabel> uses &kde;'s <link linkend="konfig-advanced">Media protocol</link> <filename>media:/</filename>
fr: <guilabel>Média</guilabel> utilise le <link linkend="konfig-advanced">protocole de média</link> <filename>media:/</filename> de &kde;.

source: <guilabel>Local Network</guilabel> uses &kde;'s <filename>lan:/</filename> protocol.
fr: <guilabel>Réseau local</guilabel> utilise le protocole <filename>lan:/</filename> de &kde;.

source: <guilabel>Jump back</guilabel> or <keycombo action="simul">&Ctrl; <keycap>J</keycap></keycombo> brings you back to your starting position when you did create a new tab in the panel window. This feature is very handy if you go deep into a directory tree, than you can return with one action to the starting point. With <guilabel>Set jump back point here</guilabel> or <keycombo action="simul"> &Ctrl;&Shift; <keycap>J</keycap></keycombo> sets the current directory as a jump back point.
fr: <guilabel>Aller au point de retour</guilabel> ou <keycombo action="simul">&Ctrl; <keycap>J</keycap></keycombo> vous ramène à votre point de départ quand vous avez créé un nouvel onglet dans le panneau. Cette fonctionnalité est très pratique si vous naviguez en profondeur dans l'arborescence de fichiers, vous pouvez donc retourner en une action au point de départ. <guilabel>Définir le point de retour ici</guilabel> ou <keycombo action="simul"> &Ctrl;&Maj; <keycap>J</keycap></keycombo> configure le dossier courant comme un point de retour.

source: <title>Manage bookmarks</title>
fr: <title>Gestion des signets</title>

source: Bookmarks as action buttons on the Toolbar
fr: Les signets comme des boutons d'action sur la barre d'outils
