Repository: CodeCollect/krusader
Catalog: doc/i18n/*/credits-and-license.docbook.po
Languages: fr

source: Credits and License
fr: Remerciements et licence

source: Credits
fr: Remerciements

source: License
fr: Licence

source: Program copyright 2000-2003 Shie Erlich and Rafi Yanai, 2004-2008 &krusader; Krew <email>krusader * users.sourceforge net</email>
fr: Copyright du programme 2000-2003 Shie Erlich et Rafi Yanai, 2004-2008 &krusader; Krew <email>krusader * users.sourceforge net</email>

source: Contributors: We would like to thank all the &krusader; users who submitted bugs, wishes and patches. Sorry we can't mention all of you.
fr: Contributeurs : nous aimerions remercier tous les utilisateurs de &krusader; qui ont rapporté des bogues, souhaits et patchs. Désolé de ne pas pouvoir tous vous mentionner.

source: Donations: We would like to thank the following organisations and individuals for their recent financial <ulink url="http://sourceforge.net/project/project_donations.php?group_id=6488"> support</ulink>. In addition we would to thank those who have contributed <ulink url="http://sourceforge.net/project/project_donations.php?group_id=6488"> anonymously</ulink>. Your support is very much appreciated.
fr: Donations : nous aimerions remercier les organisations et personnes suivantes pour leur <ulink url="http://sourceforge.net/project/project_donations.php?group_id=6488"> aide</ulink> financière récente. Nous voulons de plus remercier ceux qui ont contribué de manière <ulink url="http://sourceforge.net/project/project_donations.php?group_id=6488">anonyme</ulink>. Votre aide est très appréciée.

source: Sven Opitz (the first donation ever !)
fr: Sven Opitz, le tout premier donateur !

source: Christian Bock (webspace)
fr: Christian Bock (espace web)

source: Special thanks to:
fr: Remerciements spéciaux à :

source: Jiri Klement, &kde;4 porting help
fr: Jiri Klement, pour l'aide au portage vers &kde;4

source: Technical Communication team of 2007, University of Oulu, Finland; Documentation for &krusader; 1.80.0
fr: L'équipe de communication technique de 2007, University of Oulu, Finland; Documentation pour &krusader; 1.80.0

source: V&aacute;clav J&uring;za, QA, bug-hunting, patches and general help
fr: V&aacute;clav J&uring;za, QA, chasse au bogues, patchs et aide générale

source: Ji&rcaron;&iacute; Pale&ccaron;ek, QA, bug-hunting, patches and general help
fr: Ji&rcaron;&iacute; Pale&ccaron;ek, QA, chasse au bogues, patchs et aide générale

source: Andrew Neupokoev (nwmod) &krusader; Logo and Icons, art contest winner.
fr: Andrew Neupokoev (nwmod) Icônes et logo pour &krusader; et vainqueur du concours artistique.

source: Terry "Fudoki" Wilkinson, handbook proofreader
fr: Terry « Fudoki » Wilkinson, manuel et relecteur

source: G&aacute;bor Lehel (illissius), Viewer module for the 3rd Hand Panel
fr: G&aacute;bor Lehel (illissius), pour le module d'affichage pour le panneau tierce partie

source: David Harel, panel toolbar buttons
fr: David Harel, pour les boutons de la barre d'outils du panneau

source: Jan Willem van de Meent (Adios), &krusader; icons
fr: Jan Willem van de Meent (Adios), pour les icônes de &krusader;

source: <ulink url="http://usefularts.org/">usefularts.org</ulink>, &krusader; icons
fr: <ulink url="http://usefularts.org/">usefularts.org</ulink>, pour les icônes de &krusader;

source: Hans Loffler, directory history list
fr: Hans Loffler, pour la liste d'historique des dossiers

source: Jan Halasa, new bookmark module
fr: Jan Halasa, pour le nouveau module de signets

source: Mikolaj Machowski, Usability and QA
fr: Mikolaj Machowski, Utilisation et QA

source: Cristi Dumitrescu, QA, bug-hunting, patches and general help
fr: Cristi Dumitrescu, QA, chasse au bogues, patchs et aide générale

source: Aurelien Gateau, patch for KViewer
fr: Aurélien Gateau, pour le patch pour KViewer

source: Milan Brabec, the first patch ever !
fr: Milan Brabec, pour le tout premier patch !

source: Thanks to the Documentation translators:
fr: Remerciements pour les traducteurs de la documentation :

source: Russian: Roman Batejkin
fr: Russe : Roman Batejkin

source: Documentation Copyright 2000-2003 Shie Erlich and Rafi Yanai. Copyright 2004-2008 &krusader; Krew <email>krusader@users.sourceforge.net</email>.
fr: Copyright de la documentation 2000-2003 Shie Erlich et Rafi Yanai. Copyright 2004-2008 &krusader; Krew <email>krusader@users.sourceforge.net</email>.

source: This program is licensed under the terms of the <ulink url="http://www.gnu.org/copyleft/gpl.html">GNU General Public License</ulink> Version 2, June 1991.
fr: Ce programme est distribué sous les termes de la <ulink url="http://www.gnu.org/copyleft/gpl.html">GNU General Public License</ulink> Version 2, June 1991.

source: This documentation is licensed under the terms of the <ulink url="http://www.gnu.org/copyleft/fdl.html">GNU Free Documentation License</ulink>.
fr: La documentation est distribuée sous les termes de la <ulink url="http://www.gnu.org/copyleft/fdl.html">GNU Free Documentation License</ulink>.
