Repository: CodeCollect/krusader
Catalog: doc/i18n/*/diskusage.docbook.po
Languages: fr

source: <title>Disk Usage</title>
fr: <title>Utilisation du disque</title>

source: <primary>Disk Usage</primary>
fr: <primary>Utilisation du disque</primary>

source: Disk Usage Keybindings, right click menu.
fr: Raccourcis pour l'utilisation du disque et le menu par un clic-droit

source: <keycap>Del</keycap>: Delete
fr: <keycap>Suppr</keycap> <guimenuitem>Supprimer</guimenuitem>

source: <keycombo action="simul">&Ctrl; <keycap>e</keycap></keycombo>: Exclude
fr: <keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo> <guimenuitem>Exclure</guimenuitem>

source: <keycombo action="simul">&Ctrl; <keycap>n</keycap></keycombo>: new search
fr: <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> <guimenuitem>Nouvelle recherche</guimenuitem>

source: <keycombo action="simul">&Ctrl; <keycap>r</keycap></keycombo>: refresh
fr: <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> <guimenuitem>Rafraîchir</guimenuitem>

source: <keycombo action="simul">&Ctrl; <keycap>i</keycap></keycombo>: include all
fr: <keycombo action="simul">&Ctrl; <keycap>I</keycap></keycombo> <guimenuitem>Tout inclure</guimenuitem>

source: View menu:
fr: Le sous-menu <guimenu>Vue</guimenu>

source: <keycombo action="simul">&Ctrl; <keycap>l</keycap></keycombo>: Line view
fr: <keycombo action="simul">&Ctrl; <keycap>l</keycap></keycombo> <guimenuitem>Lignes</guimenuitem>

source: <keycombo action="simul">&Ctrl; <keycap>d</keycap></keycombo>: Detailed view
fr: <keycombo action="simul">&Ctrl; <keycap>D</keycap></keycombo> <guimenuitem>Détaillé</guimenuitem>

source: <keycombo action="simul">&Ctrl; <keycap>f</keycap></keycombo>: Filelight view
fr: <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> <guimenuitem>Filtre de fichiers</guimenuitem>
