Repository: CodeCollect/krusader
Catalog: doc/i18n/*/faq.docbook.po
Languages: fr

source: Frequently Asked Questions (&FAQ;)
fr: Foire aux questions (&FAQ;)

source: If you have problems with &krusader; please check the <link linkend="installation">Installation procedure</link>, as your problem may be caused by a bad installation.
fr: Si vous avez un problème avec &krusader;veuillez vérifier la <link linkend="installation">procédure d'installation</link>, votre problème peut avoir comme cause une mauvaise installation.

source: The &FAQ; is divided into three sections: <itemizedlist> <listitem> <para> <link linkend="faq_installation">Installation &FAQ;</link> (this page)</para> </listitem> <listitem> <para> <link linkend="faq_usage">Usage &FAQ;</link> (issues with running/using &krusader;)</para> </listitem> <listitem> <para> <link linkend="faq_general">General &FAQ;</link> (bug reports, forum, mailing list, ...)</para> </listitem> </itemizedlist>If you feel that a &FAQ; is missing or if something is not clear to you, please <link linkend="editors_note">let us know</link>.
fr: La &FAQ; est divisée en trois sections : <itemizedlist> <listitem> <para> <link linkend="faq_installation">&FAQ; de l'installation</link> (cette page)</para> </listitem> <listitem> <para> <link linkend="faq_usage">&FAQ; sur l'utilisation</link> (questions à propos du lancement et de l'utilisation de &krusader;)</para> </listitem> <listitem> <para> <link linkend="faq_general">&FAQ; générale</link> (rapports de bogues, forum, listes de diffusion)</para> </listitem> </itemizedlist>Si vous sentez qu'il manque quelque chose à cette &FAQ; ou que quelque chose n'est pas clair, veuillez <link linkend="editors_note">nous le faire savoir</link>.

source: Installation &FAQ;
fr: &FAQ; sur l'installation

source: Does &krusader; need &kde; to run?
fr: &krusader; a t-il besoin de &kde; pour se lancer ?

source: You do not need to switch to the &kde; window manager to use &krusader;; you can still use <ulink url="http://www.gnome.org"><application>GNOME</application></ulink>, <ulink url="http://www.afterstep.org/"><application>AfterStep</application></ulink>, <ulink url="http://www.xfce.org/"><application>XFce</application></ulink> or another window manager. However, the configuration of the &krusader; fonts and some behavior is done by running <command>kcontrol</command>.
fr: La configuration des polices de &krusader; et de certains comportements est réalisées en lançant <command>kcontrol</command>.

source: A lot depends on what you want to do with &krusader;. You should know that &krusader; uses the &kde; KIO Slaves to access remote file systems, and support for only a limited number of file system types are shipped with KDE libraries, most of the KIO Slave are bundled with KDE base (including fish, sftp and tar). However, if you want the property-dialog to show EXIF-data for .jpeg's, you need &kde;graphics. If you want ID3-infos, you need &kde;multimedia, and so on.
fr: Certaines choses dépendent de ce que vous voulez faire avec &krusader;. Vous devez savoir que &krusader; utilise les modules entrées / sorties de &kde; pour accéder à des systèmes de fichiers distants et gère un nombre limité de types de systèmes de fichiers qui sont empaquetés avec les bibliothèques de &kde;, la plupart des modules KIOSlave sont livrés avec la base de KDE (incluant fish, sftp et tar). Cependant, si vous voulez les boîtes de dialogue de propriétés pour afficher les données EXIF pour les images JPEG, vous avez besoin de &kde;-graphics. Si vous voulez les informations ID3, vous avez besoin de &kde;-multimedia, et ainsi de suite.

source: To summarize, if you want a working &krusader; - install &kde;libs. If you want a functional &krusader; then you need &kde;libs + &kde;base. For maximum functionality, &krusader; needs all of the &kde; package libraries, but the &kde; window manager is optional.
fr: Pour résumer, si vous voulez un &krusader; qui marche, installez &kde-libs;. Si vous voulez un &krusader; fonctionnel, vous avez besoin de &kde-libs; et &kde;-base, &krusader; a besoin de tous les paquetages de bibliothèques de &kde;, mais le gestionnaire de fenêtres est optionnel.

source: Which libraries does &krusader; need to run?
fr: De quelles bibliothèques a besoin &krusader; pour se lancer ?

source: Take a look at the <link linkend="compilation">Krusader dependencies</link> paragraph of our install chapter.
fr: Jetez un œil au paragraphe des <link linkend="compilation">dépendances de Krusader</link> de notre chapitre d'installation.

source: If you need more details please take a look at the <ulink url="http://packages.ubuntu.com/jaunty/krusader">Krusader requirements</ulink> on Ubuntu. The "depends" are required, the "suggests" make Krusader more powerful.
fr: Si vous avez besoin de plus de détails, veuillez lire les <ulink url="http://packages.ubuntu.com/jaunty/krusader">prérequis de Krusader</ulink> sur Ubuntu. Les « dépendances » sont requises et les « suggestions » rendent Krusader plus puissant.

source: I have followed all the steps but <command>make</command> complains about missing libs or headers. What do I need to do?
fr: J'ai suivi toutes les étapes mais la commande <command>make</command> se plaint qu'il manque des bibliothèques ou des en-têtes. Que dois-je faire ?

source: Install the missing packages.
fr: Installez les paquetages manquants.

source: Take a look at the <link linkend="compilation">Compilation requirements</link> paragraph of our install chapter.
fr: Lisez le paragraphe des <link linkend="compilation">prérequis de compilation</link> de notre chapitre d'installation.

source: If you ca not find the needed package, use <ulink url="http://rpmfind.net/linux/rpm2html/search.php?query=krusader&amp;submit=Search+...">rpmfind</ulink> and click 'missing lib or header' in the search line. Or use <command>apt-cache search <replaceable>foo</replaceable></command> to find the corresponding package for <trademark class="registered">Debian</trademark> based distributions.
fr: Si vous ne pouvez pas trouver le paquetage nécessaire, utilisez <ulink url="http://rpmfind.net/linux/rpm2html/search.php?query=krusader&amp;submit=Search+...">rpmfind</ulink> et saisissez la bibliothèque manquante dans la ligne de recherche. Ou utilisez <command>apt-cache search <replaceable>toto</replaceable></command> pour trouver le paquetage correspondant pour les distributions fondées sur Debian.

source: How do I compile &krusader; when I'm using a 64 bit processor ?
fr: De quelle manière dois-je compiler &krusader; quand j'utilise un processeur 64 bits ?

source: As far as we know, there are no issues. &krusader; is also available on <ulink url="http://packages.debian.org/unstable/utils/krusader"> many other architectures</ulink>.
fr: De ce que nous en savons, il n'y pas de problèmes. &krusader; est aussi disponible sur <ulink url="http://packages.debian.org/unstable/utils/krusader"> d'autres architectures</ulink>.

source: I have downloaded the Source RPM <filename>krusader-x.xx.dist.src.rpm</filename>, what to do now?
fr: J'ai téléchargé les source RPM <filename>krusader-x.xx.dist.src.rpm</filename>, que faire maintenant ?

source: Check the ownership and the permissions on <filename class="directory"> /usr/src/RPM/</filename> and all recursive directories that your normal user can read-write-execute in these directories.
fr: Vérifiez le propriétaire et les droits d'accès sur <filename class="directory"> /usr/src/RPM/</filename> et tous les dossiers récursifs. Votre utilisateur doit pouvoir lire / écrire / exécuter ces dossiers.

source: To produce the binary RPM for your computer, do this:
fr: Pour produire un RPM binaire pour votre ordinateur, faites ceci :

source: <prompt>$</prompt> <userinput><command>rpm</command> <option>--rebuild</option> <replaceable>&lt;/path/to/rpmfile/&gt; krusader-x.xx.dist.src.rpm</replaceable></userinput>
fr: <prompt>$</prompt> <userinput><command>rpm</command> <option>--rebuild</option> <replaceable>&lt;/emplacement/vers/lefichierrpm/&gt; krusader-x.xx.dist.src.rpm</replaceable></userinput>

source: If all <link linkend="faqi_missing_libs"> dependencies</link> are OK, a binary RPM <filename>krusader-x.xx.dist.rpm</filename> will be created at <filename class="directory"> /usr/src/RPM/RPMS/i586</filename> (replace i586 with your architecture).
fr: Si toutes les <link linkend="faqi_missing_libs"> dépendances</link> sont installées, un RPM binaire <filename>krusader-x.xx.dist.rpm</filename> sera créé dans <filename class="directory"> /usr/src/RPM/RPMS/i586</filename> (remplacez i586 par votre architecture).

source: Test the binary RPM for errors before installing: <screen><prompt>$</prompt> <userinput><command>rpm</command> <option>-i --test</option> <replaceable>&lt;/path/to/rpmfile&gt; krusader-x.xx.dist.rpm</replaceable></userinput></screen> If the prompt returns without any message, then everything is OK.
fr: Testez le RPM binaire pour rechercher d'éventuelles erreurs avant de l'installer : <screen><prompt>$</prompt> <userinput><command>rpm</command> <option>-i --test</option> <replaceable>&lt;/emplacement/vers/lefichierrpm&gt; krusader-x.xx.dist.rpm</replaceable></userinput></screen> Si le terminal n'affiche aucun messages d'erreurs, vous pouvez installer le RPM binaire.

source: Install the binary RPM as usual, for example: <screen><prompt>$</prompt> <userinput><command>su -c 'rpm</command> <option>-Uvh</option> <replaceable>&lt;/path/to/rpmfile&gt; krusader-x.xx.dist.rpm</replaceable>'</userinput></screen> You will be asked to enter your root password.
fr: Installez le RPM binaire comme ceci, &pex; : <screen><prompt>$</prompt> <userinput><command>su -c 'rpm</command> <option>-Uvh</option> <replaceable>&lt;/emplacement/vers/lefichierrpm&gt; krusader-x.xx.dist.rpm'</replaceable>'</userinput></screen> Le terminal vous demandera de saisir votre mot de passe.

source: Now you can <link linkend="starting-krusader"> start</link> &krusader;.
fr: Maintenant vous pouvez <link linkend="starting-krusader"> démarrer</link> &krusader;.

source: For more information about RPM, visit <ulink url="http://www.rpm.org/">rpm.org</ulink> and read the <ulink url="http://fedora.redhat.com/docs/drafts/rpm-guide-en/">RPM Guide</ulink> by Eric Foster-Johnson.
fr: Pour plus d'informations à propos des RPM, visitez le site web <ulink url="http://www.rpm.org/">rpm.org</ulink> et lisez le <ulink url="http://fedora.redhat.com/docs/drafts/rpm-guide-en/">guide RPM</ulink> par Eric Foster-Johnson.

source: I'm trying to install binary foo (RPM or DEB package), but it fails. What's wrong?
fr: J'ai essayé d'installer le binaire toto (en paquetage RPM ou DEB) mais l'installation a échoué. Que se passe t-il ?

source: Since we only prepare (and use) the source, we have no way of knowing this. Did you test the binary RPM before installing? <screen><prompt>$</prompt> <userinput><command>rpm</command> <option>-i --test</option> <replaceable>&lt;/path/to/rpmfile&gt; krusader-x.xx.dist.rpm</replaceable></userinput></screen> If the prompt returns without any message, then everything is OK. RPM's downloaded from our website are usually provided by &krusader; users. Visit your distro website and search for an updated RPM.
fr: Depuis que nous préparons (et utilisons) les sources, nous n'avons aucun moyens de savoir cela. Avez-vous testé le RPM binaire avant de l'installer ? <screen><prompt>$</prompt> <userinput><command>rpm</command> <option>-i --test</option> <replaceable>&lt;/emplacement/vers/lefichierrpm&gt; krusader-x.xx.dist.rpm</replaceable></userinput></screen> Si le terminal n'affiche aucun messages d'erreurs, tout est normal. Les RPM téléchargés depuis notre site web sont habituellement fournis par les utilisateurs de &krusader;. Votre distribution fournit sûrement des mises à jours pour ce RPM.

source: If the RPM is not OK, try to find another package at &Linux; software archives such as <ulink url="http://freshmeat.net/projects/krusader/">freshmeat.net</ulink> or <ulink url="http://www.kde-apps.org/content/show.php?content=10214">KDE-APPS.org</ulink>. If you still can't find the appropriate package for your &Linux; distribution, we recommend searching for it with <ulink url="http://rpmfind.net/linux/rpm2html/search.php?query=krusader&amp;submit=Search+...">rpmfind</ulink> or <ulink url="http://rpm.pbone.net/index.php3/stat/3/search/krusader">rpmpbone</ulink>.
fr: Si le RPM n'est pas conforme, essayez de trouver un autre paquetage dans les archives logiciels de &Linux;, comme <ulink url="http://freshmeat.net/projects/krusader/">freshmeat.net</ulink> ou <ulink url="http://www.kde-apps.org/content/show.php?content=10214">KDE-APPS.org</ulink>. Si vous ne trouvez toujours pas le paquetage approprié pour votre distribution &Linux;, nous vous recommandons de le rechercher sur <ulink url="http://rpmfind.net/linux/rpm2html/search.php?query=krusader&amp;submit=Search+...">rpmfind</ulink> ou <ulink url="http://rpm.pbone.net/index.php3/stat/3/search/krusader">rpmpbone</ulink>.

source: I can't find an RPM or DEB package for &krusader;, what to do?
fr: Je ne trouve pas de paquetages RPM ou DEB pour &krusader;. Que faire ?

source: Check if your distribution provides &krusader;, if it doesn't then contact your distribution creator and ask them to include &krusader;!
fr: Vérifiez si votre distribution fournit &krusader;. Si non, contactez le créateur de votre distribution et demandez lui d'inclure &krusader; !

source: Did you take a look at the &URL;'s on the <link linkend="installation">Installation procedure</link> page? If you have and found nothing, you can always compile &krusader; from source. Even if you feel you haven't got the necessary skills, you will probably succeed in compiling &krusader;: we provide a very detailed installation procedure. This HowTo enables newcomers to compile &krusader; from source, even if they have never done a compilation from source before, just follow the instructions carefully. Feel free to post a <link linkend="faqi_help_request">help request</link> if you encounter problems.
fr: Avez-vous visité l'&URL; de la page de <link linkend="installation">procédure d'installation</link> ? Si vous n'avez rien trouvé, vous pouvez toujours compiler &krusader; depuis les sources. Même si vous sentez ne pas avoir les ressources nécessaires, vous réussirez probablement la compilation : nous fournissons une procédure d'installation très détaillée. Ce « Comment Faire » permet aux nouveaux venus de compiler &krusader; depuis les sources, même s'ils n'ont jamais lancé une compilation depuis les sources avant, suivez simplement les instructions attentivement. Vous pouvez poster un message <link linkend="faqi_help_request">de demande d'aide</link> si vous rencontré des problèmes.

source: I've installed &krusader;, but when I start, only the <guimenu>"Help"</guimenu> menu appears. Why?
fr: J'ai installé &krusader;, mais au démarrage, seul le menu <guimenu>Aide</guimenu> apparaît. Pourquoi ?

source: Some new menu items are missing after updating &krusader;, what's wrong?
fr: Des éléments du menu sont manquants après mise à jour de k&rusader;. Que dois-je faire ?

source: The <filename>krusaderui.rc</filename> file is stored in <filename> $KDEDIR/share/apps/krusader/krusaderui.rc</filename>. When you change the <guilabel>"Toolbar"</guilabel>, &kde; makes a copy of that file in the home directory at <filename> ~/.kde/share/apps/krusader/krusaderui.rc</filename>. If Krusader was previously installed on your computer, and you install a newer &krusader; version the <filename> ~/.kde/share/apps/krusader/krusaderui.rc</filename> file must be replaced with the newer version. Note: this will also reset all your changes on toolbars and shortcuts!
fr: Le fichier <filename>krusaderui.rc</filename> est stocké dans <filename> $KDEDIR/share/apps/krusader/krusaderui.rc</filename>. Quand vous modifiez la <guilabel>Barre d'outils</guilabel>, &kde; fait une copie de ce fichier dans le dossier personnel à <filename> ~/.kde4/share/apps/krusader/krusaderui.rc</filename>. Si Krusader a été précédemment installé sur votre ordinateur, et que vous avez installé une nouvelle version de Krusader, le fichier <filename> ~/.kde4/share/apps/krusader/krusaderui.rc</filename> doit être remplacé avec la nouvelle version. Remarque : cela peut aussi réinitialiser toutes les modifications sur la barre d'outils et des raccourcis clavier !

source: The first line of <filename>krusaderui.rc</filename> contains the version number. After installing a newer &krusader; version, &kde; will automatically replace the old <filename> ~/.kde/share/apps/krusader/krusaderui.rc</filename> with the newer version when starting the new &krusader; for the first time (&kde; will detect the newer version number in the first line).
fr: La première ligne du fichier <filename>krusaderui.rc</filename> contient un numéro de version. Après l'installation d'une nouvelle version de &krusader;, &kde; remplacera automatiquement l'ancien fichier <filename> ~/.kde4/share/apps/krusader/krusaderui.rc</filename> par la nouvelle version au démarrage de &krusader; pour la première fois. (&kde; détectera le nouveau numéro de version dans la première ligne).

source: If you install a CVS or beta version and &krusader; was already installed on your computer then you should delete the <filename>krusaderui.rc</filename> file from your home directory to activate the new menu entries <prompt>$</prompt> <userinput> <command>rm</command> <option> ~/.kde/share/apps/krusader/krusaderui.rc</option> </userinput>
fr: Si vous installez la version SVN ou beta et que k&rusader; est toujours installé sur votre ordinateur, vous pouvez supprimer ensuite le fichier <filename>krusaderui.rc</filename> de votre dossier personnel pour activer les nouvelles entrées du menu <prompt>$</prompt> <userinput> <command>rm</command> <option> ~/.kde4/share/apps/krusader/krusaderui.rc</option> </userinput>

source: If the <filename> ~/.kde/share/apps/krusader/krusaderui.rc</filename> file is older, then the new menu elements will not be shown. Read the previous question for information on how to update the <filename>krusaderui.rc</filename> file. If <filename>krusaderui.rc</filename> is missing or in a wrong directory, only the <guimenu>"Help"</guimenu> menu appears, please read the previous question.
fr: Si le fichier <filename> ~/.kde4/share/apps/krusader/krusaderui.rc</filename> est plus ancien, les éléments du nouveau menu ne seront pas affichés. Lisez la question précédente pour plus d'informations sur la façon de mettre à jour le fichier <filename>krusaderui.rc</filename>. Si ce fichier est manquant ou dans le mauvais dossier, seul le menu <guimenu>Aide</guimenu> apparaîtra, veuillez lire la question précédente.

source: I have a <filename>libGLcore.so.1</filename> compile error after using the <trademark class="registered">NVIDIA</trademark> installer, what to do?
fr: J'obtient une erreur de compilation <filename>libGLcore.so.1</filename> après l'utilisation de l'installateur <trademark class="registered">NVIDIA</trademark>. Que faire ?

source: This problem occurs when you use the <trademark class="registered">NVIDIA</trademark> installer and not the official <trademark class="registered">NVIDIA</trademark> packages of your distribution. &krusader; is based on &Qt; which can be linked against the X OpenGL libraries. As a result &krusader; may look for OpenGL as well. The problem is that the <trademark class="registered">NVIDIA</trademark> installer (prior to version 7xxx) doesn't perform it's task properly: it replaces the OpenGL header files (which get included into &krusader;) but doesn't set the libGL links correctly. The best solution is to use the <trademark class="registered">NVIDIA</trademark> packages provided by your distributor or a new <trademark class="registered">NVIDIA</trademark> installer, the current version at the moment of writing is 7114. If, for some reason, you must use an old <trademark class="registered">NVIDIA</trademark> driver, one solution is the following hack, the exact commands depend on the distribution used and the version of the <trademark class="registered">NVIDIA</trademark> driver (6111 in this example), but it should read something like this:
fr: Ce problème se produit quand vous utilisez l'installateur <trademark class="registered">NVIDIA</trademark> et non les paquetages officiels <trademark class="registered">NVIDIA</trademark> de votre distribution. &krusader; est fondé sur &Qt; qui peut être lié aux bibliothèques X OpenGL. &krusader; va donc rechercher OpenGL. Le problème est que l'installateur <trademark class="registered">NVIDIA</trademark> (avant les versions 7xxx) ne réalise pas la tâche de manière convenable : il remplace les fichiers d'en-têtes OpenGL (qui sont inclues dans &krusader;) mais ne configure pas les liens libGL correctement. La meilleure solution est d'utiliser les paquetages <trademark class="registered">NVIDIA</trademark> fournis par votre distribution ou un nouvel installateur <trademark class="registered">NVIDIA</trademark>. Si, pour certaines raisons, vous devez utiliser un ancien pilote <trademark class="registered">NVIDIA</trademark>, une solution est le hack suivant, la commande exacte dépend de votre distribution et de la version du pilote <trademark class="registered">NVIDIA</trademark> (6111 dans cet exemple), mais cela peut se lire de cette manière :

source: I am having trouble compiling and installing &krusader;, how do I send a help request?
fr: J'ai des problèmes pour compiler et installer &krusader;. Où puis-je envoyer un message d'aide ?

source: Please read our detailed <link linkend="compilation">installation procedure</link> and the <link linkend="faq">FAQ</link>. If you can't find a solution to your problem then feel free to post a <emphasis role="bold">help request</emphasis> at our &krusader; forum or use the <ulink url="http://groups-beta.google.com/group/krusader-users">&krusader;-users</ulink> mailing list. But before posting a help request, please try the following:
fr: Veuillez lire notre <link linkend="compilation">procédure d'installation</link> détaillée et la <link linkend="faq">&FAQ;</link>. Si vous ne pouvez pas trouver une solution à votre problème, envoyez un message sur le forum de &krusader; ou utilisez la liste de diffusion <ulink url="http://groups-beta.google.com/group/krusader-users">&krusader;-users</ulink>. mais avant de poster une demande d'aide, veuillez essayer la chose suivante :

source: Use the <ulink url="http://www.krusader.org/phpBB/search.php">Search</ulink> function on the <link linkend="faqg_kru-forum">&krusader; Forum</link>, your problem might be solved or discussed already.
fr: Utilisez la fonctionnalité de <ulink url="http://www.krusader.org/phpBB/search.php">recherche</ulink> sur le <link linkend="faqg_kru-forum">forum de &krusader;</link>, votre problème devrait être résolu ou discuté.

source: If you can't find a solution, please make a note of the following issues: <itemizedlist> <listitem> <para>the &krusader; version used</para> </listitem> <listitem> <para>the &Linux; distribution + version used</para> </listitem> <listitem> <para>a good description of the problem</para> </listitem> </itemizedlist>Without this information, it is very difficult for us to help you.
fr: Si vous ne trouvez pas de solution, rédigez un résumé de vos problèmes : <itemizedlist> <listitem> <para>la version de &krusader; utilisée</para> </listitem> <listitem> <para>la distribution &Linux; utilisée + version utilisée</para> </listitem> <listitem> <para>une bonne description du problème</para> </listitem> </itemizedlist>Without ces informations, il est très difficile pour nous de vous aider.

source: Send out your help request.
fr: Envoyez la demande d'aide.

source: Thank you for your co-operation!
fr: Merci pour votre coopération !
