Repository: CodeCollect/krusader
Catalog: doc/i18n/*/faq.docbook.po
Languages: fr

source: If the <link linkend="index">Documentation</link>, <link linkend="faq">FAQ</link>, <ulink url="http://www.krusader.org/phpBB/index.php">&krusader; Forum</ulink> and <ulink url="http://groups-beta.google.com/group/krusader-devel">&krusader;-devel</ulink> (please use the search function ) can't help you, do not hesitate to post on our forum. The &krusader; Krew or the &krusader; community is always available to help you.
fr: Si la <link linkend="index">Documentation</link>, <link linkend="faq">FAQ</link>, <ulink url="http://www.krusader.org/phpBB/index.php">forum de &krusader;</ulink> et <ulink url="http://groups-beta.google.com/group/krusader-devel">&krusader;-devel</ulink> (veuillez utiliser la fonctionnalité de recherche ) ne peuvent pas vous aider, n'hésitez pas à poster sur notre forum. L'équipe ou la communauté de &krusader; est toujours disponible pour vous aider.

source: Please use the <ulink url="http://www.krusader.org/phpBB/search.php">Search</ulink> function of the <ulink url="http://www.krusader.org/phpBB/index.php">&krusader; Forum</ulink>, your issue may have been previously discussed (this allows us to minimize the double/triple/... postings). If your issue has already been discussed in the past there is a great chance that you will have an instant solution to your problem. If the issue is currently being discussed, you can join in the discussion. Some questions are asked over and over again, that's why we have created this <link linkend="faq">FAQ</link>. This allows us to spend more time developing &krusader;.
fr: Veuillez utiliser la fonctionnalité de <ulink url="http://www.krusader.org/phpBB/search.php">Recherche</ulink> du <ulink url="http://www.krusader.org/phpBB/index.php">forum &krusader;</ulink>, votre problème peut avoir été discuté précédemment (cela permet de réduire de moitié le nombre de messages). Si votre problème a été discuté dans le passé, il y a de fortes chances que vous aurez une solution instantanée à votre problème. Si le problème est en cours de discussion, vous pouvez rejoindre la discussion. Des questions sont posées encore et encore, c'est pourquoi nous avons créé cette <link linkend="faq">FAQ</link>. Cela nous permet de passer plus de temps à développer &krusader;.

source: The <ulink url="http://www.krusader.org/phpBB/index.php">&krusader; Forum</ulink> is split into seven sections:
fr: Le <ulink url="http://www.krusader.org/phpBB/index.php">forum de &krusader;</ulink> est divisé en sept sections :

source: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=7">News and Announcements Forum</ulink>: all the latest news.
fr: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=7">Forum des nouveautés et des annonces</ulink> : les dernières nouvelles.

source: <ulink url="http://krusader.sourceforge.net/phpBB/viewforum.php?f=12">NewsLetter Forum</ulink>: all newsletters.
fr: <ulink url="http://krusader.sourceforge.net/phpBB/viewforum.php?f=12">Forum des lettres d'informations</ulink> : toutes les lettres d'informations.

source: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=3">Bug Discussion Forum</ulink>: discussions about bugs, please DO NOT use the forum for <link linkend="faqg_bug_report">bug reports</link> (except if you are unsure if you have found a bug).
fr: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=3">Forum de discussion des bogues</ulink> : discussions à propos des bogues, veuillez NE PAS utiliser ce forum pour les <link linkend="faqg_bug_report">rapports de bogues</link> (sauf si vous n'êtes pas sûr d'avoir trouvé un bogue).

source: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=6">New Features Discussion/Requests Forum</ulink>: discussions about new features for future &krusader; versions.
fr: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=6">Forum des requêtes et discussions des fonctionnalités nouvelles</ulink> : discussions à propos des nouvelles fonctionnalités pour les futures versions de &krusader;.

source: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">ToDo Forum</ulink> here you will find the list of the planned features. Registered users will be able to VOTE and COMMENT on the TODO items. Here you get the chance to push your favourite features (+3) and still prefer certain features over others (+1), if you don't care about a feature just simply don't vote on that feature. Unregistered users may only browse the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">ToDo Forum</ulink>. The <ulink url="http://www.krusader.org/todo.php">ToDo ranking system</ulink> contains the results based on the votes. <link linkend="faqg_patch">Adding ToDo items</link> or removing ToDo items which have been implemented will be done by the &krusader; Krew.
fr: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">Forum TODO</ulink> : vous trouverez ici la liste des fonctionnalités planifiées. Les utilisateurs enregistrés pourront ÔTER et COMMENTER les éléments de cette section. Vous avez la chance ici de pousser votre fonctionnalité favorite (+3) et toujours préférer certaines fonctionnalités par rapport à d'autres (+1), si une fonctionnalité ne vous intéresse pas, ne votez simplement pas pour celle-ci. Les utilisateurs enregistrés ne peuvent que parcourir le <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">forum TODO</ulink>. Le <ulink url="http://www.krusader.org/todo.php">système de rang TODO</ulink> contient les résultats fondés sur les votes. <link linkend="faqg_patch">Ajouter des éléments TODO</link> ou supprimer des éléments TODO qui ont été implantés sera fait par l'équipe de &krusader;.

source: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=11">UserActions Forum</ulink>: discussions about <link linkend="useractions">UserActions</link>. Posting your own User Actions is greatly appreciated. We plan to include the best ones in the next &krusader; releases.
fr: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=11">Forum des actions utilisateurs</ulink> : discussions à propos des <link linkend="useractions">Actions utilisateur</link>. Poster vos propres actions utilisateur est grandement apprécié. Nous planifions d'inclure les meilleures dans les prochaines versions de &krusader;.

source: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=1">General Discussion Forum</ulink>: everything that is &krusader; related and doesn't belong in the other forums.
fr: <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=1">Forum de discussion générale</ulink> : tous ce qui est relié à &krusader; et qui n'appartient pas aux autres forums.

source: We provide a<ulink url="http://krusader.sf.net/phpBB/rss.php">RSS feed</ulink> for our forums. You don't have to check for new posts all the time, instead the news will come to you!
fr: Nous fournissons un <ulink url="http://krusader.sf.net/phpBB/rss.php">flux RSS</ulink> pour nos forums. Vous n'avez pas à vérifier les nouveaux messages tout le temps, à la place les nouvelles viennent à vous !

source: How can I translate &krusader; into my native language?
fr: Comment puis-je traduire &krusader; dans ma langue natale ?

source: Please read the <ulink url="http://www.krusader.org/i18n.php">i18n page</ulink>. It's not difficult to translate! Most anyone can do it, it just takes some time.
fr: Veuillez lire la <ulink url="http://www.krusader.org/i18n.php">page i18n</ulink>. Le fichier n'est pas difficile à traduire ! Tous le monde peut le faire, cela prend simplement un peu de temps.

source: How can I support &krusader;?
fr: Comment puis-je supporter &krusader; ?

source: You can <link linkend="help_krusader"> support</link> &krusader; in many different ways. Please send us <link linkend="faqg_wish">feedback</link>, <link linkend="faqg_bug_report">bug reports</link>, patches, <link linkend="help_krusader">donations</link>, translations, ...
fr: Vous pouvez <link linkend="help_krusader"> supporter</link> &krusader; de différentes manières. Veuillez nous envoyer vos <link linkend="faqg_wish">retours</link>, <link linkend="faqg_bug_report">rapports de bogues</link>, patches, <link linkend="help_krusader">donations</link>, traductions.

source: Is there a &MacOS; X port?
fr: Existe t-il un portage pour &MacOS; X ?

source: Yes, there is &MacOS; X port, but you will not have the all the power you would have on &Linux;. Please read the <link linkend="mac-port">&MacOS; X port section</link> for more information. A recommended native file manager for &MacOS; is <ulink url="http://www.likemac.ru/english/"><trademark class="copyright">Disk Order</trademark></ulink> (shareware).
fr: Oui, il y a un portage pour &MacOS; X mais vous n'aurez pas toute la puissance que vous avez sous &Linux;. Veuillez lire la <link linkend="mac-port">section du portage pour &MacOS; X</link> pour plus d'informations. Un gestionnaire de fichiers natif recommandé pour &MacOS; X est <ulink url="http://www.likemac.ru/english/"><trademark class="copyright">Disk Order</trademark></ulink> (shareware).

source: Is there a &Windows; port?
fr: Existe t-il un portage pour &Windows; ?

source: Yes, since 18 June 2008, Krusader-2.x compiles on &Windows;. Before Krusader can be used several &Qt;4-libraries and &kde;4-libraries need to be installed. A recommended native file manager for &Windows; is <ulink url="http://www.ghisler.com/"><trademark class="copyright">Total Commander</trademark></ulink> (shareware).
fr: Oui, depuis le 18 juin 2008, Krusader-2.x compile sur &Windows;. Avant que Krusader peut être utilisé, il a besoin des bibliothèques &Qt;4 et &kde;4. Un gestionnaire de fichiers natif recommandé pour &Windows; est <ulink url="http://www.ghisler.com/"><trademark class="copyright">Total Commander</trademark></ulink> (shareware).

source: Why is &konqueror; in "midnight commander style" not an <link linkend="gloss-ofm">OFM</link>?
fr: Pourquoi &konqueror est t-il dans le « style midnight commander » et non un <link linkend="gloss-ofm">OFM</link> ?

source: The two panels and a commandline are available, all the other stuff like <link linkend="features">OFM features</link> and the <link linkend="gloss-ofm">OFM</link> interaction with the user is missing from this profile.
fr: Les deux panneaux et ligne de commande sont disponible, toutes les autres choses comme les <link linkend="features">fonctionnalités OFM</link> et les interactions <link linkend="gloss-ofm">OFM</link> avec l'utilisateur sont manquant de ce profil.

source: Why should I use an <link linkend="gloss-ofm">OFM</link>?
fr: Pourquoi dois-je utiliser un <link linkend="gloss-ofm">OFM</link> ?

source: An <ulink url="http://www.softpanorama.org/OFM/index.shtml">Orthodox File Manager (OFM)</ulink> is much faster than a one panel filemanager and faster than the command line. If you would like to know <ulink url="http://www.softpedia.com/reviews/linux/Krusader-Review-18193.shtml"> how &krusader; feels</ulink>, there is only one way to discover: install it on your computer and use it for a while. If you prefer to waste time and lose productivity, continue to use one panel filemanagers which are based on &Windows; Explorer. Matej Urban&ccaron;i&ccaron; has written a <ulink url="http://murban.blogspot.com/2006/01/krusader-and-konqueror-twin-versus-one.html"> blog</ulink> on why <link linkend="gloss-ofm">OFM</link> is better than a one panel filemanager.
fr: Un <ulink url="http://www.softpanorama.org/OFM/index.shtml">Orthodox File Manager (OFM)</ulink> est plus rapide qu'un gestionnaire de fichiers à un panneau et plus rapide qu'une ligne de commande. Si vous voulez savoir <ulink url="http://www.softpedia.com/reviews/linux/Krusader-Review-18193.shtml">de quelle manière &krusader; se comporte</ulink>, il y a une seule façon de le découvrir : installez le sur votre ordinateur et utilisez le pendant pendant un temps. Si vous préférez perdre du temps et de la productivité, continuez d'utiliser les gestionnaires de fichiers à un panneau qui sont fondés sur l'explorateur de fichiers de &Windows. Matej Urban&ccaron;i&ccaron; a écrit un <ulink url="http://murban.blogspot.com/2006/01/krusader-and-konqueror-twin-versus-one.html"> blog</ulink> à propos des raisons qui font de <link linkend="gloss-ofm">OFM</link> un meilleur gestionnaire de fichiers que les autres.
