Repository: CodeCollect/krusader
Catalog: doc/i18n/*/faq.docbook.po
Languages: fr

source: The most convenient way to contact us is to use the <link linkend="faqg_kru-forum">&krusader; Forum</link>, or the krusader-users <ulink url="http://www.krusader.org/lists.php">mailing lists</ulink>. For information on what remains to be done look at the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">ToDo Forum</ulink>. Adding ToDo items into the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">ToDo Forum</ulink> is for developers only, but feel free to post to the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=6">New Features Discussion/Requests Forum</ulink> for things that aren't on the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">ToDo Forum</ulink>, but should be. If you have a nice feature request, the &krusader; Krew will add your request to the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">ToDo Forum</ulink>. We review and discuss every submission. For more information how the forum works click <link linkend="faqg_kru-forum">here</link>.
fr: La manière la plus commune pour nous contacter est d'utiliser le <link linkend="faqg_kru-forum">forum de &krusader;</link>, ou la <ulink url="http://www.krusader.org/lists.php">liste de diffusion krusader-users</ulink>. Pour des informations sur ce qu'il reste à faire, visitez le <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=10">forum TODO</ulink>. Ajouter des éléments à la liste TODO dans le forum TODO est réservé seulement aux développeurs, mais vous pouvez poster dans <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=6">le forum de réquêtes et discussions de nouvelles fonctionnalités</ulink> pour les choses qui ne sont pas dans le forum TODO, mais qui devrait y être. Si vous avez une sympathique demande de fonctionnalité, l'équipe de &krusader;ajoutera cette demande dans le forum TODO. Nous analysons et discutons chaque demandes. Pour plus d'informations sur la façon dont fonctionne le forum, cliquez <link linkend="faqg_kru-forum">ici</link>.

source: How can I send a patch?
fr: Comment puis-je envoyer un patch ?

source: It's not easy to write patch guidelines, but here are some.
fr: Il n'est pas facile d'écrire un guide pour l'envoi de patch, mais en voici un aperçu :

source: Patches, new code or new features are always welcome!
fr: Les patches, code nouveau ou nouvelles fonctionnalités sont toujours les bienvenus !

source: Focus only on one problem at a time, so the developers can easily understand you, and commit your patch it works.
fr: Focalisez vous seulement sur un problème à la fois, que les développeurs peuvent facilement vous comprendre et ajouter votre patch qui fonctionne.

source: Preferrably, you can start a discussion with the developers on the krusader-devel <ulink url="http://www.krusader.org/lists.php">mailing lists</ulink> or on the <link linkend="faqg_kru-forum">&krusader; Forum</link>. Unfortunatly, we can't apply a patch if the patch is in conflict with the "general design" of the &krusader; code (read for more instructions in this FAQ). Please send only one change request per mail, so that the discussion is easier to follow. The modifications should be committed step by step, checking each line.
fr: Avant, vous pouvez démarrer une discussion avec les développeurs sur la <ulink url="http://www.krusader.org/lists.php">liste de discussion</ulink> krusader-devel ou sur le <link linkend="faqg_kru-forum">forum de &krusader;</link>. Malheureusement, nous ne pouvons appliquer un patch si le patch entre en conflit avec le « design général » du code de &krusader; (plus d'informations dans la &FAQ;). Envoyez seulement une demande de modification par courrier électronique, pour que la discussion soit plus simple à suivre. Les modifications doivent être commitées étape par étape, en vérifiant chaque ligne.

source: Submit your patch files into our <ulink url="http://sourceforge.net/tracker/?group_id=6488&amp;atid=306488">Patch Tracker</ulink>, so that all patch proposals stay organised and don't get lost, tar.gz archives or diffs are usually ok. Do not copy changes into a mail. Most mailers will change the white spaces, so that the diff will not apply or the code snipped does not diff. In the past, patch mails went lost or disorganized in many many mails, so please use the <ulink url="http://sourceforge.net/tracker/?group_id=6488&amp;atid=306488">Patch Tracker</ulink>, thanks!
fr: Soumettez vos patches dans le <ulink url="http://sourceforge.net/tracker/?group_id=6488&amp;atid=306488">tracker de patches</ulink>, pour que tous les patches proposés restent organisés et ne se perdent pas, les archive tar.gz ou les diffs sont habituellement les bons formats. Ne copier pas les modifications dans un courrier électronique. La plupart des logiciel de courriers électroniques modifient les espaces blancs, le diff ne s'appliquera donc pas ou le code ciselé ne vas pas s'appliquer en tant que diff. Dans le passé, les patches envoyés par courrier électronique étaient perdus ou désorganisés dans de nombreux courriers électroniques, veuillez donc utiliser le tracker de patches, merci !

source: Use portable solutions, &krusader; should run on: <itemizedlist> <listitem> <para>All POSIX (&Linux;/BSD/&UNIX;-like OSes), &Solaris;.</para> </listitem> <listitem> <para>All BSD Platforms (<trademark class="copyright">FreeBSD</trademark>/<trademark class="registered">NetBSD</trademark>/<trademark class="registered">OpenBSD</trademark>/&MacOS;).</para> </listitem> <listitem> <para>&kde; 3.3- &kde; 3.5 and even on GNOME with &kde;libs (for krusader-2.x &kde; 4) .</para> </listitem> <listitem> <para>GCC 2.95 - GCC 4.1</para> </listitem> </itemizedlist>Architecture changes are made by the team only.
fr: Utilisez des solutions portables, &krusader; doit se lancer sur : <itemizedlist> <listitem> <para>Tous les POSIX (&Linux;/BSD/&UNIX;-like OSes), &Solaris;.</para> </listitem> <listitem> <para>Toutes les plate-formes BSD (<trademark class="copyright">FreeBSD</trademark>/<trademark class="registered">NetBSD</trademark>/<trademark class="registered">OpenBSD</trademark>/&MacOS;).</para> </listitem> <listitem> <para>&kde; 3.3- &kde; 3.5 et même sur GNOME avec &kde;libs pour krusader-2.x &kde; 4) .</para> </listitem> <listitem> <para>GCC 2.95 - GCC 4.1</para> </listitem> </itemizedlist>Les modifications d'architecture sont appliquées seulement par l'équipe.

source: A final note: always keep in mind a patch might be rejected. Either it has side effects, which we could not fix or it contradicts with the idea behind the patched module. In this sense, a software project differs from, let's say a wiki: a software project has to have someone to make all the final decisions. Otherwise the software will not work. Furthermore: keep in mind that the examination of patches might take time, as we all have private lives.
fr: Une remarque finale : gardez toujours à l'esprit qu'un patch peut être rejeté. Soit qu'il provoque des effets collatéraux, que nous ne pouvons pas corriger ou qu'il entre en contradiction avec l'idée derrière le module de patches. Dans ce sens, un projet logiciel est différent, voyons ce que dit un wiki : un projet logiciel doit avoir une personne qui prend toutes les décisions finales. Sinon le logiciel ne fonctionnera pas. De plus : gardez à l'esprit que l'examen des patches prend du temps, car nous avons des vies privées.

source: How can I report a bug?
fr: Comment puis-je remonter un bogue ?

source: Bugs?!?!? Well, ok.... We have an online Bug Tracking System.
fr: Bogues?!?!? Euh, oui... Nous avons un système de tracker de bogues.

source: Using the online bug-tracker helps us have a clear and orderly way to know how many bugs are open, bug priority and follow-ups. It saves us from browsing through the entire &krusader; forum, searching for yesterdays bug. Please use this system.
fr: Utiliser le tracker de bogues en ligne nous aide à avoir une manière claire et ordonnée pour savoir combien de bogues sont ouverts, la priorité des bogues et le suivi. Cela nous évite d'avoir à naviguer dans tout le forum de &krusader; à la recherche de bogues de plusieurs jours. Veuillez donc utiliser ce système.

source: Before reporting a bug, please read the following:
fr: Avant de remonter un bogue, veuillez lire ce qui suit :

source: Use the <link linkend="faqg_kru-forum">&krusader; Forum</link>'s <ulink url="http://www.krusader.org/phpBB/search.php">Search</ulink> function , your bug might be already solved . Please DO NOT post new bugs to the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=3">Bug Discussion Forum</ulink> (except if you are not sure that you have found a bug). We use it for bug discussions.
fr: Utilisez le la fonctionnalité de <ulink url="http://www.krusader.org/phpBB/search.php">recherche</ulink> <link linkend="faqg_kru-forum">forum de &krusader;</link>, votre bogue doit être sûrement résolu. Veuillez NE PAS poster de nouveaux bogues dans le <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=3">forum de discussion de bogues</ulink> (sauf si vous n'êtes pas sûr d'avoir trouvé un bogue). Nous l'utilisons pour les discussions de bogues.

source: <emphasis role="bold">Check</emphasis> if the bug is already posted in the <ulink url="http://sourceforge.net/tracker/?group_id=6488&amp;atid=106488">online bug list</ulink> of the Bug Tracking System.
fr: <emphasis role="bold">Vérifiez</emphasis> si le bogue est toujours posté dans la <ulink url="http://sourceforge.net/tracker/?group_id=6488&amp;atid=106488">liste de bogues en ligne</ulink> sur le système de tracker de bogues.

source: If you can't find this bug mentioned, please <emphasis role="bold">submit</emphasis> it into the bug tracker by clicking the <guibutton>Submit New</guibutton> button in the bug-tracker window. Please submit the following issues: the &krusader; version used, the &Linux; distribution + version used, processor type, and as good a description of the problem as you can manage.
fr: Si vous ne pouvez pas trouver le bogue mentionné, veuillez le <emphasis role="bold">soumettre</emphasis> dans le tracker de bogues en cliquant sur le bouton <guibutton>Submit New</guibutton> dans la fenêtre de tracker de bogues. Veuillez soumettre les problèmes suivants : la version de &krusader; utilisée, la distribution &Linux; + la version utilisée, le type de processeur, et une bonne description du problème que vous rencontrez.

source: If possible, try to do the same operation with &konqueror; or another &kde; application. If you encounter the same problem then it is possibly a KIO Slaves or &kde; (kdelibs) bug, and not a &krusader; bug. &krusader; uses the &kde; libraries and the KIO Slave for many operations. In some cases you can encounter problems if your distribution is incorrectly configured, please test it first as explained above.
fr: Si possible, essayez de faire la même opération avec &konqueror; ou d'autres applications &kde;. Si vous rencontrez le même problème il est possible que c'est un bogue KIO Slaves ou &kde; (kdelibs), et non un bogue de &krusader;. &krusader; utilise les bibliothèques &kde; et KIO Slave pour pleins d'opérations. Dans certains cas, vous pouvez rencontrer des problèmes si votre distribution est mal configurée, veuillez la tester avant comme expliqué ci-dessus.

source: If you've got bugs to report please do not use &kde;'s bugzilla http://bugs.kde.org/, &kde;'s Bug Tracking System. Report &krusader; bugs directly to us.
fr: Si vous avez des bogues, veuillez ne pas utiliser le bugzilla de &kde; http://bugs.kde.org/. Remontez votre bogue directement sur le track de bogues de &krusader; ou à nous directement.

source: How can i send good debug or crash reports?
fr: Comment puis-je envoyer de bons rapports de débogue ou de plantage ?

source: Usually binary packages that are been used by your distribution do not contain debug information. Since we usually only develop and fix &krusader;-cvs, compile &krusader;-cvs in debugmode and install it, than check if the bug still exist. <screen><prompt>$</prompt> <userinput><command>cmake</command> <option>-DCMAKE_BUILD_TYPE=debugfull</option></userinput></screen> Install <ulink url="http://valgrind.org">valgrind</ulink>, a suite of tools for debugging and profiling &Linux; programs. Run Valgrind/&krusader; <screen><prompt>$</prompt> <userinput><command>valgrind</command> <option>--tool=memcheck</option> <replaceable>{foo_path}/krusader</replaceable></userinput></screen> The valgrind tool will write to stdout, what really happens. If you could send these informations before the crash, it's almost sure, that we may fix or tell you what to do.
fr: Habituellement, les paquetages binaires qui ont été utilisés par votre distribution ne contiennent par d'informations de déboguages. Depuis que nous développons et corrigeons seulement le &krusader-cvs, compilez &krusader-cvs en mode de déboguage et installez le. Puis vérifiez si le bogue existe toujours. <screen><prompt>$</prompt> <userinput><command>cmake</command> <option>-DCMAKE_BUILD_TYPE=debugfull</option></userinput></screen> Install <ulink url="http://valgrind.org">valgrind</ulink>, une gamme d'outils pour le déboguer et tracer le profil de programmes sous &Linux;. Lancez Valgrind / &krusader; <screen><prompt>$</prompt> <userinput><command>valgrind</command> <option>--tool=memcheck</option> <replaceable>emplacement/de//krusader</replaceable></userinput></screen> L'outils Valgrind écrira un fichier de sortie, sur ce qui se passe réellement. Si vous pouvez envoyer ces informations avant le plantage, il est certain que nous pouvons corriger ou vous dire quoi faire.

source: What todo if the KDEcrashhandler sends no usefull backtrace information?
fr: Que faire si KDEcrashhandler envoie des informations de backtrace inutilisables ?

source: Usually binary packages that are been used by your distribution do not contain debug information. Since we usually only develop and fix &krusader;-cvs, compile &krusader;-cvs in debugmode and install it, than check if the bug still exist. <screen><prompt>$</prompt> <userinput><command>cmake</command> <option>-DCMAKE_BUILD_TYPE=debugfull</option></userinput></screen> If the KDEKrashhandler still doesn't provide usefull backtrace information, than sometimes a coredump will give better information. Run Krusader, with disabled crashhandler. <screen><prompt>$</prompt> <userinput><command>krusader</command> <option>--nocrashhandler</option></userinput></screen> On a crash you will get a <filename>.core</filename> file, usually in your home directory. Run <ulink url="http://sourceware.org/gdb/">gdb</ulink>, the GNU Project Debugger <screen><prompt>$</prompt> <userinput><command>gdb</command> <option>-c</option> <replaceable>corefile krusader</replaceable></userinput></screen> Now type <command>bt</command> to get the backtrace and type <command>q</command> to quit gdb. Often the best debug results will be given when using the valgrint tool.
fr: Habituellement, les paquetages binaires qui ont été utilisés par votre distribution ne contiennent par d'informations de déboguages. Depuis que nous développons et corrigeons seulement le &krusader-cvs, compilez &krusader-cvs en mode de déboguage et installez le. Puis vérifiez si le bogue existe toujours. <screen><prompt>$</prompt> <userinput><command>cmake</command> <option>-DCMAKE_BUILD_TYPE=debugfull</option></userinput></screen> Si KDEKrashhandler ne fournit toujours pas des informations de backtrace, un coredump donnera quelque fois de meilleures informations. Lancez Krusader, avec le crashhandler désactivé. <screen><prompt>$</prompt> <userinput><command>krusader</command> <option>--nocrashhandler</option></userinput></screen> Lors d'un plantage, vous aurez un fichier <filename>.core</filename>, habituellement dans votre dossier personnel. Lancez <ulink url="http://sourceware.org/gdb/">gdb</ulink>, le débogueur du projet GNU <screen><prompt>$</prompt> <userinput><command>gdb</command> <option>-c</option> <replaceable>corefile krusader</replaceable></userinput></screen> Maintenant saisissez la commande <command>bt</command> pour avoir le backtrace et saisissez <command>q</command> pour quitter gdb. Souvent les meilleurs résultats de déboguage seront donnés en utilisant l'outil valgrint.

source: Does &krusader; have a mailing list?
fr: Existe t-il des listes de diffusion ?

source: Yes, currently we have 6 <ulink url="http://www.krusader.org/lists.php">mailing lists</ulink>. No spam, no bother, just &krusader;. Feel free to subscribe and unsubscribe.
fr: Oui, nous avons <ulink url="http://www.krusader.org/lists.php">six listes de diffusion</ulink>. Pas de spam, simplement &krusader;. Inscrivez ou désinscrivez-vous à votre convenance.

source: Tip. our mailing lists can be browsed online or read with a newsreader, so that you don't even need to subscribe to follow the action on the mailing lists.
fr: Astuce : nos listes de diffusion peuvent être parcourues en ligne ou lues avec un logiciel de lecteur de nouvelles, afin que vous n'ayez même pas besoin de suivre les discussions sur la liste de diffusion.

source: <ulink url="http://groups-beta.google.com/group/krusader-news">&krusader;-news</ulink> is a very low volume list, used for newsletters and announcements of new versions or critical bugfixes. The news can also be read online at <ulink url="http://www.krusader.org/news.php">latest news</ulink> and in the <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=7">News and Announcements Forum</ulink> which are basically the same but displayed in another format.
fr: <ulink url="http://groups-beta.google.com/group/krusader-news">&krusader;-news</ulink> est une liste à très faible volume, utilisé pour les nouveautés et les annonces de nouvelles versions ou les résolutions de bogues critiques. Les nouvelles peuvent aussi être lues en ligne sur les <ulink url="http://www.krusader.org/news.php">dernières nouvelles</ulink> et dans le <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=7">forum des annonces et nouveautés</ulink>.

source: <ulink url="http://groups-beta.google.com/group/krusader-devel">&krusader;-devel</ulink> is the developer mailing list (read-only). If you want to follow the development of &krusader; on the cutting edge, this is the list to follow.
fr: <ulink url="http://groups-beta.google.com/group/krusader-devel">&krusader;-devel</ulink> est la liste pour les développeur (en lecture seule). Si vous voulez suivre le développement de &krusader; au plus prêt, c'est la liste à suivre.

source: <ulink url="http://groups-beta.google.com/group/krusader-users">&krusader;-users</ulink> is the &krusader; users mailing list. Here you can ask for help and talk with the &krusader; users and developers.
fr: <ulink url="http://groups-beta.google.com/group/krusader-users">&krusader;-users</ulink> est la liste des utilisateurs. Vous pouvez demander ici de l'aide et discuter avec les utilisateurs et développeurs de &krusader;.

source: <ulink url="http://groups-beta.google.com/group/krusader-i18n">&krusader;-i18n</ulink> is the translations mailing list.
fr: <ulink url="http://groups-beta.google.com/group/krusader-i18n">&krusader;-i18n</ulink> est la liste des traductions.

source: <ulink url="http://groups-beta.google.com/group/krusader-doc">&krusader;-doc</ulink> is the documentation mailing list.
fr: <ulink url="http://groups-beta.google.com/group/krusader-doc">&krusader;-doc</ulink> est la liste de la documentation.

source: <ulink url="http://sourceforge.net/mailarchive/forum.php?forum_name=krusader-commits">&krusader;-commits</ulink> (read-only): when the &krusader; Krew commits code into CVS, it will be reported in this mailing list. Want to keep track? Waiting for a certain feature/bugfix? Follow &krusader;'s development here.
fr: <ulink url="http://sourceforge.net/mailarchive/forum.php?forum_name=krusader-commits">&krusader;-commits</ulink> (en lecture seule) : quand l'équipe de &krusader; envoie du code dans le SVN, les annonces sont faites sur cette liste de diffusion. Conserver un suivi ? En attente de certaines fonctionnalités et résolutions de bogues ? C'est la liste à suivre.

source: Does &krusader; provide newsfeeds?
fr: &krusader; fournit-il des flux RSS ?

source: Yes, we do. Several newsfeeds in various formats are available. <ulink url="http://sourceforge.net/export/rss2_projfiles.php?group_id=6488">rss-filerelease feed</ulink>, <ulink url="http://www.krusader.org/phpBB/rss.php">rss-forumfeed</ulink>, <ulink url="http://groups.google.com/group/krusader-news/feeds">krusader-news feed</ulink>, <ulink url="http://groups.google.com/group/krusader-devel/feeds">krusader-devel feed</ulink> and even <ulink url="http://dir.gmane.org/gmane.comp.kde.krusader.devel">additional feeds</ulink> by gmane.org. <ulink url="http://groups.google.com/group/krusader-users/feeds">krusader-users feed</ulink>, <ulink url="http://groups.google.com/group/krusader-i18n/feeds">krusader-i18n feed</ulink>, <ulink url="http://groups.google.com/group/krusader-doc/feeds">krusader-doc feed</ulink> .
fr: Oui. De nombreux flux de nouvelles dans divers formats sont disponibles. <ulink url="http://sourceforge.net/export/rss2_projfiles.php?group_id=6488">rss-filerelease feed</ulink>, <ulink url="http://www.krusader.org/phpBB/rss.php">rss-forumfeed</ulink>, <ulink url="http://groups.google.com/group/krusader-news/feeds">krusader-news feed</ulink>, <ulink url="http://groups.google.com/group/krusader-devel/feeds">krusader-devel feed</ulink> and even <ulink url="http://dir.gmane.org/gmane.comp.kde.krusader.devel">additional feeds</ulink> by gmane.org. <ulink url="http://groups.google.com/group/krusader-users/feeds">krusader-users feed</ulink>, <ulink url="http://groups.google.com/group/krusader-i18n/feeds">krusader-i18n feed</ulink>, <ulink url="http://groups.google.com/group/krusader-doc/feeds">krusader-doc feed</ulink>.

source: Does &krusader; have an IRC channel?
fr: &krusader; a t-il un canal IRC ?

source: Yes, we do. Feel free to talk to the &krusader; Krew and fellow-users via <ulink url="http://freenode.net">freenode.org</ulink> servers. The server is <emphasis>irc.freenode.org</emphasis>, the channel is <emphasis>#krusader</emphasis>. Everyone is welcome.
fr: Oui. Vous pouvez discuter avec l'équipe de &krusader; et utilisateurs à partir des serveurs <ulink url="http://freenode.net">freenode.org</ulink>. Le serveur est <emphasis>irc.freenode.org</emphasis>, le canal est <emphasis>#krusader</emphasis>. Tout le monde est le bienvenu !

source: How does the &krusader; forum work?
fr: Comment le forum de &krusader; fonctionne t-il ?

source: In the spirit of freedom of speech, everything that is &krusader; related can be discussed in our forum. It does not matter if you are a newcomer or an advanced user, everyone is welcome. An open source project's greatest strength is derived from getting user feedback. That is why we love to hear what you have to say. With your feedback we can make &krusader; better and better; otherwise, we are not aware of issues and ideas you may have. But please remember the following, so that we can maintain some order in the chaos.
fr: Dans un esprit de liberté d'expression, toutes choses qui se rapportent à &krusader; peuvent être discutées dans notre forum. Cela n'est pas grave si vous êtes un nouvel arrivant ou un utilisateur avancé, tout le monde est le bienvenu. La grande force d'un projet Open Source vient du retour des utilisateurs. C'est pourquoi nous aimons entendre ce que vous avez à dire. Avec vos retours, nous pouvons rendre &krusader; encore meilleur. Cependant, nous ne nous tenons pas au courant des problèmes et des idées que vous avez. Mais veuillez vous souvenir la chose suivante, pour que nous puissions maintenir de l'ordre dans le chaos.
