Repository: CodeCollect/krusader
Catalog: doc/i18n/*/faq.docbook.po
Languages: fr

source: How can I build an RPM package for &krusader;?
fr: Comment puis-je construire un paquetage RPM pour &krusader; ?

source: If you have experience with compiling from source, you will probably be able to build a &krusader; RPM too. Information about RPM can be found at <ulink url="http://www.rpm.org/">rpm.org</ulink> and in the <ulink url="http://fedora.redhat.com/docs/drafts/rpm-guide-en/">RPM Guide</ulink> by Eric Foster-Johnson. The following is the short procedure howto on building an RPM.
fr: Si vous avez de l'expérience avec la compilation des sources, vous serez probablement capable de construire aussi un RPM. Les informations à propos des RPM peuvent être trouvées sur <ulink url="http://www.rpm.org/">rpm.org</ulink> et dans le <ulink url="http://fedora.redhat.com/docs/drafts/rpm-guide-en/">guide des RPM</ulink> par Eric Foster-Johnson. La suite est la procédure « Comment Faire » résumée pour construire un RPM.

source: Compile &krusader; from source to check that the compilation works fine.
fr: Compiler &krusader; depuis les sources pour vérifier que la compilation fonctionne correctement.

source: Copy <filename>kusader-1.xx.tar.gz</filename> to <filename class="directory"> /usr/scr/RPM/SOURCE</filename>
fr: Copier <filename>kusader-1.xx.tar.gz</filename> vers <filename class="directory"> /usr/scr/RPM/SOURCE</filename>

source: Copy <filename>kusader.spec</filename> to <filename class="directory"> /usr/scr/RPM/SPECS</filename> Tip: the latest <filename>kusader.spec</filename> can be found in CVS.
fr: Copier <filename>krusader.spec</filename> vers <filename class="directory"> /usr/scr/RPM/SPECS</filename> Astuce : le dernier fichier <filename>krusader.spec</filename> peut être trouvé dans le SVN.

source: Edit <filename>kusader.spec</filename> and add your name, your e-mail address, the rpm name, ... Other changes may be needed if <command>rpmbuild</command> fails.
fr: Modifier <filename>krusader.spec</filename> et ajouter votre nom, adresse de courrier électronique, nom du RPM, &etc;. D'autres modifications peuvent être nécessaires si la commande <command>rpmbuild</command> échoue.

source: If the build is not OK you will receive an error message during the rpmbuild process, try to fix it and run <command>rpmbuild</command> again.
fr: Si la construction échoue, vous recevrez un message d'erreur pendant le processus de construction. Essayez de corriger l'erreur et relancer <command>rpmbuild</command>.

source: And finally: <link linkend="faqi_rpm-source">test</link> the RPM before sending it in.
fr: Et finalement : <link linkend="faqi_rpm-source">testez</link> le RPM avant de l'envoyer.

source: Why does &krusader;-svn show an old version number in the about box?
fr: Pourquoi le SVN de &krusader; affiche t-il un numéro de version ancien dans la boîte de dialogue « Á Propos » ?

source: Because we only change the version number just before we do a new release. &krusader;-svn will show an older version number, so ignore the version number and check the download date. We simply haven't yet decided what the next version number will be.
fr: Parce que nous modifions le numéro de version juste avant de sortir une nouvelle version du logiciel. &krusader;-svn affichera un ancien numéro de version, ignorez donc le numéro affiché et vérifiez la date de téléchargement. Nous n'avons simplement pas encore décidé quel sera le prochain numéro de version.

source: Usage &FAQ;
fr: &FAQ, d'utilisation

source: &krusader; keeps crashing, why?
fr: &krusader; plante, pourquoi ?

source: When I try to mount/unmount my cdrom/floppy, &krusader; reports something about a supermount, what's this about?
fr: Quand j'essaie de monter ou libérer mon CD-ROM / lecteur de disquette, &krusader; m'affiche quelque chose à propos de supermount. Qu'est-ce que c'est ?

source: Supermount is a daemon which handles the mounting/unmounting of removable filesystems for you. Just insert a floppy, and do <userinput> <command>cd</command> <option> <replaceable>/mnt/floppy</replaceable> </option> </userinput>supermount will do the mount for you automatically and transparently. Usually this works fine. However, supermount misleads the system into thinking that the <hardware>floppy/cdrom</hardware> is mounted at all times! This creates some problems for &krusader;, as it cannot really know when the floppy or CD has been removed because the system information is not correctly updated by supermount - is there really a <hardware>floppy</hardware> in the <hardware>drive</hardware>? Of course, this can be solved, but as for now, we don't consider it a priority.
fr: Supermount est un démon qui prend en charge le montage et la libération des systèmes de fichiers distants pour vous. Insérez simplement une disquette, et saisissez <userinput> <command>cd</command> <option> <replaceable>/mnt/floppy</replaceable> </option> </userinput>, supermount montera automatiquement et de manière transparente le lecteur. Habituellement cela fonctionne bien. Cependant, supermount trompe le système en pensant que le lecteur de disquette / CD-ROM est monté tout le temps ! Cela créée des problèmes pour &krusader;, comme il ne peut vraiment pas savoir quand le lecteur de disquette ou le CD-ROM a été libéré à cause de l'information système qui n'est pas correctement mis à jour par supermount. - est-ce vraiment un lecteur de disquette ou un CD-ROM ? Bien sûr, ceci peut être résolu, mais pour le moment, nous ne considérons pas cela comme une priorité.

source: Why does &krusader; freeze or hang on a dead mountpoint?
fr: Pourquoi &krusader; plante t-il ou ne réagit t-il pas sur des points de montage morts ?

source: When I try to resize &krusader; to make it smaller, I discover that I can't resize it below a certain size. Why?
fr: Quand j'essaie de redimensionner &krusader; pour le rendre plus petit, je découvre que je ne peux pas le réduire en dessous d'une certaine taille. Pourquoi ?

source: See the <guibutton>F1, F2</guibutton> (&etc;) buttons? They are not allowing &krusader; to downsize as they have a minimum size. Just disable them <menuchoice> <guimenu>View</guimenu> <guimenuitem>Show FN Keys Bar</guimenuitem> </menuchoice> and you'll be able to resize &krusader; to your liking. Since version 1.51 we have improved this greatly: when downsizing the buttons will look like 'F5 ..py'. When the button faces are too small to read a tooltip will give the complete text. The minimum width is 45 pixels for each button.
fr: Voyez-vous les boutons <guibutton>F1, F2</guibutton> (&etc;) ? Ils ne permettent pas à &krusader; d'aller en dessous d'une taille minimum. Désactivez simplement <menuchoice> <guimenu>Configuration</guimenu> <guimenuitem>Afficher la barre de touches FN</guimenuitem> </menuchoice> et vous pourrez redimensionner &krusader; à votre convenance. Depuis la version 1.51 nous avons amélioré grandement cela : quand les boutons diminuent, ils s'affichent de cette manière « F5 ..py ». Quand le cadre du bouton est trop petit à lire, une infobulle donnera le texte complet. La longueur minimum est de 45 pixels pour chaque bouton.

source: <application>Samba</application> ISO 8859-x codepage / What to do if &krusader; does not read shared directories containing special international characters?
fr: Codage ISO 8859-x <application>Samba</application>. Que faire si &krusader; ne lit pas les dossiers partagés contenant des caractères internationaux spéciaux ?

source: &krusader; reports "krarc:... protocol not supported" error at opening an archive file, what to do?
fr: &krusader; affiche : « krarc:... protocole non géré », erreur à l'ouverture d'une archive. Que faire ?

source: Install the krarc slave properly:
fr: Installez krarc proprement :

source: Copy the <filename>kio_krarc.so</filename>, <filename>kio_krarc.la</filename> files into <filename class="directory"> $KDEDIR/lib/kde3</filename>
fr: Copiez les fichiers <filename>kio_krarc.so</filename>, <filename>kio_krarc.la</filename> dans <filename class="directory"> $KDEDIR/lib/kde3</filename>

source: Copy the <filename>krarc.protocol</filename> file into <filename class="directory"> $KDEDIR/share/services</filename>
fr: Copiez le fichier <filename>krarc.protocol</filename> dans <filename class="directory"> $KDEDIR/share/services</filename>

source: or the directory where the KIO slaves are placed in your &Linux; distribution.
fr: ou le dossier où les modules d'entrées / sorties (KIO Slaves) sont situés dans votre distribution &Linux;.

source: I get the error message "Protocol not supported by Krusader: "krarc:/path/to/foo-archive", when I try to open foo-Archive, what to do?
fr: J'ai un message d'erreur : « protocole non géré par Krusader : krarc:/path/to/foo-archive », quand j'essaie d'ouvrir une archive. Que faire ?

source: The icons, kio_slaves and documentation must be installed in the correct places in the &kde; directory tree. The <filename>kio_krarc.*</filename> files must be in the same directory with the other KIO slaves. Try this: locate <filename>kio_tar.*</filename> and copy/link the <filename>kio_krarc.*</filename> files to the same location. Don't forget to run <command># ldconfig</command> on this directory when you're done. For more information click <ulink url="www.krusader.org/phpBB/viewtopic.php?t=991"> here</ulink>.
fr: Les icônes, kio_slaves et la documentation doivent être installés dans leur emplacement correct dans l'arborescence du dossier &kde;. Le fichier <filename>kio_krarc.*</filename> doit être dans le même dossier avec les autres KIO slaves. Essayez ceci : localisez <filename>kio_tar.*</filename> et copiez ou liez les fichiers <filename>kio_krarc.*</filename> dans le même emplacement. N'oubliez pas de lancer <command># ldconfig</command> sur le dossier quand vous avez fait la manipulation. Pour plus d'informations, cliquez <ulink url="www.krusader.org/phpBB/viewtopic.php?t=991">ici</ulink>.

source: What todo if an extenal tool doesn't seem to work?
fr: Que faire si un outil externe ne semble pas fonctionner ?

source: Krusader uses several programs as <link linkend="konfig-dependencies">external tools</link>, and sometimes they appear not to work. Open a terminal and check if tool foo is installed. <screen><prompt>$</prompt> <userinput><command>foo</command></userinput></screen> Check if tool foo is properly configured in the <link linkend="konfig-dependencies">Konfigurator Dependencies page</link>. For Archiving tools: autodetect the archives again with the <guibutton>Auto Configure</guibutton> button in the <link linkend="konfig-archives">Konfigurator archive page</link>. Check the <link linkend="konfig-protocols">Konfigurator Protocol page</link> If it doesn't work, backup your <filename>~/.kde/share/config/krusaderrc</filename> configuration file and remove it from this location, Restart Krusader, Krusader will now start the first start configuration wizard, follow these guidelines.
fr: Krusader utilise plusieurs programmes comme les <link linkend="konfig-dependencies">outils externes</link>, et quelque fois ceux-ci ne fonctionnent pas. Ouvrez un terminal et vérifiez si l'outil toto est installé. <screen><prompt>$</prompt> <userinput><command>foo</command></userinput></screen>Vérifiez si l'outil toto est proprement configuré dans la <link linkend="konfig-dependencies">page des dépendances de Konfigurator</link>. Pour les outils d'archivage : auto-détectez de nouveau les archives avec le bouton <guibutton>Configuration automatique</guibutton> dans la <link linkend="konfig-archives">page d'archives de Konfigurator</link>. Vérifiez la <link linkend="konfig-protocols">page des protocoles de Konfigurator</link>Si cela ne fonctionne pas, sauvegardez votre fichier de configuration <filename>~/.kde/share/config/krusaderrc</filename> et supprimez le de cet emplacement. Redémarrez Krusader qui va se lancer avec le premier démarrage de l'assistant de configuration et suivez ce guide.

source: Howto executing jar files (and not enter the jar archive)?
fr: Comment exécuter des fichiers jar (et non naviguer dans ce type d'archive) ?

source: Go to the <link linkend="konfig-protocols">Konfigurator Protocol page</link> and remove <guilabel>application/x-jar</guilabel> from the krarc node, &krusader; should no longer enter the archive. Global file associations are handled by &kde; and not by &krusader;. To assosiate the jar extension:
fr: Allez sur la <link linkend="konfig-protocols">page des protocoles de Konfigurator</link> et supprimez <guilabel>application/x-jar</guilabel> du nœud karc. &krusader; ne devrait plus naviguer dans l'archive. Les associations de fichier globales sont gérées par &kde; et non par &krusader;. Pour associer l'extension jar :

source: Open &kde;s control center: <application>kcontrol</application>
fr: Ouvrez le centre de contrôle de &kde; : <application>kcontrol</application>

source: <guimenu>KDE Components</guimenu> <guimenuitem>File Associations</guimenuitem>
fr: Onglet <guimenu>Avancé</guimenu> <guimenuitem>Associations de fichiers</guimenuitem>

source: Enter <filename>jar</filename> as filename pattern
fr: Saisissez <filename>jar</filename> comme nom de recherche

source: Add <filename>java</filename> as application
fr: Ajoutez <filename>java</filename> comme application

source: Why do I have trouble with my &FTP; connection?
fr: Pourquoi ai-je des problèmes avec ma connexion &FTP; ?

source: This problem often occurs when you are behind a firewall or proxy. Open <menuchoice> <guimenu>KDE Control Center</guimenu> <guimenuitem>Network</guimenuitem> <guimenuitem>Preferences</guimenuitem> </menuchoice>, <guilabel>"Enable Passive Mode (PASV)"</guilabel> has to be turned on or off, depending on it's current setting. Now try your &FTP; session again to see if it works. Also, make sure you have no other &FTP; sessions open (using web browsers, etc.), they can cause complications. More information can be found in <ulink url="http://slacksite.com/other/ftp.html">Active &FTP; vs. Passive &FTP;, a Definitive Explanation</ulink>.
fr: Le problème se produit souvent quand vous êtes derrière un pare-feu ou un serveur mandataire. Ouvrez le <menuchoice> <guimenu>Centre de Contrôle de KDE </guimenu><guimenuitem>Configuration réseau</guimenuitem> <guimenuitem>Préférences de connexion</guimenuitem> </menuchoice>, <guilabel>Activer le mode passif (PASV)</guilabel> doit être coché ou décoché, cela dépend de votre configuration courante (par défaut case cochée). Essayez maintenant votre session &FTP; pour voir si cela marche. Aussi vérifiez que vous n'avez aucune autres sessions &FTP; ouvertes (utilisant un navigateur web, &etc;), qui peuvent causer des complications. Plus d'informations peuvent être trouvées dans <ulink url="http://slacksite.com/other/ftp.html">&FTP; actif vs. &FTP; passif, une explication définitive</ulink> (en anglais).

source: I get <errorcode>"FTP protocol not supported by &krusader;"</errorcode> error when trying to open a remote &FTP; directory, what to do?
fr: j'ai l'erreur <errorcode>protocole FTP non géré par &krusader;</errorcode> quand j'essaie d'ouvrir un dossier &FTP; distant. Que faire ?

source: The reason for this error is that '&FTP; via &HTTP; proxy' feature is not yet supported by &krusader;. This error may be caused by a misconfiguration of the proxy settings in &kcontrolcenter;. Modify the proxy settings to not use &HTTP; proxy and &FTP; will work.
fr: La raison de cette erreur est que le &FTP; à partir de la fonctionnalité de serveur mandataire &HTTP; n'est pas encore gérée par &krusader;. Cette erreur peut être causée par une mauvaise configuration des paramètres du serveur mandataire dans le &kcontrolcenter;. Modifiez les paramètres du serveur mandataire pour ne pas l'utiliser &HTTP; et le &FTP; fonctionnera.

source: How don't add ".part" suffix when copying files via ftp?
fr: Comment ne pas ajouter un suffixe « .part » à la copie de fichiers vers un &FTP; ?

source: When uploading files a <filename>.part</filename> suffix is added to the filename, once the upload is complete the filename is renamed automagically to remove the <filename>.part</filename> suffix. This works great but sometimes some ftp-servers don't allow a rename operation. You can solve this by unchecking the checkbox <guilabel>Mark partially uploaded files</guilabel> in &kde;'s control center. The checkbox is located at <menuchoice> <guimenu>Internet and Network</guimenu> <guimenuitem>Connection Preferences</guimenuitem> </menuchoice>.
fr: Quand vous envoyez des fichiers, un suffixe « .part » est ajouté au nom de fichier, une fois que l'envoi est terminé le nom de fichier est renommé automatiquement en supprimant le suffixe « .part ». Ce marche bien mais quelque fois certains serveurs ftp ne permettent pas l'opération de renommage. Vous pouvez résoudre cela en décochant la case <guilabel>Marquer les fichiers partiellement envoyés</guilabel> dans le Centre de Contrôle de KDE <menuchoice> <guimenu>Configuration Réseau</guimenu> <guimenuitem>Préférences de connexion</guimenuitem> </menuchoice>.

source: It's explained in the <link linkend="remote-connections">remote connections chapter</link>.
fr: C'est expliqué dans le chapitre <link linkend="remote-connections">connexions distantes</link>.

source: I am experiencing problems with the media:/ protocol, why?
fr: J'ai rencontré des problèmes avec le protocole media:/. Pourquoi ?

source: The media:/ protocol was removed from KDE4.
fr: Le protocol media :/ a été supprimé depuis KDE 4.

source: Those are the default &kde; System sounds, and not related to &krusader;. If you want to disable them globally open your &kde; &kcontrolcenter; ( <application>kcontrol</application>): <menuchoice> <guimenu>KDE Control Center</guimenu> <guimenuitem>Sound &amp; Multimedia</guimenuitem> <guimenuitem>System Notifications</guimenuitem> </menuchoice>, <guilabel>Event Source: "KDE System Notifications"</guilabel> and uncheck sound items you don't like.
fr: Ce sont ceux du système &kde; par défaut. Si vous voulez les désactiver globalement, ouvrez le &kcontrolcenter; (<guimenuitem>Notifications</guimenuitem> <guimenuitem>Notifications du système</guimenuitem> </menuchoice>, <guilabel>Source de l'évènement : notifications du système KDE</guilabel> et décochez les éléments de son qui vous n'aimez pas.

source: Where the remote connection manager ?
fr: Où est le gestionnaire de connexions distantes ?

source: Use our Bookmark Manager. Use a <link linkend="remote-connections">remote &URL;</link> and bookmark it.
fr: Utilisez notre gestionnaire de signets. Utilisez un <link linkend="remote-connections">&URL; distant</link> et ajoutez le aux signets.

source: Why doesn't mimetype magic sometimes work inside archives?
fr: Pourquoi les types de MIME magiques ne fonctionnent t-ils pas quelque fois dans les archives ?

source: Where is Konfigurator, do i need to install the &kde; Desktop Enviroment to use it?
fr: Où est le Konfigurator. Dois-je installer l'environnement de bureau &kde; pour l'utiliser ?

source: <link linkend="konfigurator">Konfigurator</link> is &krusader;s configuration module, when you have installed &krusader; than you have also Konfigurator. For some reason some people think it's an other &kde; application, but it is not, so you don't need to install the &kde; Desktop Enviroment to use Konfigurator. When runnig &krusader;, use <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure &krusader;</guimenuitem> </menuchoice>, and it will start <link linkend="konfigurator">Konfigurator</link>. Please read the manual, &krusader; has many many configuration options, a lot of things can be customized to your needs with <link linkend="konfigurator">Konfigurator</link>.
fr: <link linkend="konfigurator">Konfigurator</link> est le module de configuration de &krusader;. Il est fourni avec &krusader;. Pour certaines raisons, des gens pensent que c'est une application de &kde; alors que ça ne l'est pas, vous n'avez donc pas besoin d'installer &kde; pour utiliser Konfigurator. Quand vous lancez &krusader;, utilisez <menuchoice> <guimenu>Configuration</guimenu> <guimenuitem>Configurer &krusader;...</guimenuitem> </menuchoice>, and cela lancera <link linkend="konfigurator">Konfigurator</link>. Veuillez lire le manuel, &krusader; a de nombreuses options de configuration, beaucoup de choses peuvent être personnalisées pour vos besoins avec Konfigurator.

source: How can I set the look &amp; feel of 2 different users to be the same?
fr: Comment puis-je définir l'apparence et l'ergonomie de deux utilisateurs différents pour le même thème ?

source: Presuming that the current setup is the good configuration, you can copy the configuration to the other user. <screen><prompt>#</prompt> <userinput><command>cp ~/.kde/share/config/krusaderrc /home/foo_user/.kde/share/config</command></userinput></screen> And when the other user is Root use:
fr: En supposant que les paramètres par défaut sont la bonne configuration, vous pouvez copier la configuration vers l'autre utilisateur. <screen><prompt>#</prompt> <userinput><command>cp ~/.kde/share/config/krusaderrc /home/foo_user/.kde/share/config</command></userinput></screen> Et si l'autre utilisateur est le superutilisateur, utilisez :

source: General &FAQ;
fr: &FAQ; générale

source: How can I report a wish, a suggestion, or a comment?
fr: Comment puis-je rapporter un souhait, une suggestion ou un commentaire ?

source: An open source project's greatest strength is derived from getting user feedback. That is why we love to hear what you have to say. Your "gripes" are our instructions. After about 6 months, programmers can no longer see their own mistakes. It's natural. We want the ideas, qritiques, and feedback because we all want to make &krusader; the best and most useful file manager available anywhere.
fr: La grande force d'un projet Open Source vient du retour des utilisateurs. C'est pourquoi nous aimons entendre ce que vous avez à dire. Vos « ronchonnements » sont nos instructions. Après six mois, les programmeurs ne peuvent plus voir leurs propres erreurs. C'est naturel. Nous voulons des idées, des critiques et des retours parce que nous voulons tout faire pour rendre &krusader; le meilleur et le plus utilisable gestionnaire de fichiers disponible.
