Repository: CodeCollect/krusader
Catalog: doc/i18n/*/features.docbook.po
Languages: fr

source: <title>Features</title>
fr: <title>Fonctionnalités</title>

source: <primary>Features</primary>
fr: <primary>Fonctionnalités</primary>

source: The most important features and improvements are highlighted here, it would make this list too long if we were to include <emphasis>all</emphasis> the features and improvements. You will discover even more features in this documentation and in the &changelog-url; file.
fr: Les fonctionnalités et améliorations les plus importantes sont sous-lignées ici, cela rendrait cette liste trop longue si nous avions inclus <emphasis>toutes</emphasis> ces fonctionnalités et améliorations. Vous découvrirez encore plus de fonctionnalités dans ce manuel et dans le fichier de &changelog-url;.

source: &ofm-url; features
fr: Fonctionnalités &ofm-url;

source: Two powerful and easy to use <link linkend="panels">OFM panels</link>.
fr: Deux <link linkend="panels">panneaux OFM</link> puissants et faciles à utiliser.

source: &cmdline-lnk; and optional &termemu-lnk; below.
fr: &cmdline-lnk; et &termemu-lnk; optionnel ci-dessous.

source: Strong <link linkend="keyboard-commands"> keyboard</link>orientation and the ability to perform all functions without the mouse.
fr: Grandement orienté <link linkend="keyboard-commands">clavier</link> et la possibilité de réaliser toutes les fonctionnalités avec la souris.

source: Context-dependent invocation of scripts and programs &eg; mouseclick/enter (execute or open with the associated application), F3 (view) and F4 (edit).
fr: Invocation de contexte de scripts et programmes &pex; clic souris / entrer (exécuter ou ouvrir avec l'application associée), F3 (Afficher) et F4 (Modifier).

source: &usermenu-lnk;, create your own customized menu.
fr: &usermenu-lnk;, créer vos propres menus personnalisés.

source: History &eg; <link linkend="folderhistory">Folder History</link>, <link linkend="popular-urls">Popular &URL;s</link>, ...
fr: Historique &pex; <link linkend="folderhistory">Dossier d'historique</link>, <link linkend="popular-urls">&URL; les plus utilisés</link>,...

source: &vfs-lnk; for &eg; &remote-connections-lnk;, &archives-lnk;, search results, synchronizer.
fr: &vfs-lnk; pour &pex; les &remote-connections-lnk;, &archives-lnk;, résultats de recherche, synchroniseur.

source: Powerful internal <link linkend="krviewer">viewer and editor</link> via kparts supporting almost every file format.
fr: <link linkend="krviewer">Afficheur et éditeur</link> internes puissants via kparts gérant la plupart des formats de fichiers.

source: &advanced-search-module-lnk; : searching in archives and search content on remote file systems.
fr: &advanced-search-module-lnk; : recherche dans les archives et rechercher le contenu sur des systèmes de fichiers distants.

source: Several Panel view modes via the &popup-panel-lnk;.
fr: Plusieurs panneaux de modes de vues via le &popup-panel-lnk;.

source: &krusader; tools
fr: Outils de &krusader;

source: &remote-connections-lnk; : &FTP;/SAMBA with SFTP/SCP support via &kioslaves1-url;
fr: &remote-connections-lnk; : gestion de &FTP;/SAMBA avec SFTP/SCP via &kioslaves1-url;

source: Mount-Manager
fr: Gestionnaire de montage

source: &krusader; features
fr: Fonctionnalités &krusader;

source: Archive Handling: browsing, unpack, pack, testing. Supported &archives-lnk; : ace, arj, bzip2, deb, gzip, iso, lha, rar, rpm, tar, zip and 7-zip.
fr: Prise en charge des archives : navigation, décompression, compression, test. &archives-lnk; gérées : ace, arj, bzip2, deb, gzip, iso, lha, rar, rpm, tar, zip et 7-zip.

source: <link linkend="checksum">Checksum creation-verification</link> mechanism that supports md5, sha1, sha256, sha224, sha256, sha384, sha512, tiger, whirlpool, cfv and crc.
fr: Mécanisme de <link linkend="checksum">vérification et création de somme de contrôle</link> qui gère md5, sha1, sha256, sha224, sha256, sha384, sha512, tiger, whirlpool, cfv et crc.

source: <link linkend="calculate">Calculate occupied space</link> of files and folders, archives and remote filesystems.
fr: <link linkend="calculate">Calculer l'espace occupé</link> des fichiers et dossiers, archives et systèmes de fichiers distants.

source: <link linkend="compare-dir">Directory comparison</link> and <link linkend="view-menu">filtering</link>.
fr: <link linkend="compare-dir">Comparaison de dossiers</link> et <link linkend="view-menu">filtrage</link>.

source: <link linkend="compare-content">Compare files by content</link> via external diff programs like &kompare;, &kdiff3-url; or &xxdiff-url;.
fr: <link linkend="compare-content">Comparer les fichiers par contenu</link> via des outils de comparaison externes comme &kompare;, &kdiff3-url; ou &xxdiff-url;.

source: <link linkend="multi_rename">Rename</link> files and folders via &krename-url;
fr: <link linkend="multi_rename">Renommer</link> des fichiers et dossiers via &krename-url;

source: Completely supports drag'n'drop: drag from &konqueror; straight into a .tar.gz file, from &krusader;'s panel into the trash-bin, the desktop or into &konqueror;
fr: Gère complètement le glisser & déposer : glisser de &konqueror; dans un fichier d'archive tar.gz ; depuis le panneau de &krusader; dans la corbeille, le bureau ou dans &konqueror;

source: <link linkend="konfig-advanced">Preserve date</link> for local targets at copy/move operations.
fr: <link linkend="konfig-advanced">Préserver la date</link> pour les cibles locales pendant les opérations de copie et déplacement.

source: F2 opens a <link linkend="tools-menu">Terminal Window</link> in the default directory.
fr: F2 ouvre une <link linkend="tools-menu">fenêtre de terminal</link> dans le dossier par défaut.

source: Easy editing of <link linkend="file-menu">file permissions</link> and ownership and <link linkend="konfig-looknfeel-operation">Numeric permissions</link>.
fr: Modification facile des <link linkend="file-menu">droits d'accès des fichiers</link> et du propriétaire et des <link linkend="konfig-looknfeel-operation">droits d'accès numériques</link>.

source: <link linkend="krusearcher">Selection filters</link> used in &eg; Synchronizer and KruSearcher.
fr: <link linkend="krusearcher">Filtres sélection</link> utilisés dans &pex; Synchronizer et KruSearcher.

source: Jump-Back
fr: Point de retour

source: <link linkend="konfig-general"> mimetype-aware</link>.
fr: <link linkend="konfig-general">prise en charge des types MIME</link>.

source: <link linkend="folder-tabs">Tabbed panels</link> and <link linkend="krviewer">Tabbed Editor/Viewer</link>.
fr: <link linkend="folder-tabs">Panneaux avec onglets</link> et <link linkend="krviewer">Afficheur et éditeur avec onglets</link>.

source: File splitter
fr: Fractionner des fichiers

source: Mouse Gestures
fr: Mouvements avec la souris

source: <link linkend="list_panel">Quick Navigation</link> in the Location Toolbar.
fr: <link linkend="list_panel">Navigation rapide</link> dans la barre d'outils d'emplacement.

source: &whatsthis-url; Help function in favour of tooltips where reasonable.
fr: &whatsthis-url; : fonctionnalité d'aide grâce à des bulles d'aide placées judicieusement.

source: Customize &krusader; to your own needs
fr: Personnaliser &krusader; pour vos propres besoin.

source: <link linkend="konfig-startup"> Konfigurator</link> &krusader;'s configuration center.
fr: <link linkend="konfig-startup"> Konfigurator</link> : centre de configuration de &krusader;.

source: &main-toolbar-lnk;, <link linkend="actions_toolbar">Actions Toolbar</link> for user actions and bookmarks.
fr: &main-toolbar-lnk; : <link linkend="actions_toolbar">barre d'outils d'actions</link> pour les actions utilisateurs et les signets.

source: Key-bindings
fr: Raccourcis clavier

source: Colors
fr: Couleurs

source: Many more features can be <link linkend="konfig-startup">configured</link> the way you like.
fr: Plus de fonctionnalités peuvent être <link linkend="konfig-startup">configurées</link> de la manière dont vous le souhaitez.

source: &krusader; Extensions
fr: Extensions de &krusader;

source: Download and upload your favourite &krusader; extensions at &kde-files-url;.
fr: Télécharger et envoyer vos extensions favorites de &krusader; à &kde-files-url;.

source: New features in the &krusader;-1.80.0 "Final 3rd Stone" release
fr: Nouvelles fonctionnalités dans la version de &krusader;-1.80.0 « Final 3rd Stone ».

source: Archive improvements
fr: Améliorations des archives

source: <link linkend="archives">Password support</link> for: arj, ace, rar and zip. Passwords can be stored in &kwallet;
fr: <link linkend="archives">Gestion du mot de passe</link> pour : arj, ace, rar and zip. Les mots de passe peuvent être stockés dans &kwallet;.

source: <link linkend="archives">7-zip support</link>, by external applications 7z and 7za.
fr: <link linkend="archives">Gestion de 7-zip</link> avec les applications externes comme 7z et 7za.

source: <link linkend="archives">Auto-detection support</link>, allowing you to open "hidden archives" (&eg; &openoffice; documents).
fr: <link linkend="archives">Gestion de l'auto-détection</link>, vous permettant d'ouvrir les « archives cachées » (&pex; les documents &openoffice;).

source: Packing/unpacking is now in the background.
fr: Compresser et décompresser se fait maintenant en tâche de fond.

source: Brief View
fr: Vue résumée

source: Many improvements of the UserAction &useractions-lnk; system.
fr: De nombreuses améliorations du systèmes d'actions utilisateurs &useractions-lnk;

source: Countless usability enhancements, especially in Konfigurator and the heavily reordered menubar.
fr: Nombreuses améliorations de l'ergonomie, spécialement dans Konfigurator et grosse remise en ordre de la barre de menu

source: Media button
fr: Bouton média

source: Copy/Move: <link linkend="copying">preserve all attributes</link> (time, owner, group).
fr: Copie et déplacement : <link linkend="copying">préserver tous les attributs</link> (heure, propriétaire, groupe).

source: <link linkend="konfig-color">Dim the colors of the inactive panel</link>.
fr: <link linkend="konfig-color">Assombrir les couleurs du panneau inactif</link>.

source: Renaming a filename without extension, single instance mode, start to system tray, check this out in <link linkend="konfigurator">Konfigurator</link>
fr: Renommer un nom de fichier sans extension, mode d'instance simple, démarrage minimiser dans la boîte à miniature ; à configurer dans <link linkend="konfigurator">Konfigurator</link>

source: Configurable <link linkend="list_panel">Atomic extensions</link>, so that extensions like <filename>tar.gz</filename> are shown as one part in the <guilabel>Ext Column</guilabel>.
fr: <link linkend="list_panel">Extensions atomiques</link> configurables, pour que les extensions comme <filename>tar.gz</filename> sont affichées comme un élément dans la <guilabel>colonne Ext</guilabel>.

source: Context menu for bookmarks and enable/disable special bookmarks.
fr: Menu contextuel pour les signets et activation / désactivation des signets spéciaux.

source: Restyled <link linkend="menu-commands">MenuBar</link>
fr: Redéfinition de la <link linkend="menu-commands">barre de menu</link>

source: &termemu-lnk; enhancements bringing new functions, new usages and new look.
fr: &termemu-lnk; : les améliorations apportent de nouvelles fonctionnalités, nouvelles utilisations et nouveau look.

source: &synchronizer-lnk; enhancements and parallel threads for slow FTP servers.
fr: Améliorations de &synchronizer-lnk; et processus légers parallèles pour les serveurs FTP lents.

source: <link linkend="konfig-startup">Single instance mode</link>, <link linkend="konfig-startup">start to system tray</link>
fr: <link linkend="konfig-startup">Mode d'instance simple</link>, <link linkend="konfig-startup">démarrage minimiser dans la boîte à miniatures</link>

source: Context menu for permanent bookmarks.
fr: Menu contextuel pour les signets permanents.

source: Full support for <link linkend="acl">ACL permissions</link> permissions, like properties, preserve attributes, synchronizer and other.
fr: Gestion complète des <link linkend="acl">droits d'accès ACL</link>, comme les propriétés, la préservation des attributs, la synchronisation et autres.

source: Searcher-results, Locate-results, Synchronizer-results: support for dragging items and copy to clipboard (CTRL+C).
fr: Résultats de recherche, résultats de localisation, résultats de Synchronizer, gestion pour les éléments glissés et copiés vers le presse-papiers (Ctrl + C)

source: Many bug fixes.
fr: De nombreux correctifs de bogues.

source: New features in the &krusader;-1.90.0 "Power Stone" release
fr: Nouvelles fonctionnalités dans la version de &krusader;-1.90.0 « Power Stone »

source: Last release for KDE3.x with a <ulink url="http://www.krusader.org/phpBB/viewtopic.php?t=2061"> big collection of Useractions</ulink>.
fr: Dernière version pour KDE3.x avec une <ulink url="http://www.krusader.org/phpBB/viewtopic.php?t=2061">grosse collection d'actions utilisateurs</ulink>.

source: New features in the &krusader;-2.0.0 "Apollo" release
fr: Nouvelles fonctionnalités dans la version de &krusader;-2.0.0 « Apollo »

source: The first release for the KDE4.x series
fr: La première version pour les séries KDE4.x

source: Krusader works on &Windows;! (But not so useful and powerful yet as under &Linux;)
fr: &krusader; fonctionne sous &Windows; ! (Mais pas aussi utilisable et puissant pour le moment que sous &Linux;)

source: Queue manager!
fr: Gestionnaire de file d'attente !

source: Five methodsmethods in the panel!
fr: Cinq méthodes dans le panneau !

source: For more features, please read the &changelog-url; and &svnnews-url;.
fr: Pour plus de fonctionnalités, veuillez lire le &changelog-url; et &svnnews-url;.
