Repository: CodeCollect/krusader
Catalog: doc/i18n/*/help.docbook.po
Languages: fr

source: Help &krusader;
fr: Aide de &krusader;

source: Help
fr: Aide

source: Here is your opportunity to <ulink url="http://www.krusader.org/help.php">contribute</ulink> to the &krusader; project. There are things that need to be done, but can't be done by us. If you feel you can help, do not hesitate to contact us; every OpenSource can use some help. Please also check the <ulink url="http://www.krusader.org/help.php">contribute</ulink> donate-url page on our website for more recent information. Thanks!
fr: Vous avez une opportunité de <ulink url="http://www.krusader.org/help.php">contribuer</ulink> au projet &krusader;. Il y a des choses qui ont besoin d'être réalisées, mais ne pouvant l'être par nous même. Si vous sentez que vous pouvez aider, n'hésitez pas à nous contacter. Veuillez aussi vérifier la page <ulink url="http://www.krusader.org/help.php">contribuer</ulink> sur notre site web pour de plus récentes informations. Merci !

source: Help is needed (we are looking for documentation writers) for keeping the &krusader; documentation up to date. The draft explanation of new features is done by the developers on the krusader-devel mailing list, but we need editors to add this information in the handbook. By playing with the new features these editors can give valuable information to the developers for making the new features even better!
fr: De l'aide est nécessaire (nous recherchons des rédacteurs de documentation) pour avoir la documentation de &krusader; à jour. L'ébauche de l'explication des nouvelles fonctionnalités est rédigée par les développeurs sur la liste de diffusion krusader-devel, mais nous avons besoin de rédacteurs pour ajouter ces informations dans le manuel. En utilisant les nouvelles fonctionnalités, ces rédacteurs peuvent donner de précieuses informations aux développeurs pour rendre les nouvelles fonctionnalités encore meilleures !

source: &krusader; Extensions
fr: Extensions de &krusader;

source: Please upload your favourite extensions at <ulink url="http://www.kde-files.org/index.php?xcontentmode=660x661x662x663">kde-files.org</ulink>, so that they become available for the &krusader; community. Maybe they will be shipped by default with &krusader; at the next release :-)) It features <ulink url="http://www.kde-files.org/index.php?xcontentmode=660"> Keymaps</ulink>, <ulink url="http://www.kde-files.org/index.php?xcontentmode=661"> Colormaps</ulink>, <ulink url="http://www.kde-files.org/index.php?xcontentmode=662"> User Actions</ulink>, <ulink url="http://www.kde-files.org/index.php?xcontentmode=663"> JavaScript Extensions</ulink>.
fr: Veuillez envoyer vos extensions favorites à <ulink url="http://www.kde-files.org/index.php?xcontentmode=660x661x662x663">kde-files.org</ulink>, pour qu'elles deviennent disponibles à la communauté de &krusader;. Elles seront peut-être livrées par défaut avec la prochaine version de &krusader; :-)) <ulink url="http://www.kde-files.org/index.php?xcontentmode=660"> Raccourcis clavier</ulink>, <ulink url="http://www.kde-files.org/index.php?xcontentmode=661"> Schéma de couleurs</ulink>, <ulink url="http://www.kde-files.org/index.php?xcontentmode=662"> Actions Utilisateurs</ulink>, <ulink url="http://www.kde-files.org/index.php?xcontentmode=663">Extensions JavaScript</ulink>.

source: User Actions can be discussed in our <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=11">UserActions Forum</ulink>, please join!
fr: Les Actions Utilisateurs peuvent être discutées dans notre <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=11">forul des actions utilisateur</ulink>, rejoignez nous !

source: Spread the Word &krusader;
fr: Propager le mot &krusader;

source: If you like &krusader;, <ulink url="http://krusader.sourceforge.net/spread.php">let people know!</ulink> Write articles and reviews for internet or print publications. Encourage your friends to give &krusader; a try. Participate in forums to help others in the community.
fr: Si vous aimez &krusader;, <ulink url="http://krusader.sourceforge.net/spread.php">faites le connaître autour de vous !</ulink> Écrivez des articles et des analyses pour internet ou des publications papier. Encouragez vos amis à donner une chance à &krusader;. Participez aux forums pour aider les autres dans la communauté.

source: GUI Translations
fr: Traductions de l'interface graphique

source: &krusader; is available in many languages, but usually several translations do need an update and translations to new languages are always welcome, please read the <ulink url="http://www.krusader.org/i18n.php">i18n page</ulink> . Even when there is already a translator for your native language, it is always helpful to have a second or third translator e.g. for proofreading. Sometimes the regular translator is not available when a translation update is needed (studies, holiday...). Please contact the translator/s for your native language; your help will be appreciated. Any translation (even partial translations) are accepted by the &krusader;-Krew at any time (feature freeze or not).
fr: &krusader; est disponible dans de nombreuses langues, mais généralement des traductions ont besoin d'une mise à jour et les traductions dans de nouvelles langues sont toujours les bienvenues. Veuillez lire la <ulink url="http://www.krusader.org/i18n.php">page i18n</ulink>. Même quand il y a toujours un traducteur pour votre langue native, il est toujours utile d'avoir un deuxième ou troisième traducteur &pex; pour la relecture. Quelque fois le traducteur régulier n'est pas disponible quand la traduction a besoin d'une mise à jour (études, vacances...). Veuillez contacter le(s) traducteur(s) de votre langue native, votre aide sera appréciée. Toutes traductions (même partielles) sont acceptées par l'équipe de &krusader; à tout moment.

source: Documentation Translations
fr: Traductions de la documentation

source: This documentation is translatable, if you are interested in translating this documentation please contact Frank.
fr: Cette documentation est traduisible. Si vous êtes intéressé à traduire ce document, veuillez contacter Franck.

source: Actually, we hadn't considered donations, until users asked us for a way to <ulink url="http://sourceforge.net/project/project_donations.php?group_id=6488">Donate</ulink> to the project. &krusader; is, and always will be free, in all the terms of the GNU Public License.
fr: Actuellement, nous n'avions pas pensé aux donations, jusqu'à ce que les utilisateurs nous demandent la manière de <ulink url="http://sourceforge.net/project/project_donations.php?group_id=6488">donner</ulink> au projet. &krusader; est et sera toujours gratuit, dans tous les termes de la licence publique GNU.

source: Packagers
fr: Empaqueteurs

source: We are always in need of packagers for different distro rpm's, deb's, etc. All help is welcome.
fr: Nous avons toujours besoin de responsables de paquetages pour les différentes distributions rpm, deb, &etc;. Toutes les aides sont les bienvenues.

source: Users' feedback for the &krusader; &MacOS; X port
fr: Retours utilisateurs pour le portage de &krusader;vers &MacOS; X

source: There is a <ulink url="http://pdb.finkproject.org/pdb/package.php/krusader">&MacOS;-X port</ulink> with the help of <ulink url="http://www.finkproject.org/">fink</ulink> , the port is maintained by <ulink url="http://hritcu.wordpress.com/about/">Catalin Hritcu</ulink>, all feedback is welcome.
fr: Il y a un <ulink url="http://pdb.finkproject.org/pdb/package.php/krusader">portage pour &MacOS;-X</ulink> avec l'aide de <ulink url="http://www.finkproject.org/">fink</ulink>, le port est maintenu par <ulink url="http://hritcu.wordpress.com/about/">Catalin Hritcu</ulink>, tous les retours sont les bienvenus.

source: Porting &krusader; to &Windows;
fr: Porter &krusader; vers &Windows;

source: &krusader;-2.x is ported to &Windows; since 18 June 2008. It needs &Qt; as and &kde;libs to run. All feedback is welcome.
fr: &krusader;-2.x est porté vers &Windows; depuis le 18 juin 2008. Celui-ci a besoin des bibliothèques &Qt; et &kde;. Tous les retours sont les bienvenus.

source: If you have a question that is missing in the <link linkend="faq">FAQ</link>, we would like to hear it.
fr: Si vous avez une question qui est manquante dans la <link linkend="faq">FAQ</link>, nous aimerions l'entendre.

source: Others
fr: Autres

source: <link linkend="faqg_wish">Feedback</link>, <link linkend="faqg_bug_report">Bug reports</link>, patches, &etc; are always welcome! An open source project's greatest strength is derived from getting user feedback.
fr: Les <link linkend="faqg_wish">retours</link>, <link linkend="faqg_bug_report">rapports de bogues</link>, patches, &etc; sont toujours les bienvenus ! La magnifique force d'un projet open source provient du retour des utilisateurs.

source: On some websites like <ulink url="http://freshmeat.net/projects/krusader/">freshmeat.net</ulink> or <ulink url="http://www.kde-apps.org/content/show.php?content=10214">KDE-APPS.org</ulink> you can give a rate, if you like &krusader; go to one of these sites and rate &krusader;, thanks.
fr: Sur des sites web comme <ulink url="http://freshmeat.net/projects/krusader/">freshmeat.net</ulink> ou <ulink url="http://www.kde-apps.org/content/show.php?content=10214">KDE-APPS.org</ulink>, vous pouvez donner une note. Si vous aimez &krusader;, allez sur l'un de ces sites et notez &krusader;. Merci.
