Repository: CodeCollect/krusader
Catalog: doc/i18n/*/installation.docbook.po
Languages: fr

source: Installation of Krusader on KDE4.x
fr: Installation de Krusader sur KDE4.x

source: Requirements
fr: Exigences

source: In order to successfully use the most recent &krusader;, you need &kde;libs &gt;= 4.x
fr: Pour utiliser correctement la plus récente version de &krusader;, vous avez besoin de &kde;libs &gt;= 4.x

source: Required &kde; version: <itemizedlist> <listitem> <para>&krusader; v1.01: &kde; 2</para> </listitem> <listitem> <para>&krusader; v1.02 - 1.40: &kde; 3.0 - &kde; 3.2</para> </listitem> <listitem> <para>&krusader; 1.40: prefers &kde; 3.2 (otherwise all features will not be available)</para> </listitem> <listitem> <para>&krusader; v1.50 - v1.51: &kde; 3.2 - &kde; 3.3 (Konfigurator crash on &kde; 3.4)</para> </listitem> <listitem> <para>&krusader; v1.60.0 - v1.70.0: &kde; 3.3 - &kde; 3.5</para> </listitem> <listitem> <para>&krusader; 1.70.x: prefers &kde; &gt;= 3.4 (otherwise all features will not be available)</para> </listitem> <listitem> <para>&krusader; 1.80.0: &kde; 3.4 - &kde; 3.5</para> </listitem> <listitem> <para>&krusader; 1.90.0: &kde; 3.2 - &kde; 3.5</para> </listitem> <listitem> <para>&krusader; v2.x.x: &kde; 4.x</para> </listitem> </itemizedlist> NOTE: for installation instructions for &krusader;-1.x for &kde; 2 click <link linkend="kde3_install">here</link>.
fr: Version de &kde; requise : <itemizedlist> <listitem> <para>&krusader; v1.01 : &kde; 2</para> </listitem> <listitem> <para>&krusader; v1.02 - 1.40 : &kde; 3.0 - &kde; 3.2</para> </listitem> <listitem> <para>&krusader; 1.40 : préfère &kde; 3.2 (sinon toutes les fonctionnalités ne seront pas possible)</para> </listitem> <listitem> <para>&krusader; v1.50 - v1.51 : &kde; 3.2 - &kde; 3.3 (Konfigurator plante avec &kde; 3.4)</para> </listitem> <listitem> <para>&krusader; v1.60.0 - v1.70.0 : &kde; 3.3 - &kde; 3.5</para> </listitem> <listitem> <para>&krusader; 1.70.x : préfère &kde; &gt;= 3.4 (sinon toutes les fonctionnalités ne seront pas possible)</para> </listitem> <listitem> <para>&krusader; 1.80.0 : &kde; 3.4 - &kde; 3.5</para> </listitem> <listitem> <para>&krusader; 1.90.0 : &kde; 3.2 - &kde; 3.5</para> </listitem> <listitem> <para>&krusader; v2.x.x : &kde; 4.x</para> </listitem> </itemizedlist> REMARQUE : pour les instructions d'installation pour la version de &krusader;-1.x de &kde; 2 cliquez <link linkend="kde3_install">ici</link>.

source: Platforms:
fr: Plate formes :

source: All POSIX (&Linux;/BSD/&UNIX;-like OSes), &Solaris;
fr: Tous les systèmes POSIX (&Linux; / BSD / &UNIX;), &Solaris;

source: &Windows; XP and Vista
fr: &Windows; XP et Vista

source: In order to handle archives, checksums and other utilities they must be configured in our <link linkend="konfig-dependencies">configuration tool</link>. When running &krusader; for the first time the available utilities will be autodetected, and a report will be shown in the first lanch wizard. Afterwards additional utilities can be <link linkend="konfig-dependencies">added/removed/changed</link>.
fr: Afin de prendre en main les archives, les sommes de contrôle et autres utilitaires, ils doivent être configurés dans votre <link linkend="konfig-dependencies">outil de configuration</link>. Quand &krusader; est lancé pour la première fois, les utilitaires disponibles seront automatiquement détectés, et un rapport sera affiché au premier lancement de l'assistant. Ensuite des utilitaires additionnels peuvent être <link linkend="konfig-dependencies">ajoutés / supprimés / modifiés</link>.

source: Obtaining &krusader;
fr: Obtenir &krusader;

source: &krusader; Downloads
fr: Télécharger &krusader;

source: Others
fr: Autres

source: If you still can not find a package, follow the installation procedure on how to compile &krusader; from source. This very thorough HowTo describes the process in such detail that even newcomers should not have any problems.
fr: Si vous ne trouver toujours pas un paquetage, suivez la procédure d'installation sur la manière de compiler &krusader; depuis les sources. Ce très exhaustif HOWTO (Comment Faire) décrit le processus dans de tels détails que même un nouveau venu ne devrait pas avoir de problèmes.

source: Version Scheme
fr: Version de projet

source: A new version scheme has been used since &krusader;-1.60.0 <itemizedlist> <listitem> <para>First digit - the major version</para> </listitem> <listitem> <para>Second digit(s) - percentage of features completed for this major version</para> </listitem> <listitem> <para>Third digit(s) - bugfixes.</para> </listitem> </itemizedlist>In essence, releasing &krusader;-1.60.0 means that we believe that &krusader; is about 60% done with all the features we had scheduled for the 1.x.x series. Series 2.x.x will be &kde; 4.x releases. Hopefully, it is easy to understand.
fr: Une nouvelle version de projet a été utilisée depuis &krusader;-1.60.0 <itemizedlist> <listitem> <para>Premier chiffre - la version majeure</para> </listitem> <listitem> <para>Deuxième chiffre(s) - pourcentage des fonctionnalités complétées pour cette version majeure</para> </listitem> <listitem> <para>Troisième chiffre - correctifs de bogues.</para> </listitem> </itemizedlist>Par définition, sortir la version de &krusader;-1.60.0 signifie que nous croyons que &krusader; est développé à 60 % avec toutes les fonctionnalités que nous avons planifiées pour les séries 1.x.x. Les séries 2.x.x seront des versions pour &kde; 4.x. Nous espérons que cela est simple à comprendre.

source: Stable Version
fr: Version stable

source: Development Version (beta release)
fr: Version de développement (version beta)

source: Before every stable release we release at least one development version in order to hunt down the bugs.
fr: Avant chaque version stable, nous sortons au moins une version de développement afin de chasser les bogues.

source: These releases are beta releases and will probably contain some bugs.
fr: Ces versions sont des versions beta et contiendront probablement des bogues.

source: The beta release has 3 goals:
fr: La version beta a trois buts :

source: Apply a feature-freeze until the stable is released, only bugs will be fixed. New features have to wait until the stable is released.
fr: Appliquer un gel des fonctionnalités développées jusqu'à ce que la version stable est sortie, seul les bogues seront corrigés. Les nouvelles fonctionnalités attendrons la sortie de la nouvelle version stable.

source: Obtain feedback from &krusader; users so that we can fix the bugs.
fr: Obtenir des remarques des utilisateurs de &krusader; afin de corriger des bogues.

source: Currently, there are four module options:
fr: Actuellement, il y a quatre options de module :

source: krusader_kde2: the &kde;2 branch, stable but it is basically v1.01 and there are no planned changes
fr: krusader_kde2 : la branche &kde;2 qui est stable mais c'est basiquement une v1.01 et il n'y a pas de modifications de prévues.

source: krusader_kde3: the &kde;3 branch, stable but it is basically v1.90.0 and there are no planned changes
fr: krusader_kde3 : la branche &kde;3 qui est stable mais c'est basiquement une v1.90.0 et il n'y a pas de modifications de prévues.

source: krusader_kde4: the &kde;4 branch that we currently use
fr: krusader_kde4 : la branche &kde;4 que nous utilisons actuellement.

source: trunc: the &kde;4 the development version
fr: trunk : la version de développement de &kde;4.

source: To check out the latest &krusader; 1.x for &kde; 3 from SVN: <screen><prompt>$</prompt> <userinput><command>svn</command> <option>co https://krusader.svn.sourceforge.net/svnroot/krusader/branches/krusader_kde3/</option></userinput></screen> To check out the latest &krusader; 2.x for &kde; 4 from SVN: <screen><prompt>$</prompt> <userinput><command>svn</command> <option>co https://krusader.svn.sourceforge.net/svnroot/krusader/branches/krusader_kde4/</option></userinput></screen> To check out the latest developement &krusader; 2.x for &kde; 4 from SVN:
fr: Pour réceptionner la dernière version de &krusader; 1.x pour &kde; 3 depuis le SVN : <screen><prompt>$</prompt> <userinput><command>svn</command> <option>co https://krusader.svn.sourceforge.net/svnroot/krusader/branches/krusader_kde3/</option></userinput></screen> Pour réceptionner la dernière version de &krusader; 2.x pour &kde; 4 depuis le SVN : <screen><prompt>$</prompt> <userinput><command>svn</command> <option>co https://krusader.svn.sourceforge.net/svnroot/krusader/branches/krusader_kde4/</option></userinput></screen> Pour réceptionner la dernière version de développement de &krusader; 2.x pour &kde; 4 depuis le SVN :

source: Older Releases
fr: Anciennes versions

source: Krusader installation instructions on KDE4.x
fr: Instructions d'installation de Krusader sur KDE4.x

source: From version &krusader;-2.0.0 and higher is &kde;-4 only.
fr: Depuis la version &krusader;-2.0.0 et supérieure pour &kde;-4 seulement.

source: At moment of writing &krusader;-2.0.0 is still under development, though it works :)
fr: Au moment de l'écriture de ces lignes, &krusader;-2.0.0 est toujours en développement, en espérant que cela fonctionne :)

source: "krusader_kde4.tar.gz" is the supposed name of the krusader tarball (it will be probably a different one ;)
fr: krusader_kde4.tar.gz est le nom supposé de l'archive de Krusader (cela sera probablement un nom différent).

source: You can download the latest available krusader-2.x <link linkend="krusader_svn">from SVN</link>.
fr: Vous pouvez télécharger la dernière version disponible de krusader-2.x <link linkend="krusader_svn">depuis le SVN</link>.

source: Krusader dependencies
fr: Dépendances de Krusader

source: The next packages are needed to run the Krusader binary.
fr: Les paquetages suivants ont besoin de la bibliothèque de Krusader pour se lancer.

source: c libraries
fr: Bibliothèques C

source: kdelibs5 (KDE4 core libraries and binaries for all KDE4 applications)
fr: kdelibs5 (les bibliothèques du cœur de KDE4 et les binaires pour toutes les applications de KDE4)

source: libkjsembed1 (Embedded JavaScript library) (for the the optional Javascripting function in Krusader)
fr: libkjsembed1 (Embedded JavaScript library) (pour la fonctionnalité optionnelle du Javascript dans Krusader)

source: Suggested packages
fr: Paquetages suggérés

source: These packages are optional but they will make Krusader much more powerful and useful.
fr: Ces paquetages sont optionnels mais ils rendront Krusader plus puissant et utilisable.

source: The next packages are the names that Debian/Ubuntu uses, other Linux distros will probably use similar names.
fr: Les paquetages suivants ont les noms que Debian / Ubuntu utilisent, les autres distributions Linux auront probablement des noms similaires.

source: arj: archiver for .arj files
fr: arj : archiveur pour les fichiers .arj

source: ark: graphical archiving tool for KDE
fr: ark : outil d'archivage graphique pour KDE

source: bzip2: high-quality block-sorting file compressor - utilities
fr: bzip2 : compresseur de fichiers de haute qualité - utilitaires

source: cpio: GNU cpio -- a program to manage archives of files
fr: cpio : GNU cpio - un programme pour gérer des archives de fichiers

source: kdebase-bin: core binaries for the KDE base module
fr: kdebase-bin : binaires principaux pour le module de base de KDE

source: kdiff3: compares and merges 2 or 3 files or directories
fr: kdiff3 : compare et fusionne deux ou trois fichiers ou dossiers

source: OR kompare: a KDE GUI for viewing differences between files
fr: OR kompare : une interface graphique KDE pour afficher les différences entres les fichiers

source: OR xxdiff: a graphical file and directories comparison and merge tool
fr: OR xxdiff : un fichier graphique et une comparaison de dossiers ainsi qu'un outils de fusion

source: khexedit: KDE hex editor
fr: khexedit : éditeur hexadécimal pour KDE

source: kmail: KDE Email client
fr: kmail : client de courrier électronique pour KDE

source: konsole: X terminal emulator for KDE
fr: konsole : émulateur de terminal X pour KDE

source: krename: Powerful batch renamer for KDE
fr: krename : puissant renommeur par lot pour KDE

source: lha: lzh archiver
fr: lha : archiveur lzh

source: md5deep: versatile file checksum creator and verifier
fr: md5deep : créateur et vérificateur versatile de somme de contrôle de fichiers

source: cfv: versatile file checksum creator and verifier
fr: cfv : créateur et vérificateur versatile de somme de contrôle de fichiers

source: p7zip: 7zr file archiver with high compression ratio
fr: p7zip : archiveur de fichiers 7zr avec un ratio de compression élevé

source: rpm: Red Hat package manager
fr: rpm : gestionnaire de paquetages Red Hat

source: unace: extract, test and view .ace archives
fr: unace : extraire, tester et afficher des archives .ace

source: unrar: Unarchiver for .rar files (non-free version)
fr: unrar : compresseur pour des fichiers .rar (version non-libre)

source: OR unrar-free: Unarchiver for .rar files
fr: OR unrar-free : décompresseur de fichiers .rar

source: OR rar: Archiver for .rar files
fr: OR rar : compresseur de fichiers .rar

source: unzip: De-archiver for .zip files
fr: unzip : décompresseur de fichiers .zip

source: zip: Archiver for .zip files
fr: zip : compresseur de fichiers .zip

source: Compilation requirements
fr: Exigences de compilation

source: The next packages are needed for compiling Krusader, if you only run a Krusader binary you don't need these packages.
fr: Les paquetages suivants sont obligatoires pour compiler Krusader, si vous lancer simplement un binaire de Krusader, vous n'avez pas besoin de ces paquetages.

source: gcc (The GNU C compiler)
fr: gcc (le compileur GNU C)

source: g++ (The GNU C++ compiler)
fr: g++ (le compileur GNU C++)

source: cmake (A cross-platform, open-source make system)
fr: cmake (un système make open-source et inter plate formes)

source: zlib1g-dev: (library for implementing the deflate compression method found in gzip and PKZIP)
fr: zlib1g-dev (bibliothèques pour implanter la méthode de compression deflate trouvée dans gzip et PKZIP)

source: gettext (contains msgfmt)
fr: gettext (contient msgfmt)

source: kdelibs5-dev (installs many development libraries for KDE4)
fr: kdelibs5-dev (installe des bibliothèques de développement pour KDE4)

source: libphonon-dev (libphonon-dev cross-platform multimedia framework development)
fr: libphonon-dev (architecture multimédia inter plate formes de développement)

source: Installing on Linux and BSD platforms
fr: Installation sur des plate formes Linux et BSD

source: <command>-DCMAKE_INSTALL_PREFIX=/usr/</command> is the location where Krusader will be installed with the make command.
fr: <command>-DCMAKE_INSTALL_PREFIX=/usr/</command> est l'emplacement où Krusader sera installé avec la commande make.

source: An other example is: <command>-DCMAKE_INSTALL_PRFIX=/opt/krusader</command> to install the compiled Krusader in an other directory to not overwrite the Krusader version installed by your package manager.
fr: Un autre exemple est : <command>-DCMAKE_INSTALL_PRFIX=/opt/krusader</command> pour installer Krusader compilé dans un autre dossier pour ne pas écraser la version de Krusader installée avec votre gestionnaire de paquetages.

source: Uninstall
fr: Désinstallation

source: Installing on the &MacOS;-X platform
fr: Installation sur la plate forme &MacOS;-X

source: Installing on the &Windows; platform
fr: Installation sur une plate forme &Windows;

source: Tested on &Windows; XP, not yet tested on &Windows; Vista but it should work.
fr: Testé sur &Windows; XP, pas encore testé sur &Windows; Vista mais cela devrait fonctionner.

source: Starting &krusader;
fr: Démarrer &krusader;

source: When &krusader; is started from the command line, various options can be specified to modify its behavior.
fr: Quand &krusader; est démarré depuis la ligne de commande, diverses options peuvent être spécifiées pour modifier son comportement.

source: Do not worry about the messages you get in the &konsole;. These messages are log messages that can be used for debugging &krusader;.
fr: Ne vous inquiétez pas de ces messages, vous êtes dans une &konsole;. Ces messages sont des messages de log qui peuvent être utilisés pour déboguer &krusader;.

source: You can also use <keycombo action="simul">&Alt; <keycap>F2</keycap></keycombo> to open the Run Command dialog box, type <userinput> <command>krusader</command> </userinput> (lower case) and press &Enter; or click on the <guibutton>Run</guibutton> button.
fr: Vous pouvez aussi utiliser <keycombo action="simul">&Alt; <keycap>F2</keycap></keycombo> pour ouvrir la boîte de dialogue « Lancer une commande », saisissez <userinput> <command>krusader</command> </userinput> (en minuscule) et appuyez sur &Enter; ou cliquez sur le bouton <guibutton>Lancer</guibutton>

source: Command-line options:
fr: Les options de la ligne de commande :

source: <option>--left</option> <replaceable> &lt;path&gt;</replaceable>
fr: <option>--left</option> <replaceable> &lt;emplacement&gt;</replaceable>

source: start left panel at &lt;path&gt;
fr: démarre le panneau gauche à &lt;l'emplacement&gt;

source: <option>--right</option> <replaceable> &lt;path&gt;</replaceable>
fr: <option>--right</option> <replaceable> &lt;emplacement&gt;</replaceable>

source: start right panel at &lt;path&gt;
fr: démarre le panneau droit à &lt;l'emplacement&gt;

source: <option>--left</option> <replaceable> &lt;path1&gt;,&lt;path2&gt;,&lt;path3&gt;</replaceable>
fr: <option>--left</option> <replaceable> &lt;emplacement1&gt;,&lt;emplacement2&gt;,&lt;emplacement3&gt;</replaceable>

source: start left panel at &lt;path1&gt;,&lt;path2&gt;,&lt;path3&gt;, with tabs.
fr: démarre le panneau gauche à &lt;emplacement1&gt;,&lt;emplacement2&gt;,&lt;emplacement3&gt;, avec des onglets

source: load a <link linkend="panel_profiles">panel-profile</link> on startup (this overrides the <link linkend="konfig-startup">default startup profile</link>).
fr: charge un <link linkend="panel_profiles">profil de panneau</link> au démarrage (cela écrase le <link linkend="konfig-startup">profil de démarrage par défaut</link>).

source: Examples:
fr: Exemples :

source: <prompt>$</prompt> <userinput><command>krusader</command> <replaceable>--left=&lt;path&gt; --right=&lt;path&gt;</replaceable></userinput>
fr: <prompt>$</prompt> <userinput><command>krusader</command> <replaceable>--left=&lt;emplacement&gt; --right=&lt;emplacement&gt;</replaceable></userinput>

source: <prompt>$</prompt> <userinput><command>krusader</command> <replaceable>--left=/mnt/cdrom --right=ftp://downloads@myserver.net</replaceable></userinput>
fr: <prompt>$</prompt> <userinput><command>krusader</command> <replaceable>--left=/mnt/cdrom --right=ftp://telechargements@monserveur.net</replaceable></userinput>

source: <prompt>$</prompt> <userinput><command>krusader</command> <replaceable>--left=&lt;path1&gt;,&lt;path2&gt; --right=&lt;path1&gt;,&lt;path2&gt;,&lt;path3&gt;</replaceable></userinput>
fr: <prompt>$</prompt> <userinput><command>krusader</command> <replaceable>--left=&lt;emplacement1&gt;,&lt;emplacement2&gt; --right=&lt;emplacement1&gt;,&lt;emplacement2&gt;,&lt;emplacement3&gt;</replaceable></userinput>

source: <prompt>$</prompt> <userinput><command>krusader</command><replaceable>--profile &lt;panel-profile&gt;</replaceable></userinput>
fr: <prompt>$</prompt> <userinput><command>krusader</command><replaceable>--profile &lt;profil-du-panneau&gt;</replaceable></userinput>

source: The standard &Qt; and &kde; command-line options are available, and can be listed by entering <userinput> <command>krusader</command> <option>--help</option> </userinput>.
fr: Les options standard de la ligne de commande &Qt; et &kde; sont disponibles, et peuvent être listées en saisissant <userinput> <command>krusader</command> <option>--help</option> </userinput>.

source: Other command-line options:
fr: Autres options de la ligne de commande :

source: List Qt-specific options
fr: Liste les options spécifiques à QT

source: List KDE-specific options
fr: Liste les options spécifiques à KDE

source: List all options
fr: Liste toutes les options

source: Show the authors names
fr: Affiche les noms des auteurs

source: Show the version number
fr: Affiche le numéro de version

source: Show license information
fr: Affiche les informations de licence

source: Configuring &krusader;
fr: Configurer &krusader;

source: Making &krusader; the default file manager
fr: Faire de &krusader; son gestionnaire de fichiers par défaut.

source: To make &krusader; the default file manager in Gnome, <ulink url="http://psychocats.net/ubuntu/nonautilusplease">click here</ulink> for more information.
fr: Pour faire de &krusader; son gestionnaire de fichiers par défaut dans Gnome, <ulink url="http://psychocats.net/ubuntu/nonautilusplease">cliquez ici</ulink> pour plus d'informations.

source: To make &krusader; the default file manager in &kde;, <ulink url="http://groups.google.com/group/krusader-devel/browse_thread/thread/8209d785d3ba0ac6">click here</ulink> for more information.
fr: Pour faire de &krusader; son gestionnaire de fichiers par défaut dans &kde;, <ulink url="http://groups.google.com/group/krusader-devel/browse_thread/thread/8209d785d3ba0ac6">cliquez ici</ulink> pour plus d'informations.
