Repository: CodeCollect/krusader
Catalog: doc/i18n/*/konfigurator.docbook.po
Languages: fr

source: Konfigurator: &krusader;'s Configuration Center
fr: Konfigurator : Centre de Configuration de &krusader;

source: Configure
fr: Configurer

source: Konfigurator is &krusader;s configuration center. When runnig &krusader;, use <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure &krusader;</guimenuitem> </menuchoice>, and it will start Konfigurator. There you can modify the way &krusader; works and customize it to your own needs. At any time, pressing the <guibutton>Apply</guibutton> button applies the changes, pressing <guibutton>Close</guibutton> closes Konfigurator, and pressing <guibutton>Defaults</guibutton> re-applies &krusader;'s "factory" settings. Konfigurator is divided into pages, each containing items related to that page. For some changes to the &GUI;, you have to close and restart &krusader;.
fr: Konfigurator est le centre de configuration de &krusader;. Quand &krusader; démarre, utilisez <menuchoice> <guimenu>Configuration</guimenu> <guimenuitem>Configurer &krusader;</guimenuitem> </menuchoice>, et Konfigurator démarrera. Vous pouvez modifier la manière dont &krusader; fonctionne et le personnaliser pour vos propres besoins. À chaque fois, appuyer sur le bouton <guibutton>Appliquer</guibutton> applique les modifications, appuyer sur le bouton <guibutton>Fermer</guibutton> ferme Konfigurator, et appuyer sur le bouton <guibutton>Par défaut</guibutton> ré-applique la configuration d'origine. Konfigurator est divisé en pages, chaque page contenant des éléments relatifs à cette page. Pour des modifications du &GUI;, vous devez fermer et redémarrer &krusader;.

source: Since &krusader;-1.80.0 the &keybindigs-lnk; and &main-toolbar-lnk;-&actions-toolbar-lnk; have reiceived their own configuration windows and so they are not a part anymore of Konfigurator, you can configure them now via the &settingsmenu-lnk;.
fr: Depuis &krusader;-1.80.0, la &keybindigs-lnk; et &main-toolbar-lnk;-&actions-toolbar-lnk; ont leur propre fenêtre de configuration et ne font plus parti de Konfigurator, vous pouvez maintenant les configurer via le &settingsmenu-lnk;.

source: Startup
fr: Démarrage

source: <title>Startup configuration</title>
fr: <title>Configuration du démarrage</title>

source: <phrase>Startup configuration</phrase>
fr: <phrase>Configuration du démarrage</phrase>

source: The startup page determines the way that &krusader; looks (and works) when it is launched. It is divided into two main parts:
fr: La page de démarrage détermine la manière dont &krusader; s'affiche (et fonctionne) quand il est lancé. Celle-ci est divisée en deux parties :

source: <guilabel>General</guilabel>
fr: <guilabel>Général</guilabel>

source: <guilabel>Startup Profile</guilabel>: Starts the selected <link linkend="panel_profiles">Panel profile</link> at startup. <guilabel>&lt;Last session&gt;</guilabel> is a special Panel Profile, it is saved automatically when closing &krusader;.
fr: <guilabel>Profil de démarrage</guilabel> : démarre le <link linkend="panel_profiles">profil du panneau</link> sélectionné au démarrage. La <guilabel>&lt;dernière session&gt;</guilabel> est un profil de panneau spécial, il est enregistré automatiquement à la fermeture de &krusader;.

source: <guilabel>Show splashscreen</guilabel>: Displays a splash screen when starting &krusader;.
fr: <guilabel>Afficher l'écran de démarrage</guilabel> : affiche un écran de démarrage au lancement de &krusader;.

source: <guilabel>Single Instance Mode</guilabel>: Allows only one &krusader; instance to run.
fr: <guilabel>Mode d'instance simple</guilabel> : permet à une seule instance de &krusader; de se lancer.

source: User Interface
fr: Interface utilisateur

source: Determines which parts of the user interface are visible after start-up.
fr: Détermine quelles parties sont visibles après les démarrage.

source: <guilabel>Save settings on exit</guilabel>: If checked, restores the user interface components to their condition when last shut-down.
fr: <guilabel>Enregistrer la configuration à la fermeture</guilabel> : si cochée, restaure les composants de l'interface utilisateur à leurs conditions de la dernière fermeture.

source: <guilabel>Show toolbar</guilabel>: If checked, &main-toolbar-lnk; is visible after startup.
fr: <guilabel>Afficher la barre d'outils</guilabel> : si cochée, la &main-toolbar-lnk; est visible après le démarrage.

source: <guilabel>Show statusbar</guilabel>: If checked, the &statusbar-lnk; is visible after start-up.
fr: <guilabel>Afficher la barre d'état</guilabel> : si cochée, la &statusbar-lnk; est visible après le démarrage.

source: <guilabel>Show function keys</guilabel>: If checked, the &fnkeybar-lnk; is visible after start-up.
fr: <guilabel>Afficher les touches de fonction</guilabel> : si cochée, la &fnkeybar-lnk; est visible après le démarrage.

source: <guilabel>Show command line</guilabel>: If checked, the &cmdline-lnk; is visible after start-up.
fr: <guilabel>Afficher la ligne de commande</guilabel> : si cochée, la &cmdline-lnk; est visible après le démarrage.

source: <guilabel>Show terminal emulator</guilabel>: If checked, the &termemu-lnk; is visible after start-up.
fr: <guilabel>Afficher l'émulateur de terminal</guilabel> : si cochée, l'&termemu-lnk; est visible après le démarrage.

source: <guilabel>Save last position, size and panel settings</guilabel>: When launched, &krusader; resizes itself to the size it was when last shut-down. &krusader; also appears in the same location on the screen, having panels sorted and aligned as they were. If this option is unchecked, you can use the menu <emphasis role="bold"> <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Save Position</guimenuitem> </menuchoice> </emphasis> option to manually set &krusader; size and position at start-up.
fr: <guilabel>Enregistrer la configuration de la dernière position, taille et panneau</guilabel> : au lancement, &krusader; se redimensionne à la taille qu'il avait à la dernière fermeture. &krusader; apparaît aussi au même emplacement sur l'écran, ses panneaux s'affichent et s'alignent où ils étaient. Si cette option n'est pas cochée, vous pouvez utiliser l'option du menu <emphasis role="bold"> <menuchoice> <guimenu>Configuration</guimenu> <guimenuitem>Enregistrer la configuration à la fermeture</guimenuitem> </menuchoice> </emphasis> pour régler manuellement la taille et la position de &krusader; au démarrage.

source: <guilabel>Start to tray</guilabel>: if checked, &krusader; starts to tray (if minimize to tray is set), without showing the main window.
fr: <guilabel>Démarrer minimiser dans la boîte à miniatures</guilabel> : si cochée, &krusader; démarre minimisé (si minimiser dans la boîte à miniature est défini), sans afficher la fenêtre principale.

source: Look and Feel
fr: Apparence &amp; Ergonomie

source: Here you can determine the look and feel of things - which means finetuning the application to your needs. The page is divided into four tabs: <guilabel>Operation</guilabel>, <guilabel>Panel</guilabel>, <guilabel>Panel Toolbar</guilabel> and <guilabel>Selection Mode</guilabel>:
fr: Vous pouvez déterminer ici l'apparence et l'ergonomie d'éléments - ce qui veut dire affiner l'application à vos besoins. la page est divisée en quatre onglets : <guilabel>Opération</guilabel>, <guilabel>Panneau</guilabel>, <guilabel>Barre d'outils du panneau</guilabel> et <guilabel>Mode de sélection</guilabel> :

source: Operation
fr: Opération

source: Look &amp; Feel
fr: Apparence &amp; Ergonomie

source: <guilabel>Warn on exit</guilabel>: If checked, &krusader; displays an "Are you sure?" warning when you try to shut it down; otherwise, it exits without protest.
fr: <guilabel>Avertir en sortant</guilabel> : si cochée, &krusader; affiche un avertissement « Voulez-vous vraiment ? » quand vous essayez de fermer le programme ; sinon, il se ferme sans protestation.

source: <guilabel>Minimize to tray</guilabel>: If checked, when you minimize &krusader;, its icon will appear in the system tray instead of the taskbar.
fr: <guilabel>Démarrage minimiser dans la boîte à miniatures</guilabel> : si cochée, quand vous réduisez &krusader;, son icône apparaîtra dans la boîte à miniatures à la place de la barre des tâches.

source: <guilabel>Autoselect Directories</guilabel>: When <link linkend="edit-menu">you select a group of files</link> (either by using Select Group or by using Select All), &krusader; checks this option. If checked, the directories matching the select criteria are also selected. Otherwise, only files are selected.
fr: <guilabel>Sélection automatique des dossiers</guilabel> : quand <link linkend="edit-menu">vous sélectionnez un groupe de fichiers</link> (soit en utilisant « Sélectionner le groupe » ou « Tout sélectionner »), &krusader; vérifie cette option, si cochée, les dossiers correspondants aux critères de sélection sont aussi sélectionnés. Sinon, seul les fichiers sont sélectionnés.

source: <guilabel>Rename selects extension</guilabel>: When <link linkend="renaming">you rename a file</link>, the whole text is selected. If you want total commanderlike renaming of just the name, without extension, deselect this item.
fr: <guilabel>Renommer les extensions sélectionnées</guilabel> : quand <link linkend="renaming">vous renommez un fichier</link>, le texte complet est sélectionné. Si vous voulez le comportement d'un Total Commander qui renomme juste le nom, sans l'extension, désélectionnez cette option.

source: <guilabel>Use fullpath tab names</guilabel>: If checked, display the full path in the &foldertabs-lnk;; otherwise only the last part of the path is displayed.
fr: <guilabel>Utiliser le nom complet de l'emplacement dans les onglets</guilabel> : si cochée, cela affiche l'emplacement complet dans les &foldertabs-lnk;. Sinon la dernière partie de l'emplacement est seulement affichée.

source: <guilabel>Fullscreen terminal (mc-style)</guilabel>: Terminal appears instead of the &krusader; window (full screen).
fr: <guilabel>Terminal en mode plein-écran (style mc)</guilabel> : le terminal apparaît à la place de la fenêtre de &krusader; (plein-écran).

source: Quicksearch
fr: Recherche rapide

source: <guilabel>New style Quicksearch</guilabel>: The new <link linkend="quicksearch">Quicksearch</link>feature is used.
fr: <guilabel>Nouveau type de recherche rapide</guilabel> : La nouvelle fonctionnalité de <link linkend="quicksearch">recherche rapide</link> est utilisée.

source: <guilabel>Case Sensitive Quicksearch</guilabel>: When you use the <link linkend="quicksearch">Quicksearch</link>feature: If checked (the &UNIX; default), all files beginning with capital letters appear before files beginning with lower case letters; otherwise, all files beginning with a specified letter (capital or otherwise) will be displayed together.
fr: <guilabel>Recherche rapide sensible à la casse</guilabel> : quand vous utilisez la fonctionnalité de <link linkend="quicksearch">recherche rapide</link>, si cochée (comportement par défaut sous &UNIX;), tous les fichiers commençant avec une lettre majuscule apparaissent avant les fichiers commençant avec des lettres en minuscule. Sinon, tous les fichiers commençant avec une lettre spécifiée (majuscule ou autre) seront affichés ensemble.

source: Panel
fr: Panneau

source: <guilabel>Panel font</guilabel>: Allows you to change the font used inside the file lists.
fr: <guilabel>Police du panneau</guilabel> : vous permet de modifier la police utilisée dans les listes de fichiers.

source: <guilabel>Filelist icon size</guilabel>: Allows you to change the size of the icons in the file lists. The available sizes are 16x16, 22x22, 32x32 and 48x48 pixels.
fr: <guilabel>Taille des icônes de la liste de fichiers</guilabel> : vous permet de modifier la taille des icônes dans les listes de fichiers. Les tailles disponibles sont 16x16, 22x22, 32x32 et 48x48 pixels.

source: <guilabel>Use icons in filenames</guilabel>: If checked, show the icons in file names and folders.
fr: <guilabel>Utiliser des icônes dans les fichiers</guilabel> : si cochée, afficher les icônes dans les noms de fichiers et dossiers.

source: <guilabel>Human readable file size</guilabel>: If checked, the file size appears in kB, Mb &etc;, and not in bytes (default).
fr: <guilabel>Utiliser une taille de fichier humainement lisible</guilabel> : si cochée, la taille du fichier apparaît en kB, Mb &etc;, et non en bytes (par défaut).

source: To configure the columns use the right click menu in the panel when viewing files. The left and right panel use their own columns independently. The following columns are available:
fr: Pour configurer les colonnes, faîtes un un clic-droit sur les menus dans le panneau quand les fichiers sont affichés. Le panneau gauche et droit utilisent leurs propres colonnes indépendemment. Les colonnes suivantes sont disponibles :

source: <guilabel>Name</guilabel>: Shows the filename without the part after the last dot, this latter part is displayed in the Ext column. When the Ext column is made hidden, the complete filename is shown in the Name column like e.g. &konqueror; does.
fr: <guilabel>Nom</guilabel> : affiche le nom de fichier sans l'extension, cette dernière est affichée dans la colonne « Ext. ». Quand la colonne « Ext. » est cachée, le nom de fichier complet est affiché dans la colonne « Nom » comme &pex; le fait &konqueror;.

source: <guilabel>Ext</guilabel>: Shows the last part of the filename (the part after the last dot) in the ext column, and not as a complete filename in the name column like e.g. &konqueror; does.
fr: <guilabel>Ext.</guilabel> : affiche la dernière partie du nom de fichier (la partie après le point) dans la colonne « Ext. », et non le nom de fichier complet dans la colonne « Nom » comme &pex; le fait &konqueror;.

source: <guilabel>Type</guilabel>: Shows the mime type field.
fr: <guilabel>Type</guilabel> : affiche le champ de type MIME.

source: <guilabel>Size</guilabel>: Shows the size field.
fr: <guilabel>Taille</guilabel> : affiche le champ de taille.

source: <guilabel>Modified</guilabel>: Shows the modified date and time field.
fr: <guilabel>Modifié</guilabel> : affiche le champ de date et heure modifiée.

source: <guilabel>Perms</guilabel>: Shows the full permissions &eg; "rwxr-xr-x" or as octal numbers '0755' instead with enable/disable <guilabel>Numeric Permissions</guilabel> in Look &amp; Feel <guilabel>Operation</guilabel> Tab.
fr: <guilabel>Permission</guilabel> : affiche les permissions complètes &pex; « rwxr-xr-x » ou comme des nombres octals « 0755 » à la place des <guilabel>permissions numériques</guilabel> dans l'onglet Apparence &amp; Ergonomie / <guilabel>Opération</guilabel>.

source: <guilabel>rwx</guilabel>: Shows only the rights of the current user &eg; "-rw".
fr: <guilabel>rwx</guilabel> : affiche seulement les droits de l'utilisateur courant &pex; « -rx ».

source: <guilabel>Owner</guilabel>: Shows the owner field.
fr: <guilabel>Propriétaire</guilabel> : affiche le champ de propriété.

source: <guilabel>Group</guilabel>: Shows the group field.
fr: <guilabel>Groupe</guilabel> : affiche le champ de groupe.

source: <guilabel>Show Hidden files</guilabel>: If checked, &krusader; displays the "dot-files" which are otherwise hidden.
fr: <guilabel>Afficher les fichiers cachés</guilabel> si cochée, &krusader; affiche les fichiers « avec un point » qui sont sinon cachés.

source: <guilabel>Numeric permissions</guilabel>: Permission column (Look &amp; Feel <guilabel>Panel</guilabel>Tab) shows octal numbers '0755' instead of 'rwxr-xr-x'.
fr: <guilabel>Permissions numériques</guilabel> : Colonne de permission (Apparence &amp; Ergonomie / onglet <guilabel>Panneaul</guilabel), affiche les numéros octals « 0755 » à la place de « rwxr-xr-x ».>

source: Sort method
fr: Méthode de trie

source: <guilabel>Krusader (default)</guilabel>: the comparison used so far. Uses comparison using locale rules (even context rules).
fr: <guilabel>Krusader (par défaut)</guilabel> : la comparaison utilisé plus loin. Utilise la comparaison avec les règles locales (ainsi que les règles contextuelles).

source: <guilabel>Alphabetical</guilabel>: strings are compared character by character (no context rules from locale applied). Alphabet characters are compared using locale rules, special characters are compared by the character code.
fr: <guilabel>Alphabétique</guilabel> : les entrées sont comparées caractère par caractère (pas de règles contextuelles depuis une locale appliquée). Les caractères alphabétiques sont comparés en utilisant les règles locales, les caractères spéciaux sont comparés par le code de caractère.

source: <guilabel>Alphabetical with numbers</guilabel>: the same as above, but if the names contains numbers, the numbers are compared numerically instead of alphabetically.
fr: <guilabel>Alphabétique avec des nombres</guilabel> : le même qu'au dessus, mais si les nom contiennent des nombres, les nombres sont comparés numériquement à la place d'alphabétiquement.

source: <guilabel>Character code</guilabel>: comparison by character code (quick).
fr: <guilabel>Code de caractère</guilabel> : comparaison par code de caractère (rapide).

source: <guilabel>Character code and numbers</guilabel>: the same as above, but with numerical comparison of numbers.
fr: <guilabel>Code de caractère et nombre</guilabel> : la même qu'au dessus, mais avec la comparaison numérique de nombres.

source: <guilabel>Case Sensitive Sorting</guilabel>: If checked (the &UNIX; default), all files beginning with capital letters appear before files beginning with non-capital letters; otherwise, all files beginning with a specified letter (capital or otherwise) appear together.
fr: <guilabel>Trie sensible à la casse</guilabel> : si cochée (comportement par défaut sous &UNIX;), tous les fichiers avec des lettres majuscules apparaissent avant les fichiers commençant avec des lettres minuscules ; sinon, tous les fichiers commençant avec une lettre spécifique (majuscule ou autre) apparaissent ensemble.

source: <guilabel>Always sort dirs by name</guilabel>: Sorts directories by name, regardless of the sort column.
fr: <guilabel>Toujours trier les dossiers par nom</guilabel> trie les dossiers par nom, sans tenir compte du trie par colonne.

source: Uncheck the columns not in use. This allows more space for columns in use.
fr: Décochez les colonnes non-utilisées. Ceci permet plus d'espace pour les colonnes affichées.

source: Panel Toolbar
fr: Barre d'outils du panneau

source: <guilabel>Panel Toolbar visible</guilabel>: If checked, &krusader; displays the Panel Toolbar.
fr: <guilabel>Afficher la barre d'outils pour le panneau</guilabel> : si cochée, &krusader; affiche la barre d'outils du panneau.

source: You can make the buttons on the <guilabel>Panel Toolbar</guilabel> visible or hidden:
fr: Vous pouvez afficher ou cacher les boutons sur la <guilabel>barre d'outils du panneau</guilabel> :

source: <guilabel>Clear Location Toolbar</guilabel> button: Clears the &location-toolbar-lnk;
fr: Bouton <guilabel>d'effacement de l'emplacement de la barre d'outils</guilabel> : efface la &location-toolbar-lnk;.

source: <guilabel>Open</guilabel> button
fr: Bouton<guilabel>ouvrir</guilabel>

source: <guilabel>Equal (=)</guilabel> button
fr: Bouton <guilabel>égal (=)</guilabel>

source: <guilabel>Up (..)</guilabel> button
fr: Bouton <guilabel>haut (..)</guilabel>

source: <guilabel>Home (~)</guilabel> button
fr: Bouton <guilabel>dossier personnel (~)</guilabel>

source: <guilabel>Root (/)</guilabel> button
fr: Bouton <guilabel>racine (/)</guilabel>

source: <guilabel>Toggle-button for sync-browsing</guilabel>: If checked, shows the &sync-browsing-lnk; button.
fr: <guilabel>Bouton bacule pour la naviguation synchronisée</guilabel> : si cochée, affiche le bouton &sync-browsing-lnk;.

source: Selection Mode
fr: Mode de sélection

source: Here you can configure the selection modes.
fr: Vous pouvez configurer ici les modes de sélection.

source: <guilabel>&krusader; Mode</guilabel>: The way &krusader; has worked from day one. Both mouse keys allow selecting files. To select more than one file, hold the &Ctrl; key and click the &LMB;. Right-click menu appears with a short click on the &RMB;.
fr: <guilabel>Mode &krusader;</guilabel> : la façon dont &krusader; fonctionne depuis le premier jour. Les boutons de la souris permettent de sélectionner des fichiers. Pour sélectionner plus d'un fichier, pressez la touche &Ctrl; et un clic &LMB;. Le menu par clic-droit apparaît avec un bref clic sur le &RMB;.

source: <guilabel>Konqueror Mode</guilabel>: pressing the &LMB; selects files -- you can click and select multiple files. Right-click menu appears with a short click on the &RMB;.
fr: <guilabel>Mode Konqueror</guilabel> : appuyer sur le &LMB; sélectionne les fichiers, vous pouvez cliquer et sélectionner plusieurs fichiers. Le menu par clic-droit apparaît avec un bref clic sur le &RMB;.

source: <guilabel>Total commander Mode</guilabel>: Pressing the &RMB; selects multiple files and the right-click menu appears with <guilabel>pressing and holding</guilabel> the &RMB; The &LMB; does not select, but sets the current file without affecting the current selection.
fr: <guilabel>Mode Total commander</guilabel> : appuyer sur le &RMB; sélectionne plusieurs fichiers et le menu par clic-droit apparaît en <guilabel>appuyant sur</guilabel> le &RMB;. Le &LMB; ne sélectionne pas mais définit le fichier courant sans affecter la sélection courante.

source: <guilabel>Ergonmic Mode</guilabel>: The &LMB; does not select, but sets the current file without affecting the current selection. The &RMB; invokes the context-menu. You can select with Ctrl key and the left button.
fr: <guilabel>Mode ergonomique</guilabel> : le &LMB; ne sélectionne pas mais définit le fichier courant sans affecter la sélection courante. Le &RMB; invoque le menu contextuel. Vous pouvez sélectionner avec la touche Ctrl et le bouton gauche.

source: <guilabel>Custom Selection Mode</guilabel>: Create your own selection style!
fr: <guilabel>Mode de sélection personnalisé</guilabel> : créer votre propre style de sélection !

source: Details
fr: Détails

source: <guilabel>Double-click selects (classic)</guilabel>: A single click on a file will select and focus, a double click opens the file or steps into the directory.
fr: <guilabel>Sélection par double-clic (normal)</guilabel> : un simple clic sur un fichier le sélectionne et lui donne le focus, un double-clic ouvre le fichier ou navigue dans un dossier.

source: <guilabel>Obey KDE global selection policy</guilabel>: Pressing the &LMB; selects files -- Use &kde;'s global setting: &kde; Control Center -&gt; Peripherals -&gt; Mouse.
fr: <guilabel>Sélection conforme à KDE</guilabel> : appuyer sur &LMB; sélectionne les fichiers. Utilise la configuration globale de &kde; : Centre de Contrôle de KDE / Clavier &Souris / Souris.

source: Custom Selection Mode items:
fr: Personnaliser les éléments du mode de sélection :

source: Based on KDE's selection mode
fr: Fondé sur le mode de sélection natif de KDE

source: Left mouse button selects
fr: Sélection par le bouton gauche de la souris

source: Left mouse button preserves selection
fr: Sélection préservée par le bouton gauche de la souris

source: Shift/Ctrl-Left mouse button selects
fr: Sélection par &Maj;/&Ctrl; + bouton gauche de la souris

source: Right mouse button selects
fr: Sélection par le bouton droit de la souris

source: Right mouse button preserves selection
fr: Sélection préservée par le bouton droit de la souris

source: Shift/Ctrl-Right mouse button selects
fr: Sélection par &Maj;/&Ctrl; + bouton droit de la souris

source: Space bar moves down
fr: La barre d'espace déplace vers le bas

source: Space bar calculates diskspace
fr: La barre d'espace calcule l'espace disque

source: Insert moves down
fr: La touche « Inser » déplace vers le bas
