Repository: CodeCollect/krusader
Catalog: doc/i18n/*/konfigurator.docbook.po
Languages: fr

source: Right-clicking shows the context menu immediately
fr: Le clic-droit fait apparaître un menu contextuel

source: <title>Colors</title>
fr: <title>Couleurs</title>

source: This page configures the colors of the &list-panel-lnk; and the &synchronizer-lnk;. The <guilabel>KDE default colors</guilabel> is the default color configuration.
fr: Cette page configure les couleurs de la &list-panel-lnk; et le &synchronizer-lnk;. Les <guilabel>couleurs par défaut de KDE</guilabel> est la configuration par défaut.

source: <guilabel>Use the default KDE colors</guilabel>: this is the default, it uses &kde; color settings of <command>kcontrol</command>.
fr: <guilabel>Utiliser les couleurs de KDE par défaut</guilabel> : comportement par défaut qui utilise la configuration de couleur de &kde; de <command>kcontrol</command>.

source: <guilabel>Use Alternate Background color</guilabel>: If checked, the <guilabel>Background</guilabel> color and the <guilabel>Alternate background</guilabel> color alternates line by line. When you do not use the &kde; default colors, you can configure the alternate colors in the <guilabel>Colors</guilabel> box.
fr: <guilabel>Utiliser une autre couleur pour le fond</guilabel> : si cochée, deux couleurs sont alternées ligne par ligne. si vous n'utilisez pas les couleurs par défaut de &kde;, vous pouvez configurer les couleurs alternées dans la boîte de dialogue <guilabel>Couleurs</guilabel>.

source: <guilabel>Show current item even if not focused</guilabel>: If checked, shows the last cursor position in the non active list panel. This option is only available when you do not use the &kde; default colors.
fr: <guilabel>Afficher l'élément courant même si il n'a pas le focus</guilabel> : si cochée, la dernière position du curseur reste active dans la liste du panneau inactif. Cette option est seulement disponible quand vous n'utilisez pas les couleurs par défaut de &kde;.

source: <guilabel>Dim the colors of the inactive panel</guilabel>: If checked, the colors of the inactive panel are dimmed. These settings can be configured in the <guilabel>Inactive</guilabel> tab of the <guilabel>Colors</guilabel> box. This option is only available when you do not use the &kde; default colors.
fr: <guilabel>Adoucir les couleurs du panneau inactif</guilabel> : si cochée, les couleurs du panneau inactif sont adouçies. Ces paramètres peuvent être configurés dans l'onglet <guilabel>Inactif</guilabel> de la boîte de dialogue <guilabel>Couleurs</guilabel>. Cette option est seulement disponible si vous n'utilisez pas les couleurs par défaut de &kde;.

source: <guilabel>Colors</guilabel>
fr: <guilabel>Couleurs</guilabel>

source: Configure the colors the way you like, you can see the result in the <guilabel>Preview</guilabel> section. The following items of the active and inactive panel can be configured:
fr: Configurer les couleurs de la façon dont vous le souhaitez. Vous pouvez voir le résultat dans la section <guilabel>Aperçu</guilabel>. Les éléments suivants du panneau actif et inactif peuvent être configurés :

source: Foreground
fr: Couleur du texte

source: Directory foreground
fr: Texte du dossier

source: Executable foreground
fr: Texte de l'exécutable

source: Symbolic link foreground
fr: Texte du lien sym.

source: Invalid symlink foreground
fr: Texte du lien sym. cassé

source: Background
fr: Couleur de fond

source: Alternate background
fr: Deuxième fond

source: Selected foreground
fr: Texte de la sélection

source: Selected background
fr: Fond de la sélection

source: Alternate selected background
fr: Deuxième fond de la sélection

source: Current foreground
fr: Texte courant

source: Selected current foreground
fr: Texte courant sélectionné

source: Current background
fr: Couleur de fond courant

source: The following items of the &synchronizer-lnk; can be configured:
fr: Les éléments suivants du &synchronizer-lnk; peuvent être configurés :

source: Equals foreground
fr: Texte identique

source: Equals background
fr: Fond identique

source: Differing foreground
fr: Texte du fichier différent

source: Differing background
fr: Fond du fichier différent

source: Copy to left foreground
fr: Texte de gauche copier vers

source: Copy to left background
fr: Fond de droite copier vers

source: Copy to right foreground
fr: Texte de droite copier vers

source: Delete foreground
fr: Texte pour suppression

source: Delete background
fr: Fond pour suppression

source: Preview
fr: Aperçu

source: Here you see a preview of the configured colors.
fr: Vous voyez ici un aperçu des couleurs configurées.

source: Color schemes
fr: Schémas de couleurs

source: With the <guibutton>Import Color Scheme</guibutton> and <guibutton>Export Color Scheme</guibutton> buttons you can load and save a Color Scheme profile. This allows &krusader; to use &tcmd;, &mc;, foo-commander or your own custom color profile. The Color Schemes are stored in <filename>$KDEDIR/share/apps/krusader</filename>, the <filename>foo.color</filename> is a binary file that holds the color scheme.
fr: Avec les boutons <guibutton>Importer un schéma de couleur</guibutton> et <guibutton>Exporter un schéma de couleur</guibutton>, vous pouvez charger et enregistrer un profil de schéma de couleur. Cela permet à &krusader; d'utiliser un profil &tcmd;, &mc;, toto-commander ou vos profils de couleurs personnalisés. Les schémas de couleurs sont stockés dans <filename>$KDEDIR/share/apps/krusader</filename>, <filename>toto.color</filename> est un fichier binaire qui contient le schéma de couleur.

source: &mc; and &tcmd; Color scheme files are provided. Please <link linkend="help_krusader">upload your favorite Color schemes</link> so that they become available for the &krusader; community. Thanks!
fr: Les fichiers de schéma de couleurs &mc; et &tcmd; sont fournis. Veuillez <link linkend="help_krusader">envoyer vos schémas de couleurs favoris</link> pour être disponibles à la communauté &krusader;. Merci !

source: <title>General</title>
fr: <title>Général</title>

source: Here you configure the basic operations.
fr: Vous configurez ici les opérations de base.

source: The following options determine basic aspects of operation:
fr: Les options suivantes détermine les aspects basiques de l'opération :

source: <guilabel>Delete files/Move to trash</guilabel>: when &krusader; deletes files it can either 'really' delete them or move them to the trash folder, thereby making them available via &kde;'s trash.
fr: <guilabel>Supprimer / déplacer les fichiers vers la corbeille</guilabel> : quand &krusader; supprime des fichiers, il peut soit « vraiment » les supprimer ou les déplacer vers la corbeille, ainsi ls rendre disponibles via la corbeille de &kde;.

source: <guilabel>Use mimetype magic</guilabel>: mime type magic is a mechanism which allows &krusader; to inspect the files in the panels and determine their type even if the file has no identifying extension. For example, if you take an image file - 'image1.jpg' - and rename it to 'image1', &krusader; will still know it's an image file and work with it accordingly. However, this mode of operation is slower (while refreshing the panel, or changing directories), so try &krusader; with and without mime type magic and decide what is best for you.
fr: <guilabel>Utiliser le mode « Type de MIME magique »</guilabel> : le type de MIME magique est un mécanisme qui permet à &krusader; d'inspecter les fichiers dans les panneaux et déterminer leurs types même si le fichier n'a pas d'extension d'indentification. Par exemple, si vous prenez une image - image1.jpg - et la renommer en « image1 », &krusader; sera toujours que c'est une image et travaillera avec en conséquence. Cependant, ce mode d'opération est lent (pendant le rafraîchissement du panneau ou la navigation dans un dossier), essayez donc &krusader; avec et sans type de MIME magique et décidez ce qui est le mieux pour vous.

source: <guilabel>Editor</guilabel>: choose what editor will be used when editing a file (via F4).
fr: <guilabel>Éditeur</guilabel> : choisir quel éditeur sera utilisé quand un fichier sera édité avec la touche F4.

source: <guilabel>Default viewer mode</guilabel>: either generic, text or hex mode.
fr: <guilabel>Mode d'affichage par défaut</guilabel> : soit générique, texte ou mode hexadécimal.

source: <guilabel>Viewer opens each file in a separate window</guilabel>: you can use the browsing tabs for navigation.
fr: <guilabel>L'afficheur et l'éditeur interne ouvre chaque fichier dans une fenêtre séparée</guilabel> : vous pouvez utiliser les onglets pour la navigation.

source: <guilabel>Atomic extensions</guilabel>: predefined atomic extensions like <filename>tar.gz</filename> are shown as one part in the <guilabel>Ext Column</guilabel> of the &list-panel-lnk;.
fr: <guilabel>Extensions atomiques</guilabel> : les extensions atomiques pré-définies comme <filename>tar.gz</filename> sont affichées comme un élément dans une <guilabel>colonne Ext.</guilabel> de la &list-panel-lnk;.

source: <guilabel>Terminal</guilabel>: choose which terminal emulator will be used when &krusader; opens a console window (via F2, or Commands-&gt;Terminal menu option).
fr: <guilabel>Terminal</guilabel> : choisir quel émulateur de terminal sera utilisé quand &krusader; ouvre une fenêtre de terminal (avec la touche F2 ou dans le menu option : Outils / Lancer un terminal).

source: <guilabel>Terminal Emulator sends Chdir on a panel change</guilabel>: if unchecked, there will be no <command>cd</command> command sent to the Terminal Emulator if the panel folder changes.
fr: <guilabel>L'émulateur de terminal envoie « Chdir » en cas de modification dans le panneau</guilabel> : si non cochée, il n'y aura pas de commande <command>cd</command> envoyée à l'émulateur de terminal si le dossier du panneau change.

source: <guilabel>Temp Directory</guilabel>: this option selects the base directory for &krusader;'s temporary files. The actual files will be created in separate directories under the 'Temp directory', so that each user running &krusader; will have their own temporary subdirectories under the chosen directory.
fr: <guilabel>Dossier temporaire</guilabel> : cette option sélectionne le dossier de base pour les fichiers temporaires de &krusader;. Les fichiers actuels seront créés dans des dossiers séparés dans le dossier temporaire, pour que chaque utilisateur lançant &krusader; auront leur propre sous-dossiers temporaires dans le dossier choisi.

source: You must choose a temporary directory to which all users running &krusader; have full permissions!
fr: Vous devez choisir un dossier temporaire sur lequel tous les utilisateurs lançant &krusader; ont toutes les permissions !

source: Advanced
fr: Avancé

source: This page handles more advanced issues, so you should double-check your actions here: modifying settings here
fr: Cette page parle de questions plus avancées, vous devez donc ici vérifier doublement vos actions, les paramètres modifiés.

source: makes &krusader; a more powerful AND dangerous tool.
fr: Faire de &krusader; un outil plus puissant ET dangereux.

source: The page is divided into three parts:
fr: Cette page est divisée en trois parties :

source: <guilabel>Preserve attributes for local copy/move (slower)</guilabel>: If checked, &krusader; will try to preserve all attributes (time, owner, group) of the local files according to the source file depending on your <link linkend="copying">permissions</link>.
fr: <guilabel>Préserver les attributs pour la copie/déplacement locale (plus lent)</guilabel> : si cochée, &krusader; essaiera de préserver tous les attributs (heure, propriétaire, groupe) des fichiers locaux conformément au fichier source suivant vos <link linkend="copying">permissions</link>.

source: <guilabel>Automount filesystems</guilabel>: this makes &krusader; try to mount a file system before entering it. For example, if you click on <filename class="directory">/mnt/cdrom</filename> (and <filename class="directory"> /mnt/cdrom</filename> appears in <filename class="directory">/etc/fstab</filename> as a mount point), &krusader; will check if it is mounted. If not, it will try and mount it for you and then enter, so that you would see the contents of your cdrom. Note, however, that &krusader; will NOT unmount when exiting <filename class="directory"> /mnt/cdrom</filename>.
fr: <guilabel>Monter les systèmes de fichiers automatiquement</guilabel> : &krusader; va essayer de monter un système de fichier avant de pouvoir y naviguer. Par exemple, si vous cliquez sur <filename class="directory">/mnt/cdrom</filename> (et <filename class="directory"> /mnt/cdrom</filename> apparaît dans <filename class="directory">/etc/fstab</filename> comme un point de montage), &krusader; vérifiera s'il est monté. Si non, &krusader va tenter de le monter pour vous, et ensuite y naviguer, afin de pouvoir voir le contenu de votre CDROM. Remarquez, cependant, que &krusader; ne libérera PAS au moment de quitter <filename class="directory"> /mnt/cdrom</filename>.

source: <guilabel>MountMan will not (un)mount the following mount points</guilabel>: If you have file systems that you do not want to accidentally unmount (or mount) then enter a list of mount points separated by commas (&eg; <literal>/, /boot, /tmp</literal>) and &mountman-lnk; will not try to (un)mount them.
fr: <guilabel>MountMan ne démontera pas les points de montage suivants</guilabel> : si vous avez des systèmes de fichiers que vous ne voulez pas accidentellement libérer (ou monter), saisissez une liste de points de montage séparée par une virgule (&pex; <literal>/, /boot, /tmp</literal>) et &mountman-lnk; n'essaiera pas de les monter ou les libérer.

source: By checking the options in this section, &krusader; will ask for confirmation before doing a specific action; otherwise, the following actions will be done without warning:
fr: En vérifiant les options de cette section, &krusader; demandera une confirmation avant de réaliser l'action spécifiée. Sinon, les actions suivantes seront effectuées sans avertissement :

source: deleting non empty directorie(s)
fr: Effacement de dossier(s) non vide(s)

source: deleting file(s)
fr: Effacement de fichiers

source: copying file(s)
fr: Copie de fichiers

source: moving file(s)
fr: Déplacement de fichiers

source: Fine-Tuning
fr: Envoi à la liste

source: <guilabel>Icon Cache Size</guilabel>: &krusader; uses an icon cache, so it will not have to reload icons that have been used before. Of course, as the cache grows bigger, it can store more icons and further speed operations, but the memory footprint of &krusader; will become bigger.
fr: <guilabel>Taille du cache d'icônes (Kb)</guilabel> : &krusader; utilise un cache d'icônes pour ne pas avoir à recharger les icônes qui ont été déjà utilisés avant. Bien sûr, comme le cache devient plus gros, il peut sotquer plus d'icônes et des opération plus rapides, mais l'encombrement de la mémoire de &krusader; deviendra plus grande.

source: <guilabel>Arguments of updatedb</guilabel>: sets additional arguments for <command>updatedb</command>, please read the manpages for more information.
fr: <guilabel>Arguments de updatedb</guilabel> : définit des arguments additionnels pour <command>updatedb</command>, veuillez lire les pages du manuel pour plus d'informations.

source: This page handles the way &krusader; works with archives. In the <guilabel>General</guilabel> section you will see a list of archive formats. Some are checked and some are grayed-out. The ones that are available (not grayed-out) are supported by &krusader;. If you check them, &krusader; will handle the archives transparently and let you open them as folders; otherwise, &krusader; will attempt to invoke an application which opens archives of that type. If a certain archive is grayed-out, it means that &krusader; could not find the appropriate executables in the configured path. The next archives are supported: ace, arj, bzip2, deb, gzip, iso, lha, rar, rpm, tar, zip and 7-zip.
fr: Cette page décrit la façon dont &krusader; fonctionne avec les archives. Dans la section <guilabel>Général</guilabel> vous verrez une liste de formats d'archives. Certaines sont actives et d'autres sont grisées. Celles qui sont disponibles (non grisées) sont gérées par &krusader;. Si vous les vérifiez, &krusader; prendra en charge les archives de manière transparente, et vous laissera les ouvrir comme des dossiers. Sinon, &krusader; tentera de lancer une application qui ouvre ce type d'archives. Si une archive est grisée, cela veut dire que &krusader; ne peut pas trouver l'exécutable approprié dans l'emplacement configuré. Les archives suivantes sont gérées : ace, arj, bzip2, deb, gzip, iso, lha, rar, rpm, tar, zip et 7-zip.

source: If you have installed a certain archive application (let's say <command>arj</command>) and want &krusader; to know about it, just click the <guibutton>Auto Configure</guibutton> button. &krusader; will search for all supported executables and print a report listing the archive formats that can be handled. If the operation was successful the new archive should be available and checked.
fr: Si vous avez installé une application d'archive d'un certain type (par exemple <command>arj</command>) et que &krusader; veut se mettre à jour, cliquez sur le bouton <guibutton>Configuration automatique</guibutton>. &krusader; cherchera tous les exécutables gérés et affichera un rapport des formats d'archives qui peuvent être gérés. Si l'opération a été couronné de succès, la nouvelle archive doit être disponible et active.

source: Please install new packagers to your <envar>PATH</envar> (&ie;: <filename>/usr/bin</filename> or <filename>/usr/local/bin</filename> &etc;)
fr: Veuillez installer des nouveaux archiveurs dans votre <envar>PATH</envar> (&cad; <filename>/usr/bin</filename> ou <filename>/usr/local/bin</filename> &etc;)

source: The full path of the packagers is stored in the &konfigdependencie-lnk; (&eg; to handle ZIP archives, &krusader; needs the <command>unzip</command> and <command>zip</command> executables). It is possible that you need to manually configure the mimes to the protocols in the &konfigprotocol-lnk;.
fr: L'empolacement complet des archiverus est stocké dans le &konfigdependencie-lnk; (&pex; pour prendre en charge des archives ZIP, &krusader; a besoin des exécutables <command>unzip</command> et <command>zip</command>. Il est possible que vous ayez besoin de configurer manuellement les types de MIME aux protocoles dans le &konfigprotocol-lnk;.

source: Dependencies page
fr: Page de dépendances

source: This page configures the full path of the external applications. It is even possible to configure the full path of &krusader;!
fr: Cette page configure l'emplacement complet des applications externes. Il est même possible de configurer l'emplacement complet de &krusader; !

source: General tab
fr: Onglet Général

source: Here you can configure the full path of the following external applications:
fr: Vous pouvez configurer ici l'emplacement complet des applications externes suivantes :

source: configurable full path
fr: emplacement complet configurable

source: diff utility
fr: utilitaire de comparaison

source: By default &kompare; (part of the kdebase package) is used as external diff utility but you can also use your favorite diff utility &eg; &xxdiff-url; or &kdiff3-url;, just fill in the full path and enjoy.
fr: Par défaut, &kompare; (un élément du paquetage kdebase) est utilisé comme utilitaire de comparaison externe mais vous pouvez aussi utiliser votre utilitaire de comparaison favori &pex; &xxdiff-url; ou &kdiff3-url;, remplissez simplement l'emplacement complet et profitez.

source: Packers tab
fr: Onglet des archiveurs

source: Here you can configure the full path of the following external packers. &krusader; also offers an <link linkend="konfig-archives">auto configure tool</link> for packagers.
fr: Vous pouvez configurer ici l'emplacement compmet des archiveurs externes suivants. &krusader; offre aussi un <link linkend="konfig-archives">outil de configuration automatique</link> pour les archiveurs.

source: &krusader; may not be compatible with ACE despite our best efforts. Unace uses closed source and contains additional lines that make Unace get into infinite loop if the stdin is redirected to somewhere else. It works in the same manner as 'su', where you cannot enter the password only from the stdin. &krusader; &gt;= 1-51 emulates the command line environment to enable co-operation with Unace, but we have noticed that Unace always changes its output format from release to release, making co-operation almost impossible.
fr: &krusader; ne doit pas être compatible avec ACE malgré nos meilleurs efforts. Unace utilise des sources fermées et contient des lignes additionnelles qui font fonctionne Unace dans une boucle infinie si l'entrée stdin est redirigée quelque part. Cela fonctionne de la même manière que « su », où vous pouvez saisir seulement le mot de passe depuis l'entrée stdin. &krusader; &gt;= 1-51 émule un environnement de ligne de commande pour activer la coopération avec Unace, mais nous avons remarqué qu'Unace modifie toujours son format de sortie de version en version, rendant la coopération presque impossible.

source: Checksum Utilities tab
fr: L'onglet d'utilitaire de somme de contrôle

source: Here you can configure the full path of the following external <link linkend="checksum">Checksum Utilities</link>:
fr: Vous pouvez configurer ici l'emplacement complet des <link linkend="checksum">utilitaires de somme de contrôle</link> externes suivants :

source: Checksum Utilities
fr: Utilitaires de somme de contrôle

source: UserActions
fr: Actions utilisateur

source: Here you can configure the terminal for UserActions and the font for the output-collection. The default terminal is <filename>konsole --noclose -e</filename>. To set up, configure and manage your UserActions use ActionMan (&useractions-lnk; url).
fr: Vous pouvez configurer ici le terminal pour les actions utilisateur et la police pour l'affichage de sortie. Le terminal par défaut est <filename>konsole --noclose -e</filename>. Pour le configurer, ActionMan est utilisé (&useractions-lnk; url).

source: Protocols
fr: Protocoles

source: This page links the mimes to protocols. &eg; protocol "tar" is linked to mime "application/x-tar".
fr: Cette page lie les types MIMES aux protocoles. &pex; le protocole « tar » est lié au type MIME « application/x-tar ».

source: In the <guilabel>Defined Links</guilabel>you will see &eg;
fr: Dans les <guilabel>liens définis</guilabel> vous verrez &pex;
