Repository: CodeCollect/krusader
Catalog: doc/i18n/*/locate.docbook.po
Languages: fr

source: Locate &GUI; Frontend
fr: Interface graphique pour locate

source: Checkbox Options
fr: Options des cases à cocher

source: <guilabel>Show only the existing files</guilabel>: if the database contains entries which no longer exist any more (deleted, moved since the last <command>updatedb</command>), <command>locate</command> does not list them. It checks the existence of each file before the listing in the results window (slow).
fr: <guilabel>Afficher seulement les fichiers existants</guilabel> : si la base de données contient des entrées qui n'existent plus du tout (supprimées, déplacées depuis la dernière <command>updatedb</command>), <command>locate</command> ne va pas les lister. Le programme vérifie l'existence de chaque fichier avant de les lister dans la fenêtre de résultats (lent).

source: <guilabel>Case Sensitive</guilabel>: unchecking it allows lower and upper case search.
fr: <guilabel>Sensible à la casse</guilabel> : si non cochée, cela permet la recherche en minuscule et majuscule.

source: Action buttons
fr: Boutons d'actions

source: <guibutton>Locate</guibutton>: executes <command>locate <replaceable>foo foo</replaceable></command> and places its output into the results window.
fr: <guibutton>Localiser</guibutton> : exécute <command>locate <replaceable>toto toto</replaceable></command> et place le résultat dans la fenêtre de résultats.

source: <guibutton>Stop</guibutton>: stops the locating process.
fr: <guibutton>Arrêter</guibutton> : termine le processus de localisation.

source: <guibutton>UpdateDB</guibutton>: starts <command>updatedb</command> for updating the locate database after entering the root password.
fr: <guibutton>Mise à jour de la DB</guibutton> : démarre <command>updatedb</command> pour la mise à jour de la base de données locale après avoir saisi le mot de passe superutilisateur.

source: <guibutton>Close</guibutton>: closes the locate window.
fr: <guibutton>Fermer</guibutton : ferme la fenêtre locale.

source: Results window
fr: Fenêtre de résultats

source: Double-click on an item: steps to its directory, makes the item visible and closes the locate dialog.
fr: Double-cliquer sur un élément : se rend dans ce dossier, affiche l'élément et ferme la boîte de dialogue de localisation.

source: Right click: edits/views/finds the menu.
fr: Clic-droit : édite, affiche et recherche le menu.

source: <keycap>F3</keycap>: views the current item.
fr: <keycap>F3</keycap> : affiche l'élément courant.

source: <keycap>F4</keycap>: edits the current item.
fr: <keycap>F4</keycap> : édite l'élément courant.

source: <keycombo action="simul">&Ctrl; <keycap>f</keycap></keycombo>: finds files in the results window.
fr: <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> : recherche les fichiers dans la fenêtre de résultats.

source: <keycombo action="simul">&Ctrl; <keycap>n</keycap></keycombo>: shows the next search result.
fr: <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> : affiche les résultats suivants.

source: <keycombo action="simul">&Ctrl; <keycap>p</keycap></keycombo>: shows the previous search result.
fr: <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> : affiche les résultats précédents.

source: The results window supports dragging items to other windows and copy to clipboard (<keycombo action="simul">&Ctrl;<keycap>c</keycap></keycombo>).
fr: La fenêtre de résultats gère les éléments par glissement vers d'autres fenêtres et copie dans le presse-papiers (<keycombo action="simul">&Ctrl;<keycap>C</keycap></keycombo>).
