Repository: CodeCollect/krusader
Catalog: doc/i18n/*/menu-commands.docbook.po
Languages: fr

source: Menu Commands
fr: Commandes du menu

source: Commands
fr: Commandes

source: File Menu
fr: Le menu <guimenu>Fichier</guimenu>

source: Creates a new text file in the current directory, unless another directory is specified. The new file is opened for editing after it is created.
fr: Crée un nouveau fichier texte dans le dossier courant, à moins qu'un autre dossier est spécifié. Le nouveau fichier est ouvert à l'édition après sa création.

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Directory</guimenuitem>
fr: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Nouveau dossier</guimenuitem>

source: Creates a new directory in the current directory.
fr: Crée un nouveau dossier dans le dossier courant.

source: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>New Symlink</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Nouveau lien symbolique</guimenuitem>

source: Creates a symbolic link to the currently selected file.
fr: Crée un nouveau lien symbolique vers le fichier courant sélectionné.

source: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>View File</guimenuitem>
fr: <shortcut> <keycap>F3</keycap> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Afficher le fichier</guimenuitem>

source: Opens the currently selected file for <link linkend="kredit">viewing</link>.
fr: Ouvre le fichier courant sélectionné pour pouvoir <link linkend="kredit">l'afficher</link>.

source: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Edit File</guimenuitem>
fr: <shortcut> <keycap>F4</keycap> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Éditer le fichier</guimenuitem>

source: Opens the currently selected file for <link linkend="kredit">editing</link>.
fr: Ouvre le fichier courant sélectionner pour pouvoir <link linkend="kredit">l'éditer</link>.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Copy</guimenuitem>
fr: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Copier</guimenuitem>

source: Opens a dialog to <link linkend="copying">copy</link> the currently selected files or directories to a specified location.
fr: Ouvre une boîte de dialogue pour <link linkend="copying">copier</link> les fichiers ou les dossiers courants sélectionnés vers un emplacement spécifié.

source: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Move</guimenuitem>
fr: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Déplacer</guimenuitem>

source: Opens a dialog to <link linkend="copying">move</link> the currently selected files or directories to a specified location.
fr: Ouvre une boîte de dialogue pour <link linkend="copying">déplacer</link> les fichiers ou les dossiers courants sélectionnés vers un emplacement spécifié.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Pack</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>P</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Compresser</guimenuitem>

source: Creates a <link linkend="pack-archive">new archive</link> of all the selected files and directories in the active panel.
fr: Crée une <link linkend="pack-archive">nouvelle archive</link> de tous les fichiers et dossiers sélectionnés dans le panneau actif.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>U</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Unpack</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Décompresser</guimenuitem>

source: <link linkend="unpacking-archives">Unpacks</link> all the selected files in the active panel.
fr: <link linkend="unpacking-archives">Décompresse</link> tous les fichiers sélectionnés dans le panneau actif.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>E</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Test Archive</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>E</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Tester l'archive</guimenuitem>

source: <link linkend="test-archive">Tests archive</link> for corruption.
fr: <link linkend="test-archive">Tests l'archive</link> à la recherche de corruptions.

source: <guimenu>File</guimenu> <guimenuitem>Compare by content</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Comparer par contenus...</guimenuitem>

source: Krename Features
fr: Fonctionnalités de Krename

source: Renaming a list of files based on a set of expressions
fr: Renommer une liste de fichiers fondé sur une règle d'expressions

source: Copying/moving a list of files to another directory
fr: Copier ou déplacer une liste de fichiers vers un autre dossier

source: Convert filenames to upper/lower case
fr: Convertir des noms de fichiers en minuscules ou majuscules

source: Adding numbers to filenames
fr: Ajouter des numéros aux noms de fichiers

source: Finding and replacing parts of the filename
fr: Trouver remplacer des parties du nom de fichier

source: Renaming MP3/OGG Vorbis files based on their ID3 tags
fr: Renommer des fichiers MP3 / Ogg Vorbis fondés sur leurs étiquettes ID3

source: Setting access and modification dates
fr: Configurer les dates de modification et d'accès

source: Changing permissions and file ownership
fr: Modifier les permissions et le propriétaire du fichier

source: A plug-in API which allows you to extend Krename's features
fr: Un module externe qui vous permet d'étendre les fonctionnalités de Krename

source: Renaming directories recursively
fr: Renommer des dossiers récursivement

source: Support for KFilePlugins
fr: Gestion pour KFilePlugins

source: Create undo file
fr: Créer un fichier annulé

source: And many more....
fr: Et plus encore...

source: <guimenu>File</guimenu> <guimenuitem>Create Checksum</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Créer une somme de contrôle...</guimenuitem>

source: <link linkend="checksum">Checksum creation</link> on file(s) and/or folder(s).
fr: <link linkend="checksum">Création de somme de contrôle</link> sur des fichiers ou des dossiers

source: <guimenu>File</guimenu> <guimenuitem>Verify Checksum</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Vérifier la somme de contrôle...</guimenuitem>

source: Verify Checksum
fr: Vérifier la somme de contrôle

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Split file</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Fractionner un fichier...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Combine files</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Combiner des fichiers...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Q</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Quit</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Q</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Quitter</guimenuitem>

source: Closes &krusader; and cleans up the temporary directory, the same as pressing <keycap>F10</keycap> key.
fr: Ferme &krusader; et nettoie le dossier temporaire, la touche <keycap>F10</keycap> est le raccourci clavier pour cette action.

source: Edit Menu
fr: Le menu <guimenu>Édition</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut to Clipboard</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>X</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Couper vers le presse papiers</guimenuitem>

source: <link linkend="copying">Cuts</link> the selected file(s) to the clipboard to be moved to another location.
fr: <link linkend="copying">Coupe</link> le ou les fichiers sélectionnés vers le presse papiers à être déplacés vers un autre emplacement.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy to Clipboard</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Copier vers le presse papiers</guimenuitem>

source: <link linkend="copying">Copies</link> the selected file(s) to the clipboard to be moved to another location.
fr: <link linkend="copying">Copie</link> le ou les fichiers sélectionnés vers le presse papiers à être déplacés vers un autre emplacement.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste from Clipboard</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Coller vers le presse papiers</guimenuitem>

source: <link linkend="copying">Pastes</link> previously cut or copied items from the clipboard to the current directory.
fr: <link linkend="copying">Colle</link> les éléments précédemment coupés ou collés depuis le presse papiers vers le dossier courant.

source: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Rename</guimenuitem>
fr: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Renommer</guimenuitem>

source: <link linkend="renaming">Renames</link> the currently selected file.
fr: <link linkend="renaming">Renomme</link> le fichier courant sélectionné.

source: <shortcut> <keycap>F8</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Delete</guimenuitem>
fr: <shortcut> <keycap>F8</keycap> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Supprimer</guimenuitem>

source: <link linkend="deleting">Deletes</link> the currently selected file(s).
fr: <link linkend="deleting">Supprime</link> le ou les fichiers courants sélectionnés.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>+</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select Group</guimenuitem>
fr: x<shortcut> <keycombo action="simul">&Ctrl; <keycap>+</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Sélectionner un groupe...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>-</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Unselect Group</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>-</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Désélectionner un groupe...</guimenuitem>

source: The opposite of <guimenuitem>Select Group</guimenuitem>. The files that match the pattern in the active panel will be deselected.
fr: L'opposé de <guimenuitem>Sélectionner un groupe...</guimenuitem>. Les fichiers qui correspondent aux entrées dans le panneau actif seront désactivés.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>+</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>+</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Tout sélectionner</guimenuitem>

source: <shortcut> <keycombo action="simul">&Alt; <keycap>-</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Unselect All</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>-</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Tout désélectionner</guimenuitem>

source: Unselects all the files in the active panel.
fr: Désélectionne tous les fichiers dans le panneau actif.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>*</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Invert Selection</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>*</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Inverser la sélection</guimenuitem>

source: <shortcut> <keycombo action="simul">&Alt; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Compare Directories</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Comparer les dossiers</guimenuitem>

source: <guimenu>Edit</guimenu> <guimenuitem>Compare setup</guimenuitem>
fr: <guimenu>Édition</guimenu> <guimenuitem>Configuration de la comparaison</guimenuitem>

source: Configures the <guimenuitem>Compare Directories</guimenuitem> function.
fr: Configure la fonctionnalité de <guimenuitem>Comparaison des dossiers</guimenuitem>

source: <guimenuitem>Select Newer and Single</guimenuitem> (default)
fr: <guimenuitem>Sélectionner l'unique et le plus récent</guimenuitem> (par défaut)

source: Select Single
fr: Sélectionner l'unique

source: Select Newer
fr: Sélectionner le nouveau

source: Select Different and Single
fr: Sélectionner le différent et l'unique

source: Select Different
fr: Sélectionner le différent

source: <guimenu>Edit</guimenu> <guimenuitem>Calculate Occupied Space</guimenuitem>
fr: <guimenu>Édition</guimenu> <guimenuitem>Calculer l'espace occupé</guimenuitem>

source: <link linkend="calculate">Calculates occupied space</link> of files and folders, archives and remote filesystems.
fr: <link linkend="calculate">Calcule l'espace occupé</link> des fichiers et dossiers, archives et systèmes de fichiers distants.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>KP_Enter</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Properties</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>KP_Enter</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Propriétés</guimenuitem>

source: Opens the properties dialog for the currently selected file. (KP refers to Key Pad.)
fr: Ouvre la boîte de dialogue de propriétés pour le fichier sélectionné courant (KP se rapporte à Key Pad).

source: View Menu
fr: Le menu <guimenu>Affichage</guimenu>

source: Shows the file names, file size, creation date and time and their attributes.
fr: Affiche les noms des fichiers, les tailles des fichiers, la date et l'heure de création et leurs caractéristiques.

source: Shows only the file names.
fr: Affiche seulement les noms des fichiers.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>.</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Hidden Files</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>.</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Afficher les fichiers cachés</guimenuitem>

source: Toggles the option to display the hidden files in the &krusader; panels.
fr: Affiche ou cache l'option pour afficher les fichiers cachés dans les panneau de &krusader;.

source: Turns off all filters and display all files.
fr: Désactive tous les filtres et affiche tous les fichiers.

source: Allows you to install a custom filter on the &krusader; panel. Only files that match the filter pattern(s) and directories will be displayed. Do not forget to deactivate the custom filter after use, or some files may not be visible.
fr: Vous permet d'installer un filtre personnalisé sur le panneau de &krusader;. Seuls les fichiers qui correspondent aux dossiers et éléments du filtre seront affichés. N'oubliez pas de désactiver le filtre personnalisé après utilisation, ou certains fichiers ne seront pas visibles.

source: <guimenu>View</guimenu> <guimenuitem>Select Remote Charset</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Sélectionner le jeu de caractères distant</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Reload</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Recharger</guimenuitem>

source: Refreshes the contents of the active panel.
fr: Recharge le contenu du panneau actif.

source: Go Menu
fr: Le menu <guimenu>Aller</guimenu>

source: <guimenu>Go</guimenu> <guimenuitem>Back</guimenuitem>
fr: <guimenu>Aller</guimenu> <guimenuitem>Précédent</guimenuitem>

source: Navigates to the previously viewed directory in the active panel.
fr: Se rend au dossier précédent visité dans le panneau actif.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>PageUp</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Up</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Page Préc</keycap></keycombo> </shortcut> <guimenu>Aller</guimenu> <guimenuitem>Haut</guimenuitem>

source: Navigates to the parent directory of the active panel.
fr: Se rend dans le dossier parent du panneau actif.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Backspace</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Root</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Backspace</keycap></keycombo> </shortcut> <guimenu>Aller</guimenu> <guimenuitem>Superutilisateur (root)</guimenuitem>

source: Navigates to the root directory of the system.
fr: Se rend dans le dossier racine ( / ) du système.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Home</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Home</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Home</keycap></keycombo> </shortcut> <guimenu>Aller</guimenu> <guimenuitem>Dossier personnel</guimenuitem>

source: Navigates to the home directory of the current user.
fr: Se rend dans le dossier personnel de l'utilisateur courant.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Popular URLs</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Aller</guimenu> <guimenuitem>URL les plus utilisés...</guimenuitem>

source: Displays a listing of frequently viewed directories from which you may navigate to one by double-clicking on it.
fr: Affiche la liste des dossiers les plus fréquemment visités où vous pouvez vous rendre avec un simple double-clic.

source: Sets the current directory as a "jump back" point. To navigate to this directory quickly, select the "Jump Back" command from the Go Menu.
fr: Définit le dossier courant comme « point de retour ». Pour naviguer rapidement dans ce dossier, sélectionnez la commande « Aller au point de retour » dans le menu <guimenu>Aller</guimenu>.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>J</keycap></keycombo> </shortcut> <guimenu>Go</guimenu> <guimenuitem>Jump Back</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>J</keycap></keycombo> </shortcut> <guimenu>Aller</guimenu> <guimenuitem>Aller au point de retour</guimenuitem>

source: Returns to a previous "jump back" point.
fr: Retourne au « point de retour » précédent.

source: Useractions Menu
fr: Le menu <guimenu>Actions utilisateur</guimenu>

source: <guimenu>Useractions</guimenu> <guimenuitem>Manage useractions</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Gestion des actions utilisateur</guimenuitem>

source: <guimenu>Useractions</guimenu> <guimenuitem>Your own Useractions</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Vos_actions_utilisateurs</guimenuitem>

source: Opens the default user actions and those created by the user.
fr: Ouvre les actions utilisateur par défaut et ceux créées par l'utilisateur.

source: <guimenu>Useractions</guimenu> <guimenuitem>Equal panel-size</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Equal panel-size</guimenuitem>

source: Sets the ratio between the two panels to 50/50.
fr: Définit le ratio d'aspect entre les deux panneaux à 50/50.

source: <guimenu>Useractions</guimenu> <guimenuitem>Edit as root</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Edit as root</guimenuitem>

source: Allows you to edit a file with kwrite using root permissions.
fr: Vous permet d'éditer un fichier avec Kwrite en utilisant les droits d'accès superutilisateur.

source: <guimenu>Useractions</guimenu> <guimenuitem>Mount</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Mount</guimenuitem>

source: Mounts a new filesystem.
fr: Monte un nouveau système de fichiers.

source: <guimenu>Useractions</guimenu> <guimenuitem>Enqueue in Amarok</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Enqueue in Amarok</guimenuitem>

source: Appends selected item(s) to Amarok playlist.
fr: Ajoute un ou des fichiers sélectionnés à la liste de lecture d'Amarok.

source: <guimenu>Useractions</guimenu> <guimenuitem>Copy current item to clipboard</guimenuitem>
fr: <guimenu>Actions utilisateur</guimenu> <guimenuitem>Copy current item to clipboard</guimenuitem>

source: Copies selected item(s) to the clipboard.
fr: Copie le ou les éléments sélectionnés vers le presse papiers.

source: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>1</keycap> </keycombo> </shortcut> <guimenu>Useractions</guimenu> <guimenuitem>Sort By Name</guimenuitem>
fr: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>1</keycap> </keycombo> </shortcut> <guimenu>Actions utilisateur</guimenu> <guimenuitem>Sort By Name</guimenuitem>

source: When this action is turned on, the main sorting key in the &krusader; panel becomes the file name.
fr: Quand cette action est activée, la liste des éléments est affichée par ordre alphabétique des noms de fichiers dans le panneau.

source: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>2</keycap> </keycombo> </shortcut> <guimenu>Useractions</guimenu> <guimenuitem>Sort By Extension</guimenuitem>
fr: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>2</keycap> </keycombo> </shortcut> <guimenu>Actions utilisateur</guimenu> <guimenuitem>Sort By Extension</guimenuitem>

source: When this action is turned on, the main sorting key in the &krusader; panel becomes the file extension (the part of the filename after the last '.'). This is useful for grouping files of the same type closer together.
fr: Quand cette action est activée, la liste des éléments est affichée par ordre d'extensions de fichiers (la partie qui suit le « . » dans le nom de fichier) dans le panneau. C'est utile pour grouper les fichiers du même type ensemble.

source: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>3</keycap> </keycombo> </shortcut> <guimenu>Useractions</guimenu> <guimenuitem>Sort By Size</guimenuitem>
fr: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>3</keycap> </keycombo> </shortcut> <guimenu>Actions utilisateur</guimenu> <guimenuitem>Sort By Size</guimenuitem>

source: When this action is turned on, the main sorting key in the &krusader; panel becomes the file size. This is useful for determining the largest files in a particular directory.
fr: Quand cette action est activée, la liste des éléments est affichée par ordre de taille de fichiers dans le panneau. C'est utile pour déterminer les fichiers les plus gros dans un dossier particulier.
