Repository: CodeCollect/krusader
Catalog: doc/i18n/*/menu-commands.docbook.po
Languages: fr

source: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>4</keycap> </keycombo> </shortcut> <guimenu>Useractions</guimenu> <guimenuitem>Sort By Modified</guimenuitem>
fr: <shortcut> <keycombo action="simul"> <keycap>Win</keycap> <keycap>4</keycap> </keycombo> </shortcut> <guimenu>Actions utilisateur</guimenu> <guimenuitem>Sort By Modified</guimenuitem>

source: When this action is turned on, the main sorting key in the &krusader; panel becomes the last modified date for each file. This is useful for finding files you recently worked on.
fr: Quand cette action est activée, la liste des éléments est affichée par ordre de date dernièrement modifiée dans le panneau. C'est utile pour trouver les fichiers sur lesquels vous avez travaillé récemment.

source: Backups current file in current directory and asks the user for a new filename. By default <filename>.old</filename> is appended to the original filename.
fr: Crée une copie de secours du fichier dans le dossier courant et vous demande un nouveau nom de fichier. Par défaut <filename>.old</filename> est ajouté au nom de fichier original.

source: Tools Menu
fr: Le menu <guimenu>Outils</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Search</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Rechercher</guimenuitem>

source: Opens <link linkend="krusearcher">KruSearcher</link> - the Krusader search module.
fr: Ouvre<link linkend="krusearcher">l'outil de recherche de Krusader</link>.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Y</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Synchronize Directories</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Y</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Synchroniser les dossiers...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Alt; <keycap>/</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>MountMan</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>/</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>MountMan...</guimenuitem>

source: Opens <link linkend="mount-man">MountMan</link> - the Mount-Manager.
fr: Ouvre le gestionnaire de montage <link linkend="mount-man">MountMan</link>.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>D</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Disk Usage</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>D</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Espace disque occupé...</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>New Net Connection</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>N</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Nouvelle connexion réseau...</guimenuitem>

source: Opens the <link linkend="remote-connections">New Network Connection</link>dialog to start a &FTP;, SMB, FISH or SFTP connection to a remote host. If you leave the user name and password fields empty, you will login as anonymous. You can <link linkend="bookman">Bookmark</link> these remote sessions.
fr: Ouvre la boîte de dialogue pour une <link linkend="remote-connections">Nouvelle connexion réseau...</link> pour démarrer une connexion &FTP;, SMB, FISH ou SFTP à un hôte distant. Si vous laissez le champ de nom d'utilisateur et le mot de passe vide, vous serez identifié en anonyme. Vous pouvez créer des <link linkend="bookman">Signets</link> pour ces sessions distantes.

source: Ends the <link linkend="remote-connections">remote connection</link> in the active panel and returns to the start-up path.
fr: Ferme la <link linkend="remote-connections">connexion distante</link> dans le panneau actif et affiche l'emplacement de démarrage.

source: <guimenu>Tools</guimenu> <guimenuitem>Start Terminal</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Lancer un terminal</guimenuitem>

source: <shortcut> <keycombo action="simul"> <keycap>F2</keycap> </keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Start Terminal Here</guimenuitem>
fr: <shortcut> <keycombo action="simul"> <keycap>F2</keycap> </keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Démarrer un terminal ici</guimenuitem>

source: <shortcut> <keycombo action="simul">&Alt; <keycap>K</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Start Root Mode Krusader</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>K</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Démarrer Krusader en mode superutilisateur</guimenuitem>

source: Be careful when using &krusader; with ROOT PRIVILEGES.
fr: Faites attention quand vous utilisez &krusader; avec les PRIVILEGES SUPERUTILISATEUR !

source: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>J</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Javascript Console</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>J</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Console Javascript</guimenuitem>

source: Opens the <link linkend="javascript_console">Javascript Console</link>.
fr: Ouvre une <link linkend="javascript_console">console Javascript</link>.

source: Settings Menu
fr: Le menu <guimenu>Configuration</guimenu>

source: <guimenu>View</guimenu> <guimenuitem>Show Toolbar</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Afficher la barre d'outils</guimenuitem>

source: <guimenu>View</guimenu> <guimenuitem>Show Actions Toolbar</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Affiche la barre d'actions</guimenuitem>

source: <guimenu>View</guimenu> <guimenuitem>Show Statusbar</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Afficher la barre d'état</guimenuitem>

source: Shows the <link linkend="mainwindow">Statusbar</link> if chosen.
fr: Affiche la <link linkend="mainwindow">barre d'état</link> si l'entrée est cochée.

source: <guimenu>View</guimenu> <guimenuitem>Hide Statusbar</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Cacher la barre d'état</guimenuitem>

source: Hides the <link linkend="mainwindow">Statusbar</link> if chosen.
fr: Cache la <link linkend="mainwindow">barre d'état</link> si l'entrée est cochée.

source: <guimenu>View</guimenu> <guimenuitem>Show FN Keys bar</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Afficher la barre des touches FN</guimenuitem>

source: <guimenu>View</guimenu> <guimenuitem>Show Command Line</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Afficher la ligne de commande</guimenuitem>

source: Shows the <link linkend="cmdline">Command Line</link> if checked.
fr: Affiche la <link linkend="cmdline">ligne de commande</link> si l'entrée est cochée.

source: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>T</keycap></keycombo> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Terminal Emulator</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>T</keycap></keycombo> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Afficher l'émulateur de terminal</guimenuitem>

source: Show the <link linkend="cmdline">Terminal Emulator</link> if checked.
fr: Affiche <link linkend="cmdline">l'émulateur de terminal</link> si l'entrée est cochée.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Shortcuts</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Configurer les raccourcis clavier</guimenuitem>

source: Configure
fr: Configurer

source: Shortcuts
fr: Raccourcis clavier

source: Opens a dialog which allows you to configure the &krusader; key bindings.
fr: Ouvre une boîte de dialogue qui vous permet de configurer les raccourcis clavier de &krusader;.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer la barre d'outils</guimenuitem>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure &krusader;</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer &krusader;</guimenuitem>

source: Opens <link linkend="konfigurator">Konfigurator</link> - the &krusader; configuration center.
fr: Ouvre le programme interne <link linkend="konfigurator">Konfigurator</link> qui est le centre de configuration de &krusader;.

source: Window Menu
fr: Le menu <guimenu>Fenêtre</guimenu>

source: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>N</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>New Tab</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>N</keycap></keycombo> </shortcut> <guimenu>Fenêtre</guimenu> <guimenuitem>Nouvel onglet</guimenuitem>

source: Opens a new tab in the active panel.
fr: Ouvre un nouvel onglet dans le panneau actif.

source: Opens a new tab that is a duplicate of the active tab in the active panel.
fr: Ouvre un nouvel onglet qui est une copie de l'onglet actif dans le panneau actif.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>W</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Close Current Tab</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>W</keycap></keycombo> </shortcut> <guimenu>Fenêtre</guimenu> <guimenuitem>Fermer l'onglet courant</guimenuitem>

source: Closes the current tab in the active panel. This command is only available if there is more than one tab in the active panel.
fr: Ferme l'onglet courant dans le panneau actif. Cette commande est seulement disponible si il y a plus d'un onglet dans le panneau actif.

source: Navigates to the next tab in the active panel. This command is only available if there is more than one tab in the active panel.
fr: Se place sur l'onglet suivant dans le panneau actif. Cette commande est seulement disponible s'il y a plus d'un onglet dans le panneau actif.

source: Navigates to the previous tab in the active panel. This command is only available if there is more than one tab in the active panel.
fr: Se place sur l'onglet précédent dans le panneau actif. Cette commande est seulement disponible s'il y a plus d'un onglet sur le panneau actif.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>L</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Profiles</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>L</keycap></keycombo> </shortcut> <guimenu>Fenêtre</guimenu> <guimenuitem>Profils</guimenuitem>

source: Opens a menu where <link linkend="panel_profiles">Panel profiles</link> can be saved and restored.
fr: Ouvre un menu où les <link linkend="panel_profiles">profils du panneau</link> peuvent être enregistrés et restaurés.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Swap Panels</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Fenêtre</guimenu> <guimenuitem>Inverser les panneaux</guimenuitem>

source: The left panel will become the right panel and vice versa, only the current tabs will be swapped.
fr: Le panneau de gauche deviendra celui de droite et vice versa, seul les onglets courants seront inversés.

source: The complete left panel will become the right panel and vice versa, and all tabs will be swapped.
fr: Le panneau de gauche au complet deviendra le panneau de droite et vice versa, et tous les onglets seront permutés.

source: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>r</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Vertical Mode</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>r</keycap></keycombo> </shortcut> <guimenu>Fenêtre</guimenu> <guimenuitem>Mode vertical</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Window</guimenu> <guimenuitem>Toggle Fullwidget Terminal Emulator</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Fenêtre</guimenu> <guimenuitem>Maximiser l'émulateur de terminal</guimenuitem>

source: Toggles full screen mode of the terminal editor. This option is only available when "Show Terminal Emulator" is activated.
fr: Réduit ou maximise l'éditeur de terminal. Cette option est seulement disponible quand « Afficher l'émulateur de terminal » est activé.

source: <guimenu>Window</guimenu> <guimenuitem>Save Position</guimenuitem>
fr: <guimenu>Fenêtre</guimenu> <guimenuitem>Enregistrer la position</guimenuitem>

source: Help Menu
fr: Le menu <guimenu>Aide</guimenu>

source: <guimenu>Help</guimenu> <guimenuitem>Krusader Handbook</guimenuitem>
fr: <guimenu>Aide</guimenu> <guimenuitem>Manuel de Krusader</guimenuitem>

source: Opens the &kde; Help system starting at the &krusader; help pages (this document).
fr: Ouvre une fenêtre d'aide de &kde; qui affiche le manuel d'aide (ce fantastique document).

source: <guimenu>Help</guimenu> <guimenuitem>Report Bug</guimenuitem>
fr: <guimenu>Aide</guimenu> <guimenuitem>Rapport de bogue...</guimenuitem>

source: Opens the bug report dialog for sending bug reports via mail.
fr: ouvre une boîte de dialogue qui permet l'envoi de rapports de bogue par e-mail.

source: Wishes, patches, and comments are always <link linkend="faqg_wish">welcome</link>.
fr: Souhaits, patchs et commentaires sont toujours les <link linkend="faqg_wish">bienvenue</link>.

source: <guimenu>Help</guimenu> <guimenuitem>About Krusader</guimenuitem>
fr: <guimenu>Aide</guimenu> <guimenuitem>À propos de Krusader</guimenuitem>

source: Displays version, author, and license information.
fr: Affiche la version, l'auteur et l'information sur la licence.

source: <guimenu>Help</guimenu> <guimenuitem>About KDE</guimenuitem>
fr: <guimenu>Aide</guimenu> <guimenuitem>À propos de KDE</guimenuitem>

source: Displays the &kde; version and basic information.
fr: Affiche la version de &kde; et des informations basiques.
