Repository: CodeCollect/krusader
Catalog: doc/i18n/*/remote-connections.docbook.po
Languages: fr

source: <title>Remote Connections</title>
fr: <title>Connexions distantes</title>

source: <primary>Remote Connections</primary>
fr: <primary>Connexions distantes</primary>

source: Remote connections are easily made by typing the &URL; in the <link linkend="list_panel">Location Toolbar</link>; these are actually KIO Slaves. Please note that the &krusader; panel does not support all KIO Slave e.g. <command>http://</command> will not work in the panel, but will work in the <link linkend="krviewer">viewer</link>. Some examples:
fr: Les connexions distantes sont facilement réalisées en saisissant l'&URL; dans la <link linkend="list_panel">barre d'emplacement</link>. Il y a actuellement KIO Slaves. Remarquez que le panneau de &krusader; ne gère pas tous les KIO Slaves &pex; <command>http://</command> ne fonctionnera pas dans le panneau, mais fonctionnera dans <link linkend="krviewer">l'afficheur</link>. Quelques exemples :

source: You can bookmark these &URL;'s, however, please read the <link linkend="bookman">Bookman</link> section regarding <emphasis>securely save passwords</emphasis>. For connecting to multiple locations, bookmark these &URL;'s and open them one by one, or open them all together by using <link linkend="panel_profiles">Panel profiles</link>. To switch from one to another location, just open a <link linkend="folder-tabs">Folder tabs</link> for each.
fr: Vous pouvez créer de signets pour ces &URL;, cependant, veuillez lire la section <link linkend="bookman">Bookman</link> pour <emphasis>enregistrer de manière sécurisée les mots de passe</emphasis>. Pour se connecter à plusieurs emplacements, créez des signets pour ces &URL; et ouvrez les un par un, ou ouvrez les tous ensemble en utilisant les <link linkend="panel_profiles">profils de panneau</link>. Pour passer d'un emplacement à un autre, ouvrez simplement un <link linkend="folder-tabs">onglet de dossiers</link> pour chaque.

source: There are three ways to start a remote connection:
fr: Il y a trois façons de lancer une connexion distante :

source: Type the &URL; in the <link linkend="list_panel">Location Toolbar</link>
fr: Saisir l'&URL; dans la <link linkend="list_panel">barre d'outils d'emplacement</link>

source: Select <emphasis role="bold"> <menuchoice> <guimenu>Tools</guimenu> <guimenuitem>New Net Connection</guimenuitem> </menuchoice> </emphasis>which will pop-up a dialog that will ask for the remote site details. This dialog is handy if you are not used to type remote &URL;'s in the Location Toolbar. Leaving the password and user name fields empty will log you in as anonymous. NOTE: we are planning to rewrite this dialog window.
fr: Sélectionnez <emphasis role="bold"> <menuchoice> <guimenu>Outils</guimenu> <guimenuitem>Nouvelle connexion réseau</guimenuitem> </menuchoice> </emphasis> qui va ouvrir une boite de dialogue qui vous demandera les détails du site distant. Cette boîte de dialogue est manuelle si vous ne saisissez pas l'&URL; distant dans la barre d'emplacement. Laisser le mot de passe et le nom d'utilisateur vide vous connectera comme anonyme. REMARQUE : nous planifions de réécrire cette fenêtre de dialogue.

source: You can bookmark a directory on a remote host and return to this directory from the bookmark button on the top corner of your panel just like in a web browser.
fr: Vous pouvez créer un signet pour un dossier sur un hôte distant et retourner dans ce dossier depuis les boutons de signets sur le coin en haut à droite de votre panneau comme un navigateur web.

source: After you log on to a remote server you can browse it just like your local hard drive with the following exceptions:
fr: Après vous être connecté à un serveur distant, vous pouvez naviguer dedans comme si c'est un disque dur local avec les exceptions suivantes :

source: You cannot execute files on remote servers.
fr: Vous ne pouvez pas exécuter des fichiers sur des serveurs distants.

source: Permissions cannot always be calculated on remote servers (depends on server and access method) so you might get a "?" on the permissions columns for some files.
fr: Les droits d'accès ne peuvent pas toujours être calculés sur des serveurs distants (cela dépend du serveur et de la méthode de droit d'accès), vous aurez alors un « ? » dans la colonne de droits d'accès pour certains fichiers.

source: Disk usage information is not available for most remote filesystems.
fr: Les informations de l'utilisation du disque ne sont pas disponible pour les systèmes de fichiers distants.

source: To change the charset of the remote host use <emphasis role="bold"> <menuchoice> <guimenu>View</guimenu> <guimenuitem>Select Remote Charset</guimenuitem> </menuchoice> </emphasis>.
fr: Pour modifier le jeu de caractères sur un hôte distant, utilisez <emphasis role="bold"> <menuchoice> <guimenu>Affichage</guimenu> <guimenuitem>Sélectionner le jeu de caractères distant</guimenuitem> </menuchoice> </emphasis>.

source: You can <emphasis role="bold">close the current Active Remote Connection</emphasis> by two separate methods:
fr: Vous pouvez <emphasis role="bold">fermer une connexion distante active</emphasis> par deux méthodes distinctes :

source: Manually: Add the disconnect button to the <link linkend="mainwindow">Main Toolbar</link> and click on it.
fr: Manuellement : ajouter un bouton de déconnexion à la <link linkend="mainwindow">barre principale</link> et cliquez dessus.

source: Automatically: Change the &URL; in the <link linkend="list_panel">Location Toolbar</link> .
fr: Automatiquement : saisir l'&URL; dans la <link linkend="list_panel">barre d'emplacement</link>.

source: &krusader; is a file manager that supports remote connections via KIO Slaves, but if you are looking for even more advanced remote connections features, e.g. an advanced &FTP;-client we recommend you to use e.g. <ulink url="http://kasablanca.berlios.de/">Kasablanca</ulink> or <ulink url="http://kftpgrabber.sourceforge.net/"><application>Kftpgrabber</application></ulink>.
fr: &krusader; est un gestionnaire de fichiers qui gère les connexions distantes via &kioslaves1-url;, mais si vous recherchez encore plus de fonctionnalités avancées de connexions distantes, &pex; un client de &FTP; avancé, nous vous recommandons d'utiliser &pex; <ulink url="http://kasablanca.berlios.de/">Kasablanca</ulink> ou <ulink url="http://kftpgrabber.sourceforge.net/"><application>Kftpgrabber</application></ulink>.

source: LAN connections via fish:/ protocol (zeroconf)
fr: Connexions LAN via le protocole fish:/ (zeroconf)

source: Remote LAN Connections (zeroconf)
fr: Connexions LAN distantes (zeroconf)

source: This section is contributed by <ulink url="http://krusader.sourceforge.net/phpBB/viewtopic.php?t=1912">Andrew Svet (z-vet)</ulink>, feedback about this chapter is appriciated. Thanks!
fr: Cette section est rédigée par <ulink url="http://krusader.sourceforge.net/phpBB/viewtopic.php?t=1912">Andrew Svet (z-vet)</ulink>, les commentaires à propos de ce chapitre sont appréciés. Merci !

source: This works on a <trademark class="registered">Debian</trademark> system, so it will work on <trademark class="registered">Debian</trademark> and derivatives (<trademark class="registered">Kubuntu</trademark> &etc;), though it should work on other Linuxes as well. We assume that you have <link linkend="gloss-ssh">SSH</link> installed, configured and working on every machine on LAN you want to connect to/from. There are plenty of very good tutorials about <link linkend="gloss-ssh">SSH</link> on the net, e.g. at <ulink url="http://www.linuxhomenetworking.com/wiki/index.php/Quick_HOWTO_:_Ch17_:_Secure_Remote_Logins_and_File_Copying">linuxhomenetworking.com</ulink> or just google for it. We use the default <link linkend="gloss-ssh">SSH</link> port (22) for this chapter. Remember to change it if you use different one. All modifications, editing &etc; must be done as root.
fr: Ceci fonctionne sur un système <trademark class="registered">Debian</trademark>, et donc ses dérivés (<trademark class="registered">Kubuntu</trademark> &etc;), même si cela devrait fonctionner sur les autres distributions Linux. Nous assumons que vous avez installé et configuré <link linkend="gloss-ssh">SSH</link> et que cela fonctionne sur toutes les machines en LAN que vous voulez connecter. Il y a plein de très bon tutoriaux à propos de <link linkend="gloss-ssh">SSH</link> sur le web, &pex; <ulink url="http://www.linuxhomenetworking.com/wiki/index.php/Quick_HOWTO_:_Ch17_:_Secure_Remote_Logins_and_File_Copying">linuxhomenetworking.com</ulink> ou cherchez simplement sur Google. Nous utilisons par défaut le port (22) <link linkend="gloss-ssh">SSH</link> pour ce chapitre. Souvenez vous de le modifier si vous utilisez un port différent. Toutes les modifications et changements doivent être réalisés en mode superutilisateur.

source: Let's start with installing all the packages we need: <screen> <prompt>#</prompt> <userinput><command>apt-get install</command> <option>avahi-daemon libnss-mdns kdnssd</option></userinput> </screen> Everything is installed, now let's do some configuration. First, we need our services to be announced on LAN. That's why we installed avahi-daemon: it represents your machine on local network and allows other applications to publish services they provide. Avahi-daemon comes with example <filename>ssh.service</filename> configuration file found in <filename>/usr/share/doc/avahi-daemon/examples</filename> . In order to get the service to be announced on LAN we need to copy this file to <filename>/etc/avahi/services</filename> directory: <screen> <prompt>#</prompt> <userinput><command>cp</command> <option>/usr/share/doc/avahi-daemon/examples/ssh.service /etc/avahi/services</option></userinput> </screen> Now we need fish:/ protocol to be announced too, so we use an ssh.service file as a template for fish.service: <screen> <prompt>#</prompt> <userinput><command>cp</command> <option>/etc/avahi/services/ssh.service /etc/avahi/services/fish.service</option></userinput> </screen> This file is just a copy of ssh.service, Edit the <filename>fish.service</filename> file and replace "Remote Terminal on %h" with "Fish to %h" and "_ssh._tcp" with "_fish._tcp". Here's how it looks after edit: <programlisting> &lt;?xml version="1.0" standalone='no'?&gt;&lt;!--*-nxml-*--> &lt;!DOCTYPE service-group SYSTEM "avahi-service.dtd"&gt; &lt;!-- $Id: remote-connections.docbook,v 1.6 2007/05/02 18:07:28 codeknight Exp $ --> &lt;!-- This file is part of avahi. avahi is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. avahi is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR &lt;!-- See avahi.service(5) for more information about this configuration file --> &lt;service-group> &lt;name replace-wildcards="yes">FISH to %h&lt;/name> &lt;service> &lt;type>_fish._tcp&lt;/type> &lt;port>22&lt;/port> &lt;/service> &lt;/service-group> </programlisting> Save the modified file. Now we need to create a new file <filename>_fish._tcp</filename>, open a text editor and add the next lines: <programlisting> Name=FISH Protocol (ssh) Type=_fish._tcp UserEntry=u PathEntry=path PasswordEntry=p </programlisting> And save the file <filename>/usr/share/apps/zeroconf/_fish._tcp</filename> Do the same on each machine on your LAN, then restart avahi-daemon: <screen> <prompt># /etc/init.d/</prompt> <userinput><command>avahi-daemon</command> <option>restart</option></userinput> </screen> Than open &krusader; and type in location-toolbar-lnk: <filename>zeroconf:/</filename> to open the <link linkend="gloss-zeroconf">zeroconf</link> connection. Enter the <guilabel>Fish Protocol</guilabel> directory. Inside you'll find the links to each machine that announced <filename>fish:/</filename> on your LAN, the location-toolbar-lnk: will point to <filename>zeroconf:/_fish._tcp</filename> Double clicking on any of these machines, them will bring up the password prompt, asking you for yor ssh key passphrase (if password was set). Enter your passphrase. Congratulations: you connected to remote machine using &krusader;!
fr: Commençons avec l'installation de tous les paquetages dont nous avons besoin : <screen> <prompt>#</prompt> <userinput><command>apt-get install</command> <option>avahi-daemon libnss-mdns kdnssd</option></userinput> </screen> Tous est installé, nous allons maintenant faire quelques configurations. Premièrement, nous avons besoin de nos « services » pour s'identifier sur un LAN. C'est pourquoi nous avons installé avahi-daemon : il représente votre ordinateur sur un réseau local et permet aux autres applications de publier des services qu'ils fournissent. Avahi-daemon vient avec un ficheir de configuration d'exemple <filename>ssh.service</filename> localisé dans <filename>/usr/share/doc/avahi-daemon/examples</filename>. Pour que le service soit déclaré sur un LAN, nous avons besoin de copier ce fichier dans le dossier <filename>/etc/avahi/services</filename> : <screen> <prompt>#</prompt> <userinput><command>cp</command> <option>/usr/share/doc/avahi-daemon/examples/ssh.service /etc/avahi/services</option></userinput> </screen> Maintenant nous avons besoin que le protocole fish:/ soit aussi déclaré, nous utilisons donc le fichier ssh.service comme un modèle pour fish.service: <screen> <prompt>#</prompt> <userinput><command>cp</command> <option>/etc/avahi/services/ssh.service /etc/avahi/services/fish.service</option></userinput> </screen> This file is just a copy of ssh.service, Edit the <filename>fish.service</filename> file and replace "Remote Terminal on %h" with "Fish to %h" and "_ssh._tcp" with "_fish._tcp". Here's how it looks after edit: <programlisting> &lt;?xml version="1.0" standalone='no'?&gt;&lt;!--*-nxml-*--> &lt;!DOCTYPE service-group SYSTEM "avahi-service.dtd"&gt; &lt;!-- $Id: remote-connections.docbook,v 1.6 2007/05/02 18:07:28 codeknight Exp $ --> &lt;!-- This file is part of avahi. avahi is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version. avahi is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR &lt;!-- See avahi.service(5) for more information about this configuration file --> &lt;service-group> &lt;name replace-wildcards="yes">FISH to %h&lt;/name> &lt;service> &lt;type>_fish._tcp&lt;/type> &lt;port>22&lt;/port> &lt;/service> &lt;/service-group> </programlisting> Save the modified file. Now we need to create a new file <filename>_fish._tcp</filename>, open a text editor and add the next lines: <programlisting> Name=FISH Protocol (ssh) Type=_fish._tcp UserEntry=u PathEntry=path PasswordEntry=p </programlisting> Et enregistrez le fichier <filename>/usr/share/apps/zeroconf/_fish._tcp</filename>. Faites la même chose sur chaque ordinateur sur votre LAN, et ensuite redémarrez avahi-daemon : <screen> <prompt># /etc/init.d/</prompt> <userinput><command>avahi-daemon</command> <option>restart</option></userinput> </screen> Ouvrez ensuite &krusader; et saisissez dans la &location-toolbar-lnk; : <filename>zeroconf:/</filename> pour ouvrir la connexion <link linkend="gloss-zeroconf">zeroconf</link>. Entrez dans le dossier <guilabel>Fish Protocol</guilabel>. Ci-dessous vous trouverez les liens pour chaque ordinateur qui déclarent <filename>fish:/</filename> sur votre LAN, la &location-toolbar-lnk; se dirigera vers <filename>zeroconf:/_fish._tcp</filename>. Faites un double-clic sur n'importe quelles machines, le shell affichera un emplacement pour saisir le mot de passe, vous demandant le mot de passe de la clé ssh (si le mot de passe a été défini). Saisissez votre mot de passe. Félicitations : vous êtes connecté à votre machine distante en utilisant &krusader; !
