Repository: CodeCollect/krusader
Catalog: doc/i18n/*/synchronizer.docbook.po
Languages: fr

source: 2. change the selections
fr: 2. Modifier les sélections.

source: <guibutton>Select items</guibutton>: Opens a dialog which allows you to select items. This is the <guimenuitem>Select Group</guimenuitem> dialog from the <link linkend="edit-menu">Edit menu</link>.
fr: <guibutton>Sélectionner les éléments</guibutton> : ouvre une boîte de dialogue qui vous permet de sélectionner les éléments. C'est la boîte de dialogue <guimenuitem>Sélectionner un groupe</guimenuitem> depuis le menu <link linkend="edit-menu">Édition</link>.

source: <guibutton>Unselect items</guibutton>: Opens a dialog which allows you to deselect items. This is the <guimenuitem>Unselect Group</guimenuitem> dialog from the <link linkend="edit-menu">Edit menu</link>.
fr: <guibutton>Désélectionner un groupe</guibutton> : ouvre une boîte de dialogue qui vous permet de désélectionner les éléments. C'est la boîte de dialogue <guimenuitem>Désélectionner un groupe</guimenuitem> dans le menu <link linkend="edit-menu">Édition</link>.

source: <guibutton>Invert selection</guibutton>: Invert the selection status of all items.
fr: <guibutton>Inverser la sélection</guibutton> : inverser l'état de la sélection de tous les éléments.

source: 3. others (note that the following operations work on the right-clicked file and not on the selection).
fr: 3. autres (remarquez que les opérations suivantes fonctionnent sur les fichiers avec un clic-droit et non sur la sélection).

source: <guibutton>View left file</guibutton>: Starts viewer on the left file.
fr: <guibutton>Afficher le fichier de gauche</guibutton> : démarre l'afficheur sur le fichier de gauche.

source: <guibutton>View right file</guibutton>: Starts viewer on the right file.
fr: <guibutton>Afficher le fichier de droite</guibutton> : démarre l'afficheur sur le fichier de droite.

source: <guibutton>Compare Files</guibutton>: Starts the diff utility (&eg; &kompare;) on the files.
fr: <guibutton>Comparer les fichiers</guibutton> : démarre l'utilitaire de différence (&pex; &kompare;) sur les fichiers.

source: Other buttons
fr: Autres boutons

source: <guibutton>Profiles</guibutton>: If you have to synchronize the same directories often, you can save the settings &eg; include files, exclude files, ... Press the <guibutton>Profile</guibutton> button, and you will be able to add / load / save / remove synchronizer profiles.
fr: <guibutton>Profils</guibutton> : si vous devez synchroniser souvent les mêmes dossiers, vous pouvez enregistrer la configuration &pex; inclure les fichiers, exclure les fichiers... Appuyez sur le bouton <guibutton>Profils</guibutton>, et vous pourrez ajouter / charger / enregistrer / supprimer les profils de synchronisation.

source: <guibutton>Swap sides</guibutton>: Swaps the <guilabel>File List</guilabel>.
fr: <guibutton>Séparer les cotés</guibutton> : sépare la <guilabel>liste de fichiers</guilabel>.

source: Synchronize with <application>kget</application>
fr: Synchroniser avec <application>kget</application>

source: If you want to synchronize a local directory with an unstable ftp server, <application>kget</application> is a much better solution than simple file copying. After comparing you may right click on the result list and select <guimenuitem>Synchronize with kget</guimenuitem> to execute the synchronization, after that the listed files will be downloaded with kget instead of krusader. Of course <application>kget</application> needs to be installed on your computer; otherwise, it will not be available.
fr: Si vous voulez synchroniser un dossier local avec un serveur &FTP; instable, <application>kget</application> est la meilleure solution qu'une simple copie de fichier. Après avoir comparé, vous devez faire un clic-droit sur la liste de résultats et sélectionnez <guimenuitem>Synchroniser avec kget</guimenuitem> pour exécuter la synchronisation, après que les fichiers listés ont été téléchargés avec kget à la place de krusader. Bien sûr, <application>kget</application> a besoin d'être installé sur votre ordinateur, sinon il ne sera pas disponible.

source: Sychronisation
fr: Synchronisation

source: After pressing the <guibutton>Synchronize</guibutton> button the synchronization dialog appears.
fr: Après avoir cliqué sur le bouton <guibutton>Synchroniser</guibutton>, la boîte de dialogue de synchronisation apparaît.

source: Check boxes
fr: Case à cocher

source: Here you confirm the copy and delete operations of the Synchronizer
fr: Vous confirmez ici les opérations de copie et de suppression.

source: <guilabel>Right to left</guilabel>: copy X1 files ( Y1 bytes ) enable / disable the copy from right to left.
fr: <guilabel>Droite à gauche</guilabel> : copier les fichiers X1 (Y1 bytes) active / désactive la copie de droite à gauche.

source: <guilabel>Left to right</guilabel>: copy X2 files ( Y2 bytes ) enable / disable the copy from left to right.
fr: <guilabel>Gauche à droite</guilabel> : copier les fichiers X2 (Y2 bytes) active / désactive la copie de gauche à droite.

source: <guilabel>Left</guilabel>: delete X3 files ( Y3 bytes ) enable / disable the left side deleting.
fr: <guilabel>Gauche</guilabel> : supprimer les fichiers X3 (Y3 bytes) active / désactive la suppression du coté gauche.

source: <guilabel>Confirm overwrites</guilabel>: By switching this option on, Krusader will show the <guibutton>rename, skip, overwrite, skip all, overwrite all</guibutton> dialog box, before overwriting the file.
fr: <guilabel>Confirmer l'écrasement</guilabel> : en passant cette option, Krusader affichera la boîte de dialogue <guibutton>renommer, passer, écraser, tout passer, tout écraser</guibutton> avant l'écrasement du fichier.

source: Status labels
fr: État des titres

source: <guilabel>Ready</guilabel>: A1/A2 files, B1/B2. This line is changed at synchronizing, showing that synchronizer finished with A1 files from A2 ( B1 bytes from B2 ).
fr: <guilabel>Prêt</guilabel> : les fichiers A1 / A2, B1 / B2. Cette ligne est modifiée à la synchronisation, affichant que la synchronisation a terminé avec les fichiers A1 à A2 (B1 bytes à B2).

source: <guilabel>Progress bar</guilabel>: Shows the progress on the synchronization (based on bytes).
fr: <guilabel>Barre de progression</guilabel> : affiche la progression de la synchronisation (fondée sur les bytes).

source: <guibutton>Start</guibutton>: Starts synchronization.
fr: <guibutton>Démarrer</guibutton> : démarre la synchronisation.

source: <guibutton>Pause / Resume</guibutton>: Pauses/resumes the synchronization process.
fr: <guibutton>Pause / Résumer</guibutton> : met en pause / résume le processus de synchronisation.

source: <guibutton>Close</guibutton>: Closes the synchronization dialog (and stops synchronization).
fr: <guibutton>Fermer</guibutton> : ferme la boîte de dialogue de synchronisation (et arrête celle-ci).

source: Parallel synchronization
fr: Synchronisation parallèle

source: One can give the number of the 'quasy' threads.
fr: Le premier peut donner le nombre de processus « quasy ».

source: Can drastically increase the speed when synchronized with slow FTP servers.
fr: Peut augmenter drastiquement la vitesse quand la synchronisation se réalise avec des serveurs FTP lents.

source: Does not affect the speed of local synchronization.
fr: N'affecte pas la vitesse de synchronisation locale.

source: Remote "compare by content" and "directory compare" is done in parallel.
fr: Supprimer « comparer par contenu » et « dossier comparé » est réalisé en parallèle.

source: Remote synchronization is also done in parallel, except the mkdir tasks (mkdir must be before copy).
fr: Supprimer la synchronisation est aussi réalisé en parallèle, en excluant les tâches mkdir (mkdir doit être avant la copie).
