Repository: CodeCollect/krusader
Catalog: doc/i18n/*/synchronizer.docbook.po
Languages: fr

source: This function compares two directories with all subdirectories and shows the differences between them. After selecting some options and the <guilabel>Compare</guilabel> function you can synchronize the files and directories. One panel could be an &FTP; server. Do not forget the <guilabel>Compare by content</guilabel> option if the file size stays equal. Choose <emphasis role="bold"> <menuchoice> <guimenu>Commands</guimenu> <guimenuitem>Synchronize Directories</guimenuitem> </menuchoice> </emphasis>or <keycombo action="simul">&Ctrl; <keycap>Y</keycap></keycombo> to start this feature. The <link linkend="konfig-color">colors</link> are configurable. The synchronizer has it's own <link linkend="synchronizer_keybindings">keybindings</link>.
fr: La fonctionnalité compare deux dossiers avec tous les sous-dossiers et affiche la différence entre eux. Après avoir sélectionné des options et la fonctionnalité <guilabel>Comparer</guilabel>, vous pouvez synchroniser les fichiers et les dossiers. Un panneau peut être un serveur &FTP;. N'oubliez pas l'option <guilabel>Comparer par contenu</guilabel> si la taille du fichier reste égale. Choisissez <emphasis role="bold"> <menuchoice> <guimenu>Outils</guimenu> <guimenuitem>Synchroniser les dossiers...</guimenuitem> </menuchoice> </emphasis>or <keycombo action="simul">&Ctrl; <keycap>Y</keycap></keycombo> pour lancer cette fonctionnalité. Les <link linkend="konfig-color">couleurs</link> sont configurables. Synchronizer a ses propres <link linkend="synchronizer_keybindings">raccourcis clavier</link>.

source: For local files: The synchronizer changes the date information to the original dates.
fr: Pour les fichiers locaux : Synchronizer modifie l'information de la date vers les dates originales.

source: <phrase>Synchronizer</phrase>
fr: <phrase>Synchroniser</phrase>

source: Procedure:
fr: Procédure :

source: Set the <guilabel>Left directory</guilabel> and the <guilabel>Right directory</guilabel> that you want to compare.
fr: Définissez le <guilabel>dossier de gauche</guilabel> et le <guilabel>dossier de droite</guilabel> que vous voulez comparer.

source: Configure the optional <guilabel>File Filter</guilabel>, <guilabel>General Filters</guilabel> and <guilabel>Advanced filters</guilabel>. The <guilabel>General Filters</guilabel> includes a <guilabel>don't search in</guilabel> option which lets you exclude directories from comparision.
fr: Configurez le <guilabel>filtre de fichiers</guilabel>, <guilabel>filtres généraux</guilabel> et <guilabel>filtres avancés</guilabel> optionnels. Les <guilabel>filtres généraux</guilabel> incluent une option <guilabel>ne pas rechercher dans</guilabel> qui vous permettent d'exclure des dossiers de la comparaison.

source: Set the <link linkend="synccomp_checkb_options">Checkbox options</link>: <guilabel>Recurse subdirectories</guilabel>, <guilabel>Follow symlinks</guilabel>, <guilabel>Compare by content</guilabel>, <guilabel>Ignore Date</guilabel>, <guilabel>Asymmetric</guilabel>, <guilabel>Ignore Case</guilabel> and <guilabel>Hidden hidden files</guilabel>.
fr: Définissez les <link linkend="synccomp_checkb_options">options à cocher</link> : <guilabel>Sous-dossiers récursifs</guilabel>, <guilabel>Suivre les liens symboliques</guilabel>, <guilabel>Comparer par contenu</guilabel>, <guilabel>Ignorer la date</guilabel>, <guilabel>Asymétrique</guilabel>, <guilabel>Ignorer la casse</guilabel> et <guilabel>Cacher les fichiers cachés</guilabel>.

source: Click on the <guibutton>Compare</guibutton> button to compare the directories.
fr: Cliquez sur le bouton <guibutton>Comparer</guibutton> pour comparer des dossiers.

source: By using <link linkend="synccomp_show_options">Show options</link>, you can include/exclude particular file types. The files that are not on the list will be untouched by synchronization.
fr: En utilisant <link linkend="synccomp_show_options">Afficher les options</link>, vous pouvez inclure et exclure des types de fichiers particuliers. Les fichiers qui ne sont pas sur la liste ne seront pas traités par la synchronisation.

source: If needed, you can change the <guilabel>Task</guilabel> operations determined by the Comparator with the <link linkend="synccomp_right-click">right click menu</link>.
fr: Si besoin, vous pouvez modifier les opérations de <guilabel>tâche</guilabel> déterminées par la comparaison avec le <link linkend="synccomp_right-click">menu par clic-droit</link>.

source: When you agree with the <guibutton>Compare</guibutton> results, click on the <guibutton>Synchronize</guibutton> button to show the synchronize dialog.
fr: Quand vous êtes d'accord avec les résultats de comparaison cliquez sur le bouton <guibutton>Synchroniser</guibutton> pour afficher la boîte de dialogue de synchronisation.

source: After selecting the options of the <link linkend="synchronizer">Synchronizer</link>, click on the <guibutton>Start</guibutton> button to start the synchronization process.
fr: Après avoir sélectionné les options de synchronisation, cliquez sur le bouton <guibutton>Démarrer</guibutton> pour lancer le processus de synchronisation.

source: A detailed explanation of all the functions and buttons is described in the following text.
fr: Une explication détaillée de toutes les fonctionnalités et boutons est décrite dans le texte suivant.

source: Comparator
fr: Comparaison

source: Panel elements
fr: Éléments du panneau

source: <guilabel>Left Directory</guilabel>: The left side base directory.
fr: <guilabel>Dossier gauche</guilabel> : le dossier situé sur la gauche de la fenêtre.

source: <guilabel>Right Directory</guilabel>: The right side base directory.
fr: <guilabel>Dossier droite</guilabel> : le dossier situé sur la droite de la fenêtre.

source: <guilabel>File Filter</guilabel>: Filters the filenames at synchronizing. &eg; <literal role="extension">*.png</literal> selects only files the names of which end with <literal role="extension">.png</literal> Directories are listed if the directory name ends with <literal role="extension">.png</literal> or if the directory contains files which end with <literal role="extension">.png</literal> Multiple include/exclude example: <literal role="extension">'*.cpp *.h | *.moc.cpp'</literal>includes <literal role="extension">*.cpp *.h</literal> and exclude <literal role="extension">*.moc.cpp</literal>
fr: <guilabel>Filtre fichier/guilabel> : filtre les noms de fichiers à la synchronisation &pex; <literal role="extension">*.png</literal> sélectionne seulement les fichiers dont les noms se terminent par <literal role="extension">.png</literal>. Les dossiers sont listés si le nom de dossier se termine par <literal role="extension">.png</literal> ou si le dossier contient des fichiers qui se terminent par <literal role="extension">.png</literal>. Des exemples pour inclure et exclure : <literal role="extension">'*.cpp *.h | *.moc.cpp'</literal>inclut <literal role="extension">*.cpp *.h</literal> et exclut <literal role="extension">*.moc.cpp</literal>

source: <guilabel>General filters</guilabel>: Search for, containing text
fr: <guilabel>Filtres généraux</guilabel> : rechercher, contenant le texte.

source: <guilabel>Advanced filters</guilabel>: Size, date, ownership
fr: <guilabel>Filtres avancés</guilabel> : taille, date, propriétaire.

source: Filename filtering criteria
fr: Critère de filtrage de nom de fichiers

source: You can make use of wild cards. Multiple patterns are separated by space (means logical OR) and patterns are excluded from the search using the pipe symbol. If the pattern is ended with a slash (*pattern*/), it means that pattern relates to recursive search of directories.
fr: Vous pouvez utiliser des caractères génériques. les patterns sont séparés par un espace (qui signifie logiquement « OU ») et sont exclus de la recherche en utilisant le symbole pipe (|). Si le pattern se termine par un slash (*pattern*/), cela signifie que le pattern se rapporte à une recherche récursives de dossiers.

source: pattern - means to search those files/directories whose name is a pattern, recursive search goes through all subdirectories independently of the value of the pattern.
fr: Pattern signifie rechercher les fichiers et dossiers qui ont comme nom « un pattern », la recherche récursive analyse tous les sous-dossiers indépendamment de la valeur du pattern.

source: pattern/ - means to search all files/directories, but recursive search goes through/excludes the directories whose name is a pattern.
fr: pattern/ signifie rechercher tous les fichiers et dossiers, mais la recherche récursive se fait / exclut les dossiers qui ont comme nom un pattern.

source: You can use quotation marks for names that contain spaces. Filter "Program Files" searches out those files/directories the name of which is <filename>Program Files</filename>.
fr: Vous pouvez utiliser les guillemets pour les noms qui contiennent des espaces. Le filtre « Program Files » recherche dans les fichiers / dossiers le nom qui est <filename>Program Files</filename>.

source: Examples:
fr: Exemples :

source: Note: the search term 'text' is equivalent to '*text*'.
fr: Remarque : le terme de recherche « texte » est l'équivalent de *texte*.

source: Checkbox options
fr: Options des cases à cocher

source: <guilabel>Recurse subdirectories</guilabel>: The Synchronizer walks through subdirectories when comparing.
fr: <guilabel>Inclure les sous-dossiers</guilabel> : Synchronizer analyse les sous-dossiers à la comparaison.

source: <guilabel>Follow symlinks</guilabel>: The Synchronizer follows the symbolic links to directories (not the files!).
fr: <guilabel>Suivre les liens symboliques</guilabel> : Synchronizer suit les liens symboliques des dossiers (non des fichiers !).

source: <guilabel>Compare by content</guilabel>: The files the sizes of which are equal will be compared by content as well.
fr: <guilabel>Comparer par contenu</guilabel> : la taille des fichiers qui sont de même valeur seront comparés par contenu.

source: <guilabel>Ignore Date</guilabel>: Ignores the date information (useful for &FTP;, smb, archive, ... ) the date information is relevant *only* in the local file system.
fr: <guilabel>Ignorer la date</guilabel> : ignorer la date (utile pour les &FTP;, smb, archive...). La date est utile *seulement* dans un système de fichiers local.

source: <guilabel>Asymmetric</guilabel>: The <guilabel>Left Directory</guilabel> is the target directory, the <guilabel>Right Directory</guilabel> is the source directory. This functions synchronizes the content of the left directory to the right directory. <itemizedlist> <listitem> <para>The files that exist only on the left side will be deleted.</para> </listitem> <listitem> <para>The files that exist only on the right side will be copied to left.</para> </listitem> <listitem> <para>The files considered to be equal will be untouched.</para> </listitem> <listitem> <para>Those files considered to be different will be copied to left. Use this feature with care!</para> </listitem> </itemizedlist>This function is useful if the date information is unusable, or to synchronize the left directory to the content of a file server (like a download). Alternatively, it is useful to make a backup from the right directory to the left directory. NOTE: Do NOT use this option to synchronize a desktop and a notebook (&eg; files that exist only on the left side will be deleted!).
fr: <guilabel>Asymétrique</guilabel> : le <guilabel>dossier gauche</guilabel> est le dossier cible, le <guilabel>dossier droite</guilabel> est le dossier source. Ces fonctionnalités synchronisent le contenu du dossier de gauche au dossier de droite. <itemizedlist> <listitem> <para>Les fichiers qui existent seulement sur le coté gauche seront supprimés.</para> </listitem> <listitem> <para>Les fichiers qui existent seulement sur le coté droit seront copiés vers le coté gauche.</para> </listitem> <listitem> <para>Les fichiers considérés comme identiques restent non modifiés.</para> </listitem> <listitem> <para>Ces fichiers considérés comme différents seront copiés vers le coté gauche. Utilisez cette fonctionnalité avec précaution !</para> </listitem> </itemizedlist>Cette fonctionnalité est utile si la date du dossier de droite est inutilisable, ou pour synchroniser le dossier de gauche au contenu du serveur de fichiers (comme un téléchargement). Autrement, il est utile de faire une sauvegarde depuis le dossier de droite vers le dossier de gauche. REMARQUE : n'utilisez PAS cette option pour synchroniser un bureau et un notebook (&pex; les fichiers qui existent seulement sur le coté gauche seront supprimés !).

source: <guilabel>Automatic Scrolling</guilabel>: This is for slow &FTP; servers, ... When the Synchronizer has finished comparing a file, it puts the file into the end of the list at once and scrolls the window, if necessary. It is important, if you want to know what the Synchronizer is doing. If the &FTP; server is slow, the comparison of a directory may take a lot of time. By turning this option on, you can see that the comparator is "alive", but slow. For fast file systems, it can reduce the speed of comparing slightly.
fr: <guilabel>Scrolling automatique</guilabel> : pour les serveurs FTP lents. Quand la synchronisation a terminé la comparaison d'un fichier, il met aussitôt le fichier à la fin de la liste et fait défiler la fenêtre, si nécessaire. C'est important, si vous voulez savoir ce que la synchronisation est en train de faire. Si le server FTP est lent, la comparaison du dossier peut prendre plus de temps. En activant cette option, vous pouvez voir que la comparaison est en vie, mais lente. Pour les systèmes de fichiers rapides, cela peut réduire légèrement la vitesse de comparaison.

source: <guilabel>Ignore Case</guilabel>: Case insensitive filename compare, this is useful when synchronizing &Windows; filesystems.
fr: <guilabel>Ignorer la casse</guilabel> : comparaison de noms de fichiers en majuscule / minuscule. C'est utile pour la synchronisation des systèmes de fichiers &Windows;

source: <guilabel>Ignore hidden files</guilabel>: Ignores files that start with a dot.
fr: <guilabel>Ignorer les fichiers cachés</guilabel> : ignorer les fichiers qui commencent avec un point.

source: When everything mentioned above is done, click on the <guibutton>Compare</guibutton> button to compare the directories, the results are displayed in the <guilabel>File List</guilabel>.
fr: Quand tout ce qui est mentionné ci-dessus est fait, cliquez sur le bouton <guibutton>Comparer</guibutton> pour comparer les dossiers, les résultats sont affichés dans la <guilabel>liste de fichiers</guilabel>.

source: File List
fr: Liste de fichiers

source: The <guilabel>File List</guilabel> has the following columns: "Left name | Left size | Left time | Task | Right time | Right size | Right name". Here you can check the compare results and modify the synchronisation actions if desired. The text color defines the default copy direction determined by the comparator. <itemizedlist> <listitem> <para>Green: Copy from left to right.</para> </listitem> <listitem> <para>Blue: Copy from right to left or delete on the right side in asymmetric mode.</para> </listitem> <listitem> <para>Red: Files which are different by the given criteria (no copy direction).</para> </listitem> <listitem> <para>Black: Files which are identical (no copy direction).</para> </listitem> </itemizedlist> A double click on a file calls the &krusader;s <guilabel>Compare by content</guilabel> function. The Tasks (&lt;=&gt;) column defines the default copy direction, which can be modified by the user if needed. The results window supports dragging items to other windows ( drag [left], SHIFT+drag [right] ) and copy left/right selected items to clipboard (<keycombo action="simul">&Ctrl;<keycap>c</keycap></keycombo>).
fr: La <guilabel>liste de fichiers</guilabel> possède les colonnes suivantes : « Nom de gauche | Taille de gauche | Date de gauche | Tâche | Date de droite | Taille de droite | Nom de droite ». Vous pouvez vérifier ici les résultats de comparaison et modifier les actions de synchronisation si désiré. La couleur du texte définit la direction de copie par défaut déterminé par la comparaison.<itemizedlist> <listitem> <para>Vert : copier de la gauche vers la droite.</para> </listitem> <listitem> <para>Bleu : copier de la droite vers la gauche ou supprimer sur le coté droit dans le mode asymétrique.</para> </listitem> <listitem> <para>Rouge : les fichiers qui sont différents par le critère donné (pas de direction de copie).</para> </listitem> <listitem> <para>Noir : les fichiers qui sont identiques (pas de direction de copie).</para> </listitem> </itemizedlist>Un double-clic sur un fichier appelle la fonctionnalité <guilabel>Comparer par contenu</guilabel>. La colonne des tâches (&lt;=&gt;) définit la direction de copie par défaut, qui peut être modifié par l'utilisateur si besoin. La fenêtre de résultats gère les éléments glissés vers d'autres fenêtres (glisser [gauche], &MAJ; + glisser [droite]) et copie les éléments sélectionnés de la gauche / droite vers le presse-papiers(<keycombo action="simul">&Ctrl;<keycap>c</keycap></keycombo>).

source: <guilabel>File List</guilabel>: Tasks (&lt;=&gt;) column
fr: <guilabel>Liste de fichiers</guilabel> : Colonne de tâche (&lt;=&gt;)

source: This column displays the task that is planned for the Synchronizer, this task can be modified with the <link linkend="synccomp_right-click">right click menu</link>.
fr: Cette colonne affiche la tâche qui est planifiée pour la synchronisation, cette tâche peut être modifiée avec le <link linkend="synccomp_right-click">menu par clic-droit</link>.

source: <guibutton>-&gt;</guibutton>: Copy from the left side to the right side. For directories: <command>mkdir</command> in the right side.
fr: <guibutton>-&gt;</guibutton> : copier du coté gauche vers le coté droit. Pour les dossiers : <command>mkdir</command> dans le coté droit.

source: <guibutton>=</guibutton>: The files are the same, do not do anything.
fr: <guibutton>=</guibutton> : les fichiers sont identiques, ne rien faire.

source: <guibutton>!=</guibutton>: The file is excluded, or the Synchronizer does not know what to do.
fr: <guibutton>!=</guibutton> : le fichier est exclu, ou la synchronisation ne sait pas quoi faire.

source: <guibutton>&lt;-</guibutton>: copy from the right side to the left side. For directories: <command>mkdir</command> in the left side
fr: <guibutton>&lt;-</guibutton> : copier du coté droit vers le coté gauche. Pour les dossiers : <command>mkdir</command> dans le coté gauche.

source: <guibutton>DEL</guibutton>: delete files from the right side.
fr: <guibutton>SUPPR</guibutton> : supprimer les fichiers depuis le coté droit.

source: Show options
fr: Afficher les options

source: Here you can include/exclude particular file types. Those files, that are not in the list, will be untouched at synchronization.
fr: Vous pouvez inclure et exclure ici des types de fichiers particuliers. Ces fichiers, qui ne sont pas dans la liste, seront non modifiés à la synchronisation.

source: <guibutton>-&gt;</guibutton>: Enable/Disable the copy task from left to right.
fr: <guibutton>-&gt;</guibutton> : activer et désactiver la tâche de copie de gauche à droite.

source: <guibutton>=</guibutton>: Enable/Disable listing the equal files.
fr: <guibutton>=</guibutton> : activer et désactiver le listage des fichiers identiques.

source: <guibutton>!=</guibutton>: Enable/Disable listing the excluded / "don't know what to do" files.
fr: <guibutton>!=</guibutton> : activer et désactiver le listage des fichiers exclus / « ne sait pas quoi faire ».

source: <guibutton>&lt;-</guibutton>: Enable/Disable the copy task from right to left.
fr: <guibutton>&lt;-</guibutton> : activer et désactiver la tâche de copie de droite à gauche.

source: <guibutton>Trash</guibutton>: Enable/Disable the file deleting from the left side task.
fr: <guibutton>Corbeille</guibutton> : activer et désactiver le fichier supprimé depuis la tâche du coté gauche.

source: <guibutton>Duplicates</guibutton>: Enable/Disable those files that exist on both sides.
fr: <guibutton>Dupliqués</guibutton> : active et désactive ces fichiers qui existent sur les deux cotés.

source: <guibutton>Singles</guibutton>: Enable/Disable those files that exist only on one side.
fr: <guibutton>Simples</guibutton> : active et désactive ces fichiers qui n'existe que sur un coté.

source: Action buttons
fr: Boutons d'actions

source: <guibutton>Compare</guibutton>: Compares the directories, the results are displayed on the <guilabel>File List</guilabel>.
fr: <guibutton>Comparer</guibutton> : compare les dossiers, les résultats sont affichés sur la <guilabel>liste de fichiers</guilabel>.

source: <guibutton>Stop</guibutton>: Stops comparing.
fr: <guibutton>Arrêter</guibutton> : terminer la comparaison.

source: <guibutton>Synchronize</guibutton>: Shows the synchronize dialog.
fr: <guibutton>Synchroniser</guibutton> : affiche la boîte de dialogue de synchronisation.

source: <guibutton>Close</guibutton>: Closes the Synchronizer window.
fr: <guibutton>Fermer</guibutton> : ferme la fenêtre de synchronisation.

source: The Status line may contain
fr: Cette line d'état peut contenir

source: The number of scanned directories while comparing.
fr: Le nombre de dossiers scannés pendant la comparaison.

source: The filename when comparing by content (for big files).
fr: Le nom de fichier lors de la comparaison par contenu (pour les gros fichiers).

source: The number of files on the list.
fr: Le nombre de fichiers sur la liste.

source: Right click menu on the <guilabel>File List</guilabel>
fr: Le menu par clic-droit sur la <guilabel>liste de fichiers</guilabel>.

source: The right click menu is split up in three sections:
fr: Le menu par clic-droit est divisé en trois sections :

source: 1. change the <guilabel>Task</guilabel> operations determined by the Comparator. Select one or multiple files. The change will be applied on the selection and not only on the right clicked item. If the selected item is a directory, the change will be applied on its files/subdirectories as well.
fr: 1. Modifier les opérations de <guilabel>tâche</guilabel>déterminé par la comparaison. Sélectionner un ou plusieurs fichiers. La modification s'appliquera sur la sélection et pas seulement sur l'élément droit cliqué. Si l'élément sélectionné est un dossier, la modification s'appliquera aussi sur ses fichiers et sous-dossiers.

source: <guibutton>Synchronize Directories</guibutton>: Starts synchronization.
fr: <guibutton>Synchroniser les dossiers</guibutton> : démarre la synchronisation.

source: <guibutton>Exclude</guibutton>: Excludes a file/dir from synchronization ( task change to != ).
fr: <guibutton>Exclure</guibutton> : exclut un fichier ou dossier de la synchronisation (la tâche est modifié en « != »).

source: <guibutton>Restore original operation</guibutton>: Task change to the original result of comparison.
fr: <guibutton>Restorer l'opération originale</guibutton> : la tâche modifie le résultat de comparaison original.

source: <guibutton>Reverse direction</guibutton>: Task change ( -&gt; to &lt;-, and &lt;- to -&gt; ).
fr: <guibutton>Retourner la direction</guibutton> : la tâche se modifie ( -&gt; vers &lt;-, et &lt;- vers -&gt; ).

source: <guibutton>Copy from right to left</guibutton>: Task change to &lt;-.
fr: <guibutton>Copier de droite à gauche</guibutton> : la tâche se modifie vers &lt;-.

source: <guibutton>Copy from left to right</guibutton>: Task change to -&gt;.
fr: <guibutton>Copier de gauche à droite</guibutton> : la tâche se modifie vers-&gt;.

source: <guibutton>Delete ( left single )</guibutton>: Task change to DEL.
fr: <guibutton>Supprimer (à gauche simple)</guibutton> : la tâche se modifie pour SUPPR.
