Repository: CodeCollect/krusader
Catalog: doc/i18n/*/user-interface.docbook.po
Languages: fr

source: <title>User Interface</title>
fr: <title>Interface utilisateur</title>

source: <primary>User Interface</primary>
fr: <primary>Interface utilisateur</primary>

source: OFM User Interface
fr: Interface utilisateur OFM

source: The OFM file manager concept contains <link linkend="features">many features</link> that make them powerful enough to belong among the best file managers today. The interface is simple: left panel, right panel and a command line below. Because of interaction between these three items the file managing will become more efficient.
fr: Le concept de gestionnaire de fichiers OFM contient de <link linkend="features">nombreuses fonctionnalités</link> qui les rendent suffisamment puissantes pour être parmi les meilleurs gestionnaires de fichiers aujourd'hui.

source: If you would like to know <ulink url="http://www.softpedia.com/reviews/linux/Krusader-Review-18193.shtml"> how &krusader; works</ulink> you can try it yourself, just install it on your computer. To accept an <ulink url="http://www.softpanorama.org/OFM/index.shtml">Orthodox File Manager (OFM)</ulink> like &krusader;, the user needs to get used to <emphasis>new ideas</emphasis> that are actually already 20 years old. If you prefer to waste time and lose a lot of productivity, you can always continue to use one panel file managers that are based on &Windows; Explorer.
fr: Si vous aimeriez savoir <ulink url="http://www.softpedia.com/reviews/linux/Krusader-Review-18193.shtml"> comment &krusader; fonctionne</ulink>, vous pouvez l'essayer vous-même, installez le simplement sur votre ordinateur. Pour adopter un <ulink url="http://www.softpanorama.org/OFM/index.shtml">gestionnaire de fichiers orthodoxe (Orthodox File Manager - OFM)</ulink> comme &krusader;, l'utilisateur a besoin d'utiliser les <emphasis>nouvelles idées</emphasis> qui actuellement datent de 20 ans. Si vous préférez perdre du temps et de la productivité, vous pouvez toujours continuer à utiliser des gestionnaires à un panneau qui sont fondés sur l'Explorer de &Windows;.

source: <title>&krusader; Main Window</title>
fr: <title>Fenêtre principale de &krusader;</title>

source: <phrase>&krusader; Main Window</phrase>
fr: <phrase>Fenêtre principale de &krusader;</phrase>

source: The User Interface is based on <ulink url="http://www.softpanorama.org/OFM/index.shtml">Orthodox File Manager (OFM)</ulink> paradigm, a 20- year old principle that has proven its bones. It is known as simple, easy and powerful. In the following sections we will cover the basic functions of each part with the exception of:
fr: L'interface utilisateur est fondée sur le paradigme du <ulink url="http://www.softpanorama.org/OFM/index.shtml">gestionnaire de fichiers orthodoxe (OFM)</ulink>, un vieux principe qui a fait ses preuves. Il est reconnu comme simple, facile et puissant. Dans les sections suivantes, nous couvrirons les fonctionnalités basiques de chaque partie à l'exception de :

source: The <link linkend="menu-commands">Menu Bar</link> which has a chapter of its own.
fr: La <link linkend="menu-commands">barre de menus</link> qui a son propre chapitre.

source: The <link linkend="bookman">Bookmarks</link> which has a chapter of its own.
fr: Les <link linkend="bookman">signets</link> qui a son propre chapitre.

source: The <emphasis role="bold">Status Bar</emphasis> shows the properties of the current file (that is being) in focus. You can use "drag and drop" to drop a &URL; "into" the Status Bar.
fr: La <emphasis role="bold">barre d'état</emphasis> affiche les propriétés du fichier courant (qui sont affichés) dans le focus. Vous pouvez utiliser le « glisser-déposer » pour déplacer un &URL; dans la barre d'état.

source: Toolbars
fr: Barre d'outils

source: &krusader; comes with several Toolbars.
fr: &krusader; est fourni avec plusieurs barre d'outils.

source: <title>Main Toolbar</title>
fr: <title>La barre principale</title>

source: Toolbar
fr: Barre d'outils

source: <secondary>Main Toolbar</secondary>
fr: <secondary>La barre principale</secondary>

source: <phrase>Main Toolbar</phrase>
fr: <phrase>La barre principale</phrase>

source: The &krusader; Main Toolbar, is a standard &kde; toolbar that can be dragged around the application or configured via a <keycap>Right-Click</keycap> menu. You can decide whether or not you want to display it each time you start &krusader; in the <link linkend="konfigurator">Konfigurator Startup page</link>, and you can toggle its use in the current session in the <link linkend="view-menu">View menu</link>. The Main Toolbar contents can be configured from the <guimenuitem>Configure Toolbars</guimenuitem> in the <link linkend="settings-menu">Settings menu</link> or the <guilabel>Toolbar</guilabel> tab in the <link linkend="konfig-looknfeel">Konfigurator Look &amp; Feel page</link>. Since various commands and options in &krusader; are context-dependent, some commands are not always available. The icon of an inappropriate or inactive action will be deactivated (grayed-out) disabling its use. <link linkend="bookman">Bookmarks</link> can be placed into the Main Toolbar and the Actions Toolbar with the mouse using "drag and drop".
fr: La barre principale de &krusader; est une barre d'outils standard de &kde; qui peut être glissée sur l'application ou configurée avec un menu par <keycap>clic-droit</keycap>. Vous pouvez décider si vous voulez l'afficher chaque fois que vous démarrez &krusader;, dans la <link linkend="konfigurator">page de démarrage de Konfigurator</link>, et vous pouvez la cacher ou l'afficher dans la session courante dans le menu <link linkend="view-menu">affichage</link>. La contenu de la barre principale peut être configuré depuis <guimenuitem>Configurer les barres d'outils</guimenuitem> dans le menu <link linkend="settings-menu">configuration</link> ou l'onglet <guilabel>barre d'outils</guilabel> dans la <link linkend="konfig-looknfeel">page apparence &amp; ergonomie de Konfigurator</link>. Depuis que diverses commandes et options dans &krusader; sont dépendantes d'un contexte, des commandes ne sont pas toujours disponibles. L'icône de l'action inappropriée ou inactive sera désactivée (en gris) désactivant son utilisation. Les <link linkend="bookman">signets</link> peuvent être placés dans la barre principale et la barre d'actions avec la souris en utilisant le « glisser-déposer ».

source: <title>Actions Toolbar</title>
fr: <title>Barre d'actions</title>

source: <secondary>Actions Toolbar</secondary>
fr: <secondary>Barre d'actions</secondary>

source: <link linkend="useractions">UserActions</link> and <link linkend="bookman">Bookmarks</link> can be "plugged" into the <guilabel>Actions Toolbar</guilabel>. To show it, use <emphasis role="bold"> <menuchoice> <guimenu>View</guimenu> <guimenuitem>Show Actions Toolbar</guimenuitem> </menuchoice> </emphasis>. To add user actions, use <emphasis role="bold"> <menuchoice> <guimenu>Settings</guimenu> <guimenuitem>Configure Toolbars</guimenuitem> </menuchoice> </emphasis> and select Actions Toolbar. You can, for example, drag the Actions Toolbar to the right side using the mouse.
fr: Les <link linkend="useractions">Actions utilisateurs</link> et les <link linkend="bookman">signets</link> peuvent être ajoutés dans la <guilabel>barre d'actions</guilabel>. Pour l'afficher, utilisez <emphasis role="bold"> <menuchoice> <guimenu>Affichage</guimenu> <guimenuitem>Afficher la barre d'actions</guimenuitem> </menuchoice> </emphasis>. Pour ajouter des actions utilisateurs, utilisez <emphasis role="bold"> <menuchoice> <guimenu>Configuration</guimenu> <guimenuitem>Configurer les barre d'outils</guimenuitem> </menuchoice> </emphasis> et sélectionnez la barre d'actions. Vous pouvez, par exemple, glisser la barre d'actions sur le coté droit en utilisant la souris.

source: <title>Location Toolbar</title>
fr: <title>Barre d'emplacement</title>

source: <secondary>Location Toolbar</secondary>
fr: <secondary>Barre d'emplacement</secondary>

source: <title>Panel Toolbar</title>
fr: <title>Barre d'outils du panneau</title>

source: <secondary>Panel Toolbar</secondary>
fr: <secondary>Barre d'outils du panneau</secondary>

source: Each panel has a <link linkend="konfig-looknfeel-ptoolbar">configurable Panel Toolbar</link>. The complete Panel Toolbar or specific buttons can be made visible or be hidden.
fr: Chaque panneau a une <link linkend="konfig-looknfeel-ptoolbar">barre d'outils configurable</link>. La barre d'outils du panneau complet ou des boutons spécifiés peuvent être rendus visible ou caché.

source: <guibutton>OpenDir Button</guibutton>: opens the directory browser.
fr: <guibutton>Ouvrir le sélecteur de fichiers</guibutton> : permet de choisir un dossier dans le navigateur de fichiers.

source: <guibutton>Equals Button (=)</guibutton>: changes the panel directory to the other panel directory.
fr: Le bouton <guibutton>Identique (=)</guibutton> : modifie le dossier du panneau à l'identique du panneau opposé.

source: <guibutton>Up Button (..)</guibutton>: changes the panel directory to the parent directory.
fr: Le bouton <guibutton>Haut (..)</guibutton> : modifie le dossier du panneau pour le dossier parent.

source: <guibutton>Home Button (~)</guibutton>: changes the panel directory to the home directory.
fr: Le bouton <guibutton>Dossier personnel (~)</guibutton> : modifie le dossier du panneau pour le dossier personnel.

source: <guibutton>Root Button (/)</guibutton>: changes the panel directory to the root directory.
fr: Le bouton <guibutton>Superutilisateur (root) (/)</guibutton> : modifie le dossier du panneau pour le dossier racine (/).

source: <guibutton>Sync-browsing Button</guibutton>: when active, each directory change in the specific panel is performed in the other panel as well.
fr: Le bouton <guibutton>de la navigation synchronisée</guibutton> : si activé, chaque dossier modifié dans le panneau spécifique l'est aussi dans l'autre panneau.

source: Panels
fr: Panneaux

source: The &krusader; panels are where most of the action takes place. Currently, there are two types of panels: <itemizedlist> <listitem> <para><link linkend="list_panel">List Panel</link>: shows the files and directories.</para> </listitem> <listitem> <para><link linkend="popup_panel">PopUp Panel</link>: has several display modes: Preview, Tree, Quickselect, View and Disk Usage for the file or directory that has the focus. The PopUp Panel may be left open or closed, as desired.</para> </listitem> </itemizedlist>&krusader; is a "twin-panel" file manager so there are two panels: the "Left" panel and the "Right" panel, or a more important logical distinction, the *Active* panel and the *Inactive* panel. The active panel is the one that will accept your mouse and keyboard input. If you choose a command from the <guilabel>Menu-Bar</guilabel> or <guilabel>Toolbar</guilabel> the command will act upon the selected files/directories in the active panel. You can switch between panels using the &Tab; key or by clicking on the <guilabel>Information or Totals labels</guilabel>, or by selecting any file in a panel with the mouse. As always, default startup settings can be modified with the <link linkend="konfigurator">Konfigurator Startup page</link>, and you control the current session with the <link linkend="view-menu">View menu</link>.
fr: Les panneaux &krusader; sont les emplacements où s'affichent la plupart des actions. Habituellement, il y a deux types de panneaux : <itemizedlist> <listitem> <para><link linkend="list_panel">Panneau en liste</link> : affiche les fichiers et les dossiers.</para> </listitem> <listitem> <para>Le <link linkend="popup_panel">Panneau en menu contextuel</link> a plusieurs modes d'affichage : aperçu, arborescence, sélection rapide, affichage et utilisation du disque pour le fichier ou le dossier qui a le focus. Le panneau par menu contextuel peut être ouvert ou fermé, comme désiré.</para> </listitem> </itemizedlist>&krusader; est un gestionnaire de fichiers à deux panneaux : le panneau de gauche et le panneau de droite, une distinction logique plus importante, le panneau ACTIF et le panneau INACTIF. Le panneau actif est celui qui acceptera la souris et les entrées clavier. Si vous choisissez une commande depuis la <guilabel>barre de menus</guilabel> ou la <guilabel>barre d'outils</guilabel> la commande se conformera au dossiers / fichiers sélectionnés dans le panneau actif. Vous pouvez naviguer entre les panneaux en utilisant la touche &Tab; ou en cliquant sur les <guilabel>titres des panneaux</guilabel>, ou en sélectionnant un fichier dans un panneau avec la souris. Comme toujours, la configuration de démarrage par défaut peut être modifié avec la <link linkend="konfigurator">page de démarrage de Konfigurator</link>, et vous contrôlez la session courante avec le menu <link linkend="view-menu">affichage</link>.

source: <title>List Panel</title>
fr: <title>Panneau en liste</title>

source: <phrase>List Panel</phrase>
fr: <phrase>Panneau en liste</phrase>

source: Panel
fr: Panneau

source: <secondary>List Panel</secondary>
fr: <secondary>Panneau en liste</secondary>

source: This is the default panel and the one you will probably use most of the time. This panel shows the contents of one directory which can be local (part of your mounted file systems, either a native file or the files inside an archive) or remote files (accessed via &FTP; or Samba). There are two modes: <link linkend="view-menu">Detailed View</link> that shows the file names, file size, creation date and time and their attributes. And <link linkend="view-menu">Brief View</link> that shows only the file names, the number of brief columns can be changed, by right clicking on the <guilabel>Name</guilabel> header. File copy/paste/cut via clipboard between &konqueror; and &krusader; <keycombo action="simul">&Ctrl; <keycap>c</keycap></keycombo>, <keycombo action="simul">&Ctrl; <keycap>v</keycap></keycombo>, <keycombo action="simul">&Ctrl; <keycap>x</keycap></keycombo> is supported. <keycombo action="simul">&Alt;&Ctrl; <keycap>r</keycap></keycombo> toggles the <guilabel>List Panel</guilabel> between horizontal and vertical mode.
fr: C'est le panneau par défaut et celui que vous utiliserez probablement la plupart du temps. Ce panneau affiche le contenu d'un dossier qui peut être local (une partie de vos systèmes de fichiers montés, soit un un fichier natif ou les fichiers dans une archive) ou des fichiers distants (accessibles depuis un &FTP; ou avec Samba). Il y a deux modes : <link linkend="view-menu">Vue détaillée</link> qui affiche les noms de fichiers, la taille, la date de création et l'heure et leurs attributs. Et la <link linkend="view-menu">Vue en lignes</link> qui affiche seulement les noms de fichiers, le nombre de colonnes peut être modifié avec un clic-droit sur l'en-tête <guilabel>Nom</guilabel>. Copier / coller / couper un fichier avec le presse-papiers entre &konqueror; et &krusader; <keycombo action="simul">&Ctrl; <keycap>c</keycap></keycombo>, <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo>, <keycombo action="simul">&Ctrl; <keycap>X</keycap></keycombo> est géré. <keycombo action="simul">&Alt;&Ctrl; <keycap>R</keycap></keycombo> active le <guilabel>panneau en liste</guilabel> entre le mode vertical et horizontal.

source: Some useful <guilabel>List panel</guilabel><link linkend="key_bindings">Key-Bindings</link>:
fr: Quelques <link linkend="key_bindings">raccourcis clavier</link> utiles du panneau en liste :

source: <keycombo action="simul">&Ctrl; <keycap>r</keycap></keycombo> will refresh the panel.
fr: <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> rafraîchira le panneau.

source: Focus a file or directory on the left panel, press <keycombo action="simul">&Ctrl; <keycap>Left arrow</keycap></keycombo> and the right panel changes:
fr: Pour avoir le focus sur un fichier ou un dossier sur le panneau de gauche, cliquez sur <keycombo action="simul">&Ctrl; <keycap>flèche gauche</keycap></keycombo> et le panneau de droite se modifie :

source: On a file: the right panel gets the same path as the left panel.
fr: Sur un fichier : le panneau de droite affiche le même emplacement que le panneau de gauche.

source: On a directory: refreshes the right panel with the contents of the directory.
fr: Sur un dossier : rafraîchit le panneau de droite avec le contenu du dossier.

source: For the right panel: press <keycombo action="simul">&Ctrl; <keycap>Right arrow</keycap></keycombo> and the left panel will change.
fr: Pour le panneau de droite : cliquez sur <keycombo action="simul">&Ctrl; <keycap>flèche droite</keycap></keycombo> et le panneau de gauche se modifiera.

source: PopUp Panel
fr: Panneau en menu contextuel

source: PopUp Panel (3rd Panel)
fr: Le troisième panneau : fenêtre de hiérarchie des dossiers

source: Folder History
fr: Historique des dossiers

source: Both panels remember recently visited folders. Click on the <guibutton>"Folder history"</guibutton> button ("watch" symbol) to open the folder history list. Here you can quickly change to previously visited folders. The currently focused folder is checked. On every new start of &krusader;, the history list is empty.
fr: Les deux panneaux se souviennent des dossiers visités récemment. Cliquez sur le bouton<guibutton>Ouvrir l'historique des dossiers</guibutton> symbolisé par une icône de montre pour ouvrir la liste d'historique. Vous pouvez modifier rapidement les dossiers précédemment visités. Le dossier courant qui a le focus est activé. À chaque nouveau démarrage de &krusader;, la liste d'historique est vide.

source: Command Line / Terminal Emulator
fr: Ligne de commande / Émulateur de terminal

source: This part of the <link linkend="gloss-gui">GUI</link> can have four modes: Command Line, Terminal Emulator, show both and show none. You can choose your mode of operation either on start-up with the <link linkend="konfigurator">Konfigurator Startup page</link>, or for the current session with the <link linkend="view-menu">View menu</link> .
fr: Cette partie du <link linkend="gloss-gui">GUI</link> peut avoir quatre modes : ligne de commande, émulateur de terminal, afficher les deux et n'en afficher qu'une seule. Vous pouvez choisir votre mode d'opération soit au démarrage avec la <link linkend="konfigurator">page de démarrage de Konfigurator</link>, ou pour la session courante avec le menu <link linkend="view-menu">Affichage</link>.

source: Command Line
fr: Ligne de commande

source: Command line
fr: Ligne de commande

source: The traditional command line mode offers a single line of input to enter commands, it also features three buttons: <itemizedlist> <listitem> <para><guibutton>"command history"</guibutton> (down arrow) to quick open previous used commands </para> </listitem> <listitem> <para><guibutton>"Useraction expander"</guibutton> (green plus button) to add easy <link linkend="useractions">Useraction placeholders</link> </para> </listitem> <listitem> <para><guibutton>"run in terminal mode"</guibutton> (console icon) button with the next options: <itemizedlist> <listitem><para>Start and Forget</para> </listitem> <listitem><para>Display Separated Standard and Error Output</para> </listitem> <listitem><para>Display Mixed Standard and Error Output</para> </listitem> <listitem><para>Start in New Terminal</para> </listitem> <listitem><para>Send to Embedded Terminal Emulator</para> </listitem> </itemizedlist> </para> </listitem> </itemizedlist> When you start typing your commands, the command line auto-completion feature will make its offers according to what you choose in the &kcontrolcenter;. If you want to change the way auto-complete behaves in the current &krusader; session, <keycap>right click</keycap> on the command line and change it. To the left of the input line you can find the local path that the active panel is currently pointing to. This path is where your command will be executed. Typing <userinput> <command>cd</command> <replaceable> &lt;directory&gt;</replaceable> </userinput> in the command line will also cause the active panel to point to this directory. Click <link linkend="cmdline_keybindings">here</link> to view the command line keybindings.
fr: Le traditionnel mode de ligne de commande offre une ligne simple d'entrée pour saisir les commandes, il offre aussi trois boutons : <itemizedlist> <listitem> <para><guibutton>Historique de commandes</guibutton> : la flèche située à droite de la boîte de commande pour afficher rapidement les commandes précédemment utilisées.</para> </listitem> <listitem> <para><guibutton>Actions utilisateur étendues</guibutton> (le bouton + vert) pour ajouter facilement des <link linkend="useractions">des substituants d'actions utilisateur</link> </para> </listitem> <listitem> <para>Le bouton <guibutton>Lancer un terminal</guibutton> (l'icône de console) avec les options suivantes : <itemizedlist> <listitem><para>Démarrer puis mettre en arrière plan</para> </listitem> <listitem> <para>Afficher la sortie d'erreur standard séparée</para> </listitem> <listitem> <para>Afficher la sortie standard et la sortie d'erreur ensemble</para> </listitem> <listitem> <para>Démarrer dans un nouveau terminal</para> </listitem> <listitem> <para>Envoyer à l'émulateur de terminal embarqué</para> </listitem> </itemizedlist> </para> </listitem> </itemizedlist> Quand vous commencez à saisir vos commandes, la fonctionnalité d'auto-complètement de la ligne de commande affiche ce que vous avez choisi dans le &kcontrolcenter;. Si vous voulez modifier le comportement de l'auto-complètement dans la session courante de &krusader;, <keycap>cliquez-droit</keycap> sur la ligne de commande et modifiez la.Á la gauche de la ligne de commande vous pouvez trouver l'emplacement local que le panneau actif affiche. La commande va se réaliser dans cet emplacement. Saisir <userinput> <command>cd</command> <replaceable> &lt;dossier&gt;</replaceable> </userinput> dans la ligne de commande permet au panneau actif d'afficher l'emplacement dans ce dossier. Cliquez <link linkend="cmdline_keybindings">ici</link> pour afficher les raccourcis de ligne de commande.

source: Terminal Emulator
fr: Émulateur de terminal

source: Terminal emulator
fr: Émulateur de terminal
