Repository: CodeCollect/krusader
Catalog: doc/i18n/*/useractions.docbook.po
Languages: fr

source: <title>UserActions</title>
fr: <title>Actions utilisateur</title>

source: <primary>UserActions</primary>
fr: <primary>Actions utilisateur</primary>

source: With ActionMan you can set up, configure and manage UserActions. Some general settings are configured with <link linkend="konfig-useractions">Konfigurator</link>. With UserActions you can perform actions on files in the panel or to access &krusader; internal functions with parameters directly using placeholders. The actions integrate seamlessly into &kde;'s action system, which means that the standard Edit Toolbar and Edit Shortcut dialogs will show UserActions, too. The UserActions are stored in <filename> ~/.kde/share/apps/krusader/useraction.xml</filename> (the file structure is documentated in doxygen headers of UserActionXML). Several <link linkend="useraction-xml">examples</link> are included in the documentation. UserActions can be edited / added / imported / exported by using ActionMan. The default UserActions are stored in <filename> ~/.kde/share/apps/krusader/useraction-examples.xml</filename>. UserActions can appear nearly everywhere where "normal" KActions can be placed. The actions integrate seamlessly into &kde; action system, which means that the standard Edit Toolbar and Edit Shortcut dialogs will show UserActions, too. They can even be placed in the menu bar, but for that the <filename>krusaderui.rc</filename> file must be edited. A few examples: <itemizedlist> <listitem> <para> <link linkend="useractions-menu">Useractions Menu</link> </para> </listitem> <listitem> <para><link linkend="useractions">User Menu</link></para> </listitem> <listitem> <para><link linkend="actions_toolbar">Actions Toolbar</link></para> </listitem> <listitem> <para>right click menus</para> </listitem> <listitem> <para>&etc;</para> </listitem> </itemizedlist>&krusader;'s UserActions tool is very powerful and customizable if you are familiar with writing UserActions in general.
fr: Avec ActionMan, vous pouvez régler, configurer et gérer vos actions utilisateur. Des paramètres généraux sont configurés avec <link linkend="konfig-useractions">Konfigurator</link>. Avec les actions utilisateurs, vous pouvez réaliser des actions sur des fichiers dans le panneau ou pour avoir accès directement aux fonctionnalités internes de &krusader; avec des paramètres utilisant des substituants. Les actions intègrent sans heurts avec le système d'actions de &kde; ce qui signifie que les boîtes de dialogue de la barre d'outils « Édition » et d'édition des raccourcis clavier afficheront les actions utilisateurs. Celles-ci sont stockées dans <filename> ~/.kde/share/apps/krusader/useraction.xml</filename> (la structure du fichier est documentée dans les en-têtes Doxygen de UserActionXML). Plusieurs <link linkend="useraction-xml">exemples</link> sont inclus dans la documentation. Les actions utilisateurs peuvent être modifiées / ajoutées / importées / exportées en utilisant ActionMan. Les actions utilisateur par défaut sont stockées dans <filename> ~/.kde/share/apps/krusader/useraction-examples.xml</filename>. Elle peuvent apparaître ======. Elle peuvent même être placées dans la barre de menu, mais pour cela, le fichier <filename>krusaderui.rc</filename> doit être modifié. Quelques exemples : <itemizedlist> <listitem> <para> <link linkend="useractions-menu">Menu Actions utilisateur</link> </para> </listitem> <listitem> <para><link linkend="useractions">Menu Utilisateur</link></para> </listitem> <listitem> <para><link linkend="actions_toolbar">Barre d'outils d'actions</link></para> </listitem> <listitem> <para>clic-droit sur les menus</para> </listitem> <listitem> <para>&etc;</para> </listitem> </itemizedlist> L'outil d'actions utilisateur est très puissant et personnalisable si vous êtes familiarisé avec l'écriture des actions utilisateur en général.

source: Several UserActions are provided by default. Please <link linkend="help_krusader">upload your favorite UserActions</link> so that they become available for the &krusader; community. Thanks! We provide also an <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=11">UserActions Forum</ulink>.
fr: De nombreuses actions utilisateur sont fournis par défaut. Veuillez <link linkend="help_krusader">envoyer vos actions utilisateur favorites</link> pour que celle-ci deviennent disponibles pour la communauté de &krusader;. Merci ! Nous fournissons aussi un <ulink url="http://www.krusader.org/phpBB/viewforum.php?f=11">forum d'actions utilisateur</ulink>.

source: Basically, UserActions are a method to call external programs with variable parameters. For example, you could have a UserAction with the following <command>xmms <option>--enqueue %aList("Selected")%</option></command> to enqueue all selected items of the active panel to the current instance of xmms. Additionally, there is limited access to &krusader; internal functions requiring parameters. For example, <command>%aPanelSize("80")%</command> will set the width of the active panel to 80% of the &krusader; mainwindow. Since the parameter of placeholders can contain other placeholders, few scripts are possible. However, scripting can be done with the <link linkend="javascript_console">JavaScript console</link>.
fr: Basiquement, les actions utilisateurs sont une méthode pour appeler des programmes externes avec des paramètres variables. Par exemple, vous pouvez avoir une action utilisateur avec la commande suivante - <command>xmms <option>--enqueue %aList("Selected")%</option></command> - pour mettre en file d'attente tous les éléments sélectionnés du panneau actif vers une instance de XMMS. En plus, il y a un accès limité aux fonctionnalités internes de &krusader; demandant des paramètres. Par exemple, <command>%aPanelSize("80")%</command> définira la largeur du panneau actif à 80% de la fenêtre principale de &krusader;. Depuis que les paramètres fictifs peuvent contenir d'autres substituants, quelques scripts sont possibles. Cependant, scripter pour être réalisé avec le <link linkend="javascript_console">terminal JavaScript</link>.

source: Managing UserActions
fr: Gestion des actions utilisateur

source: Open Konfigurator and choose "UserActions -&gt; ActionMan", in which you can add, edit, remove, import and export UserActions. <itemizedlist> <listitem> <para> <guimenuitem>Add Action</guimenuitem>: If you add an new action, you get an empty input mask where you can enter all the properties you desire. The action will be added as soon as you press <guimenuitem>Ok</guimenuitem>. Afterwards, the name is shown in the list on the left.</para> </listitem> <listitem> <para>To edit a UserAction: Select the UserAction on the left. Then choose it if you want to edit its properties. The changes will only take effect when you press <guimenuitem>OK</guimenuitem>.</para> </listitem> <listitem> <para> <guimenuitem>To remove a UserAction</guimenuitem>: Select the UserAction on the left and click the remove button.</para> </listitem> <listitem> <para> <guimenuitem>To import a UserAction</guimenuitem>: If you import some actions, they will be automatically added to your list. If there are name conflicts (the names have to be unique because these are the ID for &kde;'s action system), you are asked to resolve them. For this, the list on the left will only show the actions where conflicts exist. You can now give them new names or remove them.</para> </listitem> <listitem> <para> <guimenuitem>Export Action</guimenuitem>: If you export a UserAction you have to give a filename in which to store it. If it does not exist, it will be created. If the file already contains UserActions, the action you are exporting will be added to that file.</para> </listitem> </itemizedlist>All actions you have defined are now shown in the user menu and in &kde; dialogs for changing shortcuts and managing the toolbar. In addition, all actions available for the current item will also show up in the right click menu.
fr: Ouvrez Konfigurator et choisissez « Actions utilisateur / Gérer les actions utilisateur... », dans lequel vous pouvez ajouter, modifier, supprimer, importer et exporter les actions utilisateurs. <itemizedlist> <listitem> <para> <guimenuitem>Créer une nouvelle action utilisateur</guimenuitem> : si vous ajoutez une nouvelle action, vous v avez un masque vide où vous pouvez saisir toutes les propriétés que vous désirez. L'action sera ajoutée dès que vous appuyez sur le bouton <guimenuitem>Ok</guimenuitem>. Ensuite, le nom est affiché dans la liste sur la gauche.</para> </listitem> <listitem> <para>Pour modifier une action utilisateur : sélectionnez l'action utilisateur sur la gauche. Ensuite, choisissez la si vous voulez modifier ses propriétés. Les modifications prendront seulement effet quand vous appuyez sur le bouton <guimenuitem>Ok</guimenuitem>.</para> </listitem> <listitem> <para> <guimenuitem>Pour supprimer une action utilisateur</guimenuitem> sélectionnez l'action utilisateur sur la gauche et cliquez sur le bouton « Supprimer les actions utilisateurs sélectionnées ».</para> </listitem> <listitem> <para> <guimenuitem>Pour importer une action utilisateur</guimenuitem> : si vous importez des actions, elles seront automatiquement ajoutées à votre liste. S'il y a des conflits de noms (les noms doivent être unique parcequ'ils ont l'ID pour le système d'action &kde;), vous devez corriger cela vous-même. Pour cela, la liste sur la gauche n'affichera seulement que les actions où un conflit existe. Vous pouvez maintenant leur donner de nouveaux noms ou les supprimer.</para> </listitem> <listitem> <para> <guimenuitem>Exporter une action</guimenuitem> : si vous exportez une action utilisateur, vous devez leur donner un nom de fichier dans lequel les stocker. Si ce nom n'existe pas, il sera créé. Si le fichier contient toujours des actions utilisateur, l'action que vous exportez sera ajouté à ce fichier.</para> </listitem> </itemizedlist>Toutes les actions que vous avez définies sont maintenant affichées dans le menu utilisateur et dans les boîtes de dialogue de &kde; pour la modification des raccourcis clavier et la gestion de la barre d'outils. En plus, toutes les actions disponibles pour l'élément courant sera aussi affiché dans le menu par clic-droit.

source: Basic Properties
fr: Propriétés de base

source: <guimenuitem>"Distinct Name", "Title" and "Command line"</guimenuitem>are always required, all the other properties are optional.
fr: <guimenuitem>Un nom distinct, un titre et une ligne de commande</guimenuitem>sont toujours requis, toutes les autres options sont optionnelles.

source: <guimenuitem>Distinct Name</guimenuitem>: A unique name of the UserAction, used to identify it for &kde;'s action system.
fr: <guimenuitem>Nom distinct</guimenuitem> : un nom unique de l'action utilisateur, utilisé pour l'identifier dans les actions système de &kde;.

source: <guimenuitem>Icon button</guimenuitem>: The icon for your UserAction.
fr: <guimenuitem>Icône</guimenuitem>: le logo pour votre action utilisateur.

source: <guimenuitem>Category</guimenuitem>: Adds a category for a better overview. NOTE: This property is not used yet. It is planned to be used, but has not implemented yet.
fr: <guimenuitem>Catégorie</guimenuitem> : ajoute une catégorie pour une meilleur vue d'ensemble. REMARQUE : la propriété n'est pas utilisé pour le moment. Ceci est planifié pour le futur mais pas encore implanté.

source: <guimenuitem>Title</guimenuitem>: The title displayed in the menus or dialogs.
fr: <guimenuitem>Titre</guimenuitem> : le titre affiché dans les menus ou les boîtes de dialogue.

source: <guimenuitem>Tooltip</guimenuitem>: A tooltip for your UserAction, e.g. displayed in the toolbar on mouseover.
fr: <guimenuitem>Infobulle</guimenuitem> : une infobulle pour votre action utilisateur, &pex; affiché dans la barre d'outils sur le passage de la souris.

source: <guimenuitem>Description</guimenuitem>: A description of what the UserAction does. This is also displayed as <guimenuitem>What's This</guimenuitem> if you <keycombo action="simul"><keycap>Backspace</keycap> <keycap>F1</keycap></keycombo> click on your UserAction.
fr: <guimenuitem>Description</guimenuitem> : une description de ce que fait cette action utilisateur. Aussi affiché avec <guimenuitem>Qu'est-ce que c'est</guimenuitem> Si vous cliquez avec <keycombo action="simul"><keycap>Backspace</keycap> <keycap>F1</keycap></keycombo> sur vos actions utilisateur.

source: <guimenuitem>Use Tooltip checkbox</guimenuitem>: Uses the tooltip as description.
fr: <guimenuitem>Utiliser la case à cochée d'infobulle</guimenuitem>: Utilise l'infobulle comme description.

source: <guimenuitem>Command line</guimenuitem>: The command which will be executed. You can add placeholder using a GUI with the <guibutton>add</guibutton> button.
fr: <guimenuitem>Commande</guimenuitem> : la ligne de commande qui sera exécutée. Vous pouvez ajouter un substituant utilisant une interface graphique avec le bouton <guibutton>ajouter</guibutton> sur la droite.

source: <guimenuitem>Startpath</guimenuitem>: The working directory for the command which will be executed.
fr: <guimenuitem>Dossier de travail</guimenuitem> : le dossier de travail pour la commande qui sera exécutée.

source: <guimenuitem>Execution mode</guimenuitem>:
fr: <guimenuitem>Mode d'exécution</guimenuitem>:

source: <guimenuitem>Normal</guimenuitem>: Normal execution mode.
fr: <guimenuitem>Normal</guimenuitem> : mode d'exécution par défaut.

source: <guimenuitem>Run in terminal</guimenuitem>: Runs the command in the terminal.
fr: <guimenuitem>Exécuter dans un terminal</guimenuitem> : la commande se lance et ouvre un terminal.

source: <guimenuitem>Run in embedded terminal emulator</guimenuitem>: Runs the command in the embedded terminal.
fr: <guimenuitem>Exécuter dans l'émulateur de terminal embarqué</guimenuitem> : la commande se lance et ouvre un terminal embarqué.

source: <guimenuitem>Collect output</guimenuitem>: Collects the output of the executed program in a &GUI; window.
fr: <guimenuitem>Enregistrer la sortie</guimenuitem> : affiche le message de sortie du programme exécuté dans une fenêtre graphique.

source: <guimenuitem>Separate standard error</guimenuitem>: When "Collect output" is used the stdout and stderr are separately collected.
fr: <guimenuitem>Séparer la sortie erreur standard</guimenuitem> : si cette case est cochée, les messages de sortie et d'erreur sont affichés séparément.

source: <guimenuitem>Command accepts</guimenuitem>:
fr: <guimenuitem>La commande accepte</guimenuitem>:

source: <guimenuitem>Local files (no URLs)</guimenuitem>: Tells the placeholder it should return local addresses.
fr: <guimenuitem>Fichiers locaux uniquement (pas d'URL)</guimenuitem> : demande au substituant de retourner à l'adresse locale.

source: <guimenuitem>URLs (local and remote)</guimenuitem>: Tells the placeholder it should return &URL;s.
fr: <guimenuitem>URL (distants et locaux)</guimenuitem> : demande au substituant de retourner à l'URL.

source: <guimenuitem>Default shortcut</guimenuitem>: Configures a default shortcut for the UserAction.
fr: <guimenuitem>Raccourci par défaut</guimenuitem> : configure le raccourci par défaut pour l'action utilisateur.

source: <guimenuitem>Enabled</guimenuitem>: if checked, the useraction is shown in the <link linkend="useractions">User Menu</link>, otherwise the useraction will be hidden.
fr: <guimenuitem>Activé</guimenuitem> : si la case est cochée, l'action utilisateur est affichée dans le <link linkend="useractions">menu utilisateur</link>, sinon celle-ci est cachée.

source: Command-line syntax
fr: Syntaxe de la commande

source: Basically, everything you type in the command line will get executed (if you type "ls -l", "ls -l" gets executed). You have the possiblity to get a character string from &krusader; which represents the current state of the panel. This is done using placeholders. A placeholder begins with a percent-sign ('%') and is followed by a panel indicator ('a' for the active, 'o' for the other, 'l' for the left and 'r' for the right panel. If the placeholder doesn't need a panel to operate on, you have to indicate this by an underscore ('_')). Then comes the name of the placeholder (see the list below), which may get some parameters enclosed in quotes. Finally, again the percent sign.
fr: Basiquement, tout ce que vous saisissez en tant que commande sera exécutés (si vous saisissez « ls -l », « ls -l » sera exécuté). Vous avez la possibilité d'avoir une entrée de caractère de &krusader; qui représente l'état courant du panneau. Cela est permis en utilisant les substituants. Un substituant commence avec un signe de pourcentage (%) et est suivi par un indicateur de panneau (« a » pour le panneau actif, « o » pour l'autre, « I » pour celui de gauche et « r » pour celui de droite. Si le substituant n'a pas besoin d'un panneau pour réaliser une opération, vous devez l'indiquer avec un tiret (_)). Ensuite, vient le nom du substituant (voir la liste ci-dessous), qui doit donner des paramètres entre guillemets. Et enfin, le symbole %.

source: This sounds very complicated, so let's make an example: '%aList("Selected")%' is replaced by a list of all selected items in the active panel. So a command like 'xmms --enqueue %aList("All", " ", "", "*.mp3")%' will execute xmms with a list of all .mp3s in the current panel, separated by a single blank.
fr: Cela paraît assez compliqué, donnons donc un exemple : « %aList("Selected")% » est remplacé par une liste de tous les éléments sélectionnés dans le panneau actif. Une commande comme « xmms --enqueue %aList("All", " ", "", "*.mp3")% » exécutera xmms avec une liste de tous les fichiers mp3 dans le panneau courant, séparé par un blanc simple.
