Repository: CodeCollect/krusader
Catalog: doc/i18n/*/user-interface.docbook.po
Languages: fr

source: The terminal emulator mode is in fact a small console and acts like one. You can change the active directory in the terminal by using the <userinput> <command>cd</command> </userinput> command. The terminal emulator will follow the active panel directory. When you drag a file from the <interface>"List Panel"</interface>, you will get to choose between: "Paste", <command>cd</command>, <command>mv</command> and <command>ln</command>. If you drag multiple files, then <command>cd</command> will not be available. A full-screen terminal emulator can be used when <link linkend="konfig-looknfeel-operation">configured</link> or <keycombo action="simul">&Ctrl; <keycap>f</keycap></keycombo> toggles between normal and full screen mode. If the command line is hidden, press <keycombo action="simul">&Ctrl; <keycap>up</keycap></keycombo> to focus the terminal emulator. <keycombo action="simul">&Ctrl; <keycap>down</keycap></keycombo> brings you back down. <keycombo action="simul">&Ctrl; <keycap>Enter</keycap></keycombo> and <keycombo action="simul">&Ctrl; <keycap>Shift</keycap> <keycap>Enter</keycap></keycombo> paste the filename. You can close the emulator by typing <userinput> <command>exit</command> </userinput>.
fr: Le mode émulateur de terminal est en fait une petite console et se comporte comme tel. Vous pouvez modifier le dossier actif dans le terminal en utilisant la commande <userinput> <command>cd</command> </userinput>. L'émulateur de terminal suivra le dossier du panneau actif. Quand vous déplacez un fichier depuis le panneau, vous aurez le choix entre « Coller », <command>cd</command>, <command>mv</command> et <command>ln</command>. Si vous déplacez plusieurs fichiers, la commande <command>cd</command> ne sera pas disponible. Un émulateur de terminal en plein écran peut être utilisé s'il est <link linkend="konfig-looknfeel-operation">configuré</link> ou avec <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> qui agrandi ou réduit le mode d'affichage. Si la ligne de commande est cachée, appuyez sur <keycombo action="simul">&Ctrl;&Alt;<keycap>T</keycap></keycombo> pour afficher ou cacher l'émulateur de terminal. <keycombo action="simul">&Ctrl; <keycap>Entrée</keycap></keycombo> copie le nom de fichier et <keycombo action="simul">&Ctrl; <keycap>&Maj;</keycap> <keycap>Entrée</keycap></keycombo> copie l'adresse du nom de fichier. Vous pouvez fermer l'émulateur en saisissant <userinput> <command>exit</command> </userinput>.

source: Click <link linkend="termemu_keybindings">here</link> to view the Terminal emulator keybindings..
fr: Cliquez <link linkend="termemu_keybindings">ici</link> pour afficher les raccourcis clavier de l'émulateur de terminal.

source: <title>Function (FN) Keys Bar</title>
fr: <title>Barre de touches FN</title>

source: <phrase>Function (FN) Keys Bar</phrase>
fr: <phrase>Barre de touches FN</phrase>

source: <title>Folder Tabs</title>
fr: <title>Onglets de dossiers</title>

source: <phrase>Folder Tabs</phrase>
fr: <phrase>Onglets de dossiers</phrase>

source: With <guibutton>Folder Tabs</guibutton> you can quickly change to multiple folders; each panel has its own <guibutton>Folder Tabs</guibutton>. The <guibutton>Folder Tabs</guibutton> positions are saved when closing &krusader;. To switch between <guibutton>Folder Tabs</guibutton>, click them with the mouse. Squeezed <guibutton>Folder Tabs</guibutton> have tooltips to display the full path. The following <guibutton>Folder Tabs</guibutton> operations are available:
fr: Avec les <guibutton>onglets de dossiers</guibutton>, vous pouvez rapidement modifier de nombreux dossiers, chaque panneau a ses propres onglets de dossiers. Leurs positions sont enregistrées quand &krusader; est fermé. Pour naviguer entre les onglets, cliquez dessus avec la souris. Les onglets raccourcis ont des infobulles pour afficher l'emplacement complet. Les opérations suivantes sont disponibles :

source: To create a <keycap>"home" tab</keycap>: click on the <guibutton>Folder Tab Bookmark</guibutton> button.
fr: Pour créer un <keycap>onglet dans le dossier personnel</keycap> : cliquez sur le bouton <guibutton>Ouvrir un nouvel onglet dans le dossier personnel</guibutton> qui se situe en bas à gauche de chaque panneau.

source: To open the current folder in a new tab: use <keycombo action="simul"> &Ctrl;&Alt;&Enter;</keycombo>.
fr: Pour ouvrir le dossier courant dans un nouvel onglet : utilisez <keycombo action="simul"> &Ctrl;&Alt;&Enter;</keycombo>.

source: Buttons
fr: Boutons

source: Several buttons for fast operations are available: <link linkend="main_toolbar">Main Toolbar</link>, <link linkend="actions_toolbar">Actions Toolbar</link>, <link linkend="panel_toolbar">Panel Toolbar</link>, <link linkend="location_toolbar">Location Toolbar</link>, <link linkend="list_panel">Media</link>, <link linkend="folderhistory">Folder history</link>, <link linkend="bookman">Bookmarks</link>, <link linkend="folder-tabs">Tab</link>, <link linkend="cmdline">Commandline</link>, <link linkend="fnkeys">Function keys</link>.
fr: De nombreux boutons pour les opérations rapides sont disponibles : <link linkend="main_toolbar">Barre principale</link>, <link linkend="actions_toolbar">Barre d'actions</link>, <link linkend="panel_toolbar">Barre des panneaux</link>, <link linkend="location_toolbar">Barre d'emplacement</link>, <link linkend="list_panel">Média</link>, <link linkend="folderhistory">Dossier d'historique</link>, <link linkend="bookman">Signets</link>, <link linkend="folder-tabs">Onglet</link>, <link linkend="cmdline">Ligne de commande</link>, <link linkend="fnkeys">Touches FN</link>.
