Repository: CodeCollect/krusader
Catalog: doc/i18n/*/useractions.docbook.po
Languages: fr

source: Currently, these placeholders are implemented: <itemizedlist> <listitem> <para> <userinput>Path</userinput> - replaced by the panels path</para> <orderedlist> <listitem> <para>Parameter (optional): Automatic escape spaces. Default: yes</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Count</userinput> - replaced by the number of &lt;first parameter&gt;</para> <orderedlist> <listitem> <para>Parameter: Which items; either "All", "Selected", "Files" or "Dirs"</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Filter</userinput> - replaced by the panel's filter mask</para> </listitem> <listitem> <para> <userinput>Current</userinput> - replaced by the current item</para> <orderedlist> <listitem> <para>Parameter (optional): Omit the current path. Default: no</para> </listitem> <listitem> <para>Parameter (optional): Automatic escape spaces. Default: yes</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>List</userinput> - replaced by a list of all &lt;first parameter&gt;</para> <orderedlist> <listitem> <para>Parameter: Which items; either "All", "Selected", "Files" or "Dirs"</para> </listitem> <listitem> <para>Parameter (optional): Separator between the items. Default: "&nbsp;"</para> </listitem> <listitem> <para>Parameter (optional): Omit the current path. Default: no</para> </listitem> <listitem> <para>Parameter (optional): Filtermask (for all but "Selected"). Default: *</para> </listitem> <listitem> <para>Parameter (optional): Automatic escape spaces. Default: yes</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Select</userinput> - manipulates the selection in a panel</para> <orderedlist> <listitem> <para>Parameter: Filtermask</para> </listitem> <listitem> <para>Parameter (optional): manipulate in which way; either "Set", "Add" or "Remove". Default: "Set"</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Goto</userinput> - changes the panels' path to &lt;first parameter&gt;</para> <orderedlist> <listitem> <para>Parameter: A relative or absolute path, or an URL</para> </listitem> <listitem> <para>Parameter (optional): Open the location in a new tab. Default: no</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Ask</userinput> - asks the user for some text and is replaced by the answer</para> <orderedlist> <listitem> <para>Parameter: The Question</para> </listitem> <listitem> <para>Parameter (optional): A default answer</para> </listitem> <listitem> <para>Parameter (optional): A caption for the question box</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Clipboard</userinput> - manipulates the clipboard</para> <orderedlist> <listitem> <para>Parameter: The text that should go to the clipboard (you may want to use "%aCurrent%" here)</para> </listitem> <listitem> <para>Parameter (optional): Append the text to the current content of the clipboard with this separator</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Copy</userinput> - copies a file, useful for quick, local backups</para> <orderedlist> <listitem> <para>Parameter: What should be copied</para> </listitem> <listitem> <para>Parameter: Where it should be copied</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Sync</userinput> - opens the Synchronizer with a given profile</para> <orderedlist> <listitem> <para>Parameter: A profile for the Synchronizer</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>NewSearch</userinput> - opens the search windows with a given profile</para> <orderedlist> <listitem> <para>Parameter: A profile for the search module</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Profile</userinput> - loads a given panel profile</para> <orderedlist> <listitem> <para>Parameter: A panel profile</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Each</userinput> - splits the commandline into a list. These commands are executed one after another.</para> <orderedlist> <listitem> <para>Parameter: A list item (all, all files, all dirs, all selected).</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Move</userinput> - move from source to destination.</para> <orderedlist> <listitem> <para>Parameter: A source</para> </listitem> <listitem> <para>Parameter: A destination</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>PanelSize</userinput> - change the ratio between the two panels.</para> <orderedlist> <listitem> <para>Parameter (optional): A integer value, e.g., 80 makes the active panel use 80% of &krusader;'s width (height in vertical mode), omitting the parameter means 50%.</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Ask</userinput> - cancel the execution.</para> <orderedlist> <listitem> <para>Parameter (optional): A string for the cancel question.</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Script</userinput> - executes an external <link linkend="javascript_console"> Javascript</link> file.</para> <para>NOTE: This is still experimental and the interface may change, feedback is always welcome.</para> <orderedlist> <listitem> <para>Parameter: path to the external foo.js file, absolute path or relative to <filename> &lt;kde-app-data&gt;/krusader/js/</filename>. &lt;kde-app-data&gt; is <filename>$(kde-config --localprefix)/share/apps/</filename> or <filename>$(kde-config --prefix)/share/apps/</filename>, for those who don't know where to copy the scripts/extensions. If all the needed files (normally <filename>.js</filename> and maybe <filename>.ui</filename>) are in one of these dirs it's sufficient to give the file name only as 1. parameter.</para> </listitem> <listitem> <para>Parameter (optional): a list of variables which should be set, like "return=cmd; a=lalala; b='%_Ask(..)'" so that the placeholder is replaced be the content of the variable cmd and the other two have already these values when the script starts.</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>ListFile</userinput> - is replaced by path/file name of a temporary file containing a list of items</para> <orderedlist> <listitem> <para>Parameter: path/filename</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>ColSort</userinput> - set the sorting on a column of a specific panel.</para> <orderedlist> <listitem> <para>Parameter: Column: Either "Name", "Ext", "Type", "Size", "Modified", "Perms", "rwx", "Owner" and "Group"</para> </listitem> <listitem> <para>Parameter: Sort sequence: Either "Toggle", "Asc", "Desc"</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>View</userinput> - set the view mode.</para> <orderedlist> <listitem> <para>Parameter: View mode: Either "generic", "text", "hex"</para> </listitem> <listitem> <para>Parameter: Window Mode: Either "tab", "window"</para> </listitem> </orderedlist> </listitem> </itemizedlist>A GUI-based helper for placeholder adding is provided. Spaces In Path, Current and List are by default, automatically escaped. There is one more important thing to know: All placeholders that interact with &krusader; internal functions are called at expand time (meaning directly when the placeholders are replaced). External programs are called at execution time (meaning after all placeholders are replaced).
fr: Les substituants suivants sont implantés : <itemizedlist> <listitem> <para> <userinput>Emplacement</userinput> - remplacé par l'emplacement des panneaux </para> <orderedlist> <listitem> <para>Paramètre (optionnel) : espaces de sortie automatiques. Défaut : oui</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Compte</userinput> - remplacé par le premier numéro du &lt;premier paramètre&gt;</para> <orderedlist> <listitem> <para>Paramètre : quel éléments soit Tous, Sélectionnés, Fichiers ou Dossiers</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Filtre</userinput> - remplacé par le masque de filtre du panneau</para> </listitem> <listitem> <para> <userinput>Courant</userinput> - remplacé par l'élément courant</para> <orderedlist> <listitem> <para>Paramètre (optionnel) : omettre l'emplacement courant. Défaut : non</para> </listitem> <listitem> <para>Paramètre (optionnel) : espaces de sortie automatiques. Défaut : oui</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Liste</userinput> - remplacé par une liste de tous les &lt;premiers paramètres &gt;</para> <orderedlist> <listitem> <para>Paramètre :Quels éléments ; soit Tous, Sélectionné, Fichiers ou Dossiers</para> </listitem> <listitem> <para>Paramètre (optionnel) : Séparateur entre les éléments. Défaut : « &nbsp; »</para> </listitem> <listitem> <para>Paramètre (optionnel) : Omettre l'emplacement courant. Défaut : non</para> </listitem> <listitem> <para>Paramètre (optionnel) : masque de filtrage (pour tous sauf « Sélectionné »). Défaut : *</para> </listitem> <listitem> <para> Paramètre (optionnel) : espaces de sortie automatiques. Défaut : oui</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Sélectionner</userinput> - manipule la sélection dans le panneau</para> <orderedlist> <listitem> <para>Paramètre : masque de filtrage</para> </listitem> <listitem> <para>.Paramètre (optionnel) : manipule de quelle manière ; soit « Réglage », « Ajouter » ou « Supprimer ». Défaut : « Réglage » </para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Aller à</userinput> - modifie l'emplacement du panneau pour le &lt; premier paramètre&gt;</para> <orderedlist> <listitem> <para>Paramètre : un emplacement relatif ou absolu, ou un URL</para> </listitem> <listitem> <para> Paramètre (optionnel) : ouvre l'emplacement dans un nouvel onglet. Défaut : non</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Demander</userinput> - demande à l'utilisateur le texte et est remplacé par la réponse</para> <orderedlist> <listitem> <para>Paramètre : la question</para> </listitem> <listitem> <para>Paramètre (optionnel) : une réponse par défaut</para> </listitem> <listitem> <para>Paramètre (optionnel) : une légende pour la boîte à question</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Presse-papiers</userinput> - manipule le presse-papiers </para> <orderedlist> <listitem> <para>Paramètre : le texte qui doit aller vers le presse-papiers (vous pouvez utiliser ici « %aCurrent% »)</para> </listitem> <listitem> <para>Paramètre (optionnel) : Ajouter le texte au contenu courant du presse-papiers avec ce séparateur</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Copier</userinput> - copie un fichier, utile pour les sauvegardes rapides et locales</para> <orderedlist> <listitem> <para>Paramètre : ce qui doit être copié</para> </listitem> <listitem> <para>Paramètre : où cela doit être copié</para></listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Sync</userinput> - ouvre Synchronizer avec un profil donné</para> <orderedlist> <listitem> <para>Paramètre : un profil pour le Synchronizer</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>NouvelleRecherche</userinput> - ouvre la fenêtre de recherche avec un profil donné</para> <orderedlist> <listitem> <para>Paramètre : un profile pour le module de recherche</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Profil</userinput> - charge un profil de panneau donné</para> <orderedlist> <listitem><para>Paramètre : un profil de panneau</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Chaque</userinput> - sépare la ligne de commande dans une liste. Ces commandes sont exécutées l'une après l'autre.</para> <orderedlist> <listitem> <para>Paramètre : un élément de type liste (tous, tous les fichiers, tous les dossiers, tout sélectionné).</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Déplacer</userinput> - se déplacer du dossier source au dossier cible.</para> <orderedlist> <listitem> <para>Paramètre : une source</para> </listitem> <listitem> <para>Paramètre : une destination</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>TaillePanneau</userinput> - modifie l'échelle entre les deux panneaux.</para> <orderedlist> <listitem> <para>Paramètre (optionnel) : une valeur integer, &pex;, 80, le panneau actif utilise 80% de la largeur de &krusader; (hauteur dans le mode vertical), omettant le paramètre signifie 50%.</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Demander</userinput> - annule l'exécution.</para> <orderedlist> <listitem> <para>Paramètre (optionnel) : une entrée pour la question d'annulation.</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Script</userinput> - exécute un fichier <link linkend="javascript_console"> Javascript</link> externe.</para> <para>REMARQUE : cette fonctionnalité est toujours expérimentale et l'interface peut changer, les retours sont les bienvenus.</para> <orderedlist> <listitem> <para>Paramètre : l'emplacement du fichier foo.js externe, emplacement absolu ou relatif à <filename> &lt;kde-app-data&gt;/krusader/js/</filename>. &lt;kde-app-data&gt; est <filename>$(kde-config --localprefix)/share/apps/</filename> ou <filename>$(kde-config --prefix)/share/apps/</filename>, pour ceux qui ne savent pas où copier les scripts et extensions. Si tous les fichiers sont nécessaires (normalement <filename>.js</filename> et peut être<filename>.ui</filename>) sont dans un de ces dossiers, c'est suffisant pour donner le nom de fichier seulement comme paramètre 1.</para> </listitem> <listitem> <para>Paramètre (optionnel) : une liste de variables qui doit être défini, comme « return=cmd; a=lalala; b='%_Ask(..)' » pour que le substituant remplace le contenu de la variable cmd et les deux autres ont toujours ces valeurs quand le script démarre.</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>ListeFichier</userinput> - est remplacé par le nom de l'emplacement / fichier du fichier temporaire contenant une liste des éléments</para> <orderedlist> <listitem> <para>Paramètre : emplacement / nom de fichier</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>TrieCol</userinput> - définit le trie sur la colonne du panneau spécifique.</para> <orderedlist> <listitem> <para>Paramètre : Colonne : soit « nom », « ext », « type », « taille », « modifié », « perm », « rwx », « propriétaire » et « groupe »</para> </listitem> <listitem> <para>Paramètre : trie par séquence : soit « Toggle », « Asc », « Desc »</para> </listitem> </orderedlist> </listitem> <listitem> <para> <userinput>Afficher</userinput> - définit le mode d'affichage.</para> <orderedlist> <listitem> <para>Paramètre : mode d'affichage : soit « générique », « texte », « hex »</para> </listitem> <listitem> <para>Paramètre : mode de fenêtre : soit « onglet », « fenêtre »</para> </listitem> </orderedlist> </listitem> </itemizedlist>Une interface graphique d'aide pour le substituant est fourni. Espaces dans le Path, Courant et Liste sont par défaut, sortie automatique. Il y a plus d'une chose importante à savoir : tous les substituants qui interagissent avec les fonctionnalités internes de &krusader; sont appelées pendant le temps supplémentaire (ce qui signifie directement quand les substituants sont remplacés). Les programmes externes sont appelés à l'exécution (ce qui signifie après que tous les substituants sont remplacés).

source: Advanced Properties
fr: Propriétés avancées

source: Here you can configure where your command should be visible (for the right click menu) In addition, it is possible to change the command executed and confirm it separately. You can also set a user under which the command should be executed.
fr: Vous pouvez configurer ici où votre commande doit être visible (pour le menu par clic-droit). En plus, il est possible de modifier la commandé exécutée et la confirmer séparément. Vous pouvez aussi définir un utilisateur avec lequel la commande doit être exécutée.

source: Configures if the action is valid for a Protocol, Path, Mime type or File name.
fr: Configure si l'action est valable pour un protocole, un emplacement, un type MIME ou un nom de fichier.

source: Tweaking the command line before being executed.
fr: Ajuster la ligne de commande avec l'exécution.

source: Set a different user for the execution (this has no effect in &krusader; internal functions)
fr: Définit un utilisateur différent pour l'exécution (cela n'a aucun effets dans les fonctionnalités internes de &krusader;).
