Repository: CodeCollect/krusader
Catalog: doc/i18n/*/viewer-editor.docbook.po
Languages: fr

source: KrViewer: &krusader;'s internal viewer-editor
fr: KrViewer : l'afficheur interne de &krusader;

source: <primary>Viewer</primary>
fr: <primary>Afficheur</primary>

source: <seealso>Editor</seealso>
fr: <seealso>Éditeur</seealso>

source: Pressing &Enter; on a selected file <emphasis>opens the file with the associated application</emphasis>. The editor-viewer is tabbed, configure it on the <link linkend="konfig-general">Konfigurator General page</link>
fr: Appuyer sur &Enter; sur un fichier sélectionné <emphasis>ouvre le fichier avec l'application associée</emphasis>. L'afficheur-éditeur dispose d'onglets à configurer dans la <link linkend="konfig-general">page générale de Konfigurator</link>.

source: <title>Viewer</title>
fr: <title>Afficheur</title>

source: To view a file as fast as possible according to its type, just put it under the cursor and press <keycap>F3</keycap>. &krusader;'s internal viewer is actually a part of &konqueror;, which can basically view every file type viewable by &konqueror; (e.g. display pictures, play music, show the content of an archive). This is called the 'Generic viewer', for which you need to configure the mime types.
fr: Pour afficher un fichier aussi vite que possible selon son type, placez votre curseur au dessus et appuyez sur <keycap>F3</keycap>. L'afficheur interne de &krusader; est en fait un composant de &konqueror;, il peut donc afficher tout les types de fichiers lisibles par &konqueror; (&pex; afficher des images, jouer de la musique, afficher le contenu d'une archive). Ceci est appelé « l'afficheur générique », pour lequel vous devez configurer les types MIME.

source: The viewer works as follows: <itemizedlist> <listitem> <para>It tries to view the file with the <emphasis>'Generic viewer'.</emphasis></para> </listitem> <listitem> <para>When the file type (mime type) cannot be determined or when a file (e.g. a binary) doesn't have an associated action, it disables the 'generic viewer'. The file is treated as a text file, which is the <emphasis>'Text viewer'</emphasis>.</para> </listitem> <listitem> <para>The user can change in the <link linkend="kredit_krviewer_menu">KrViewer menu</link> between: 'Generic viewer' (if available), 'Text viewer' and <emphasis>'Hex viewer'</emphasis>.</para> </listitem> </itemizedlist>You can configure the default viewer mode on the <link linkend="konfig-general">Konfigurator General page</link> .
fr: L'afficheur fonctionne comme suit : <itemizedlist> <listitem> <para>il essaie d'afficher le fichier avec <emphasis>l'afficheur générique.</emphasis></para> </listitem> <listitem> <para> Quand le type de fichier (type mime) ne peut être déterminé ou quand un fichier (&pex; un fichier binaire) n'a pas une action associée, il désactive l'afficheur générique. Le fichier est traité comme un fichier texte, lequel est <emphasis>l'afficheur de texte.</emphasis>.</para> </listitem> <listitem> <para>L'utilisateur peut modifier dans le <link linkend="kredit_krviewer_menu">menu KrViewer</link> entre : l'afficheur générique (si disponible), l'afficheur de texte et <emphasis>l'afficheur héxadécimal</emphasis>.</para> </listitem> </itemizedlist>Vous pouvez configurer le mode par défaut de l'afficheur sur la <link linkend="konfig-general">page générale de Konfigurator</link>.

source: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>F3</keycap></keycombo>views a &URL; on demand, e.g.:
fr: <keycombo action="simul"><keycap>Backspace</keycap> <keycap>F3</keycap></keycombo> affiche un &URL; sur demande &pex; :

source: <userinput> <command>man:/</command> </userinput>views the manpages.
fr: <userinput> <command>man:/</command> </userinput>affiche les pages du manuel.

source: <userinput> <command>man:/</command> <replaceable>krusader</replaceable> </userinput>views a manpage.
fr: <userinput> <command>man:/</command> <replaceable>krusader</replaceable> </userinput>affiche une page de manuel.

source: <userinput> <command>info:/</command> </userinput>views the infopages.
fr: <userinput> <command>info:/</command> </userinput>affiche les pages d'informations.

source: <userinput> <command>http://</command> <replaceable>krusader.sourceforce.net/</replaceable> </userinput>views a webpage.
fr: <userinput> <command>http://</command> <replaceable>krusader.sourceforce.net/</replaceable> </userinput>affiche une page web.

source: <userinput> <command>ftp://</command> <replaceable>ftp.kde.org/pub/kde/</replaceable> </userinput>views a ftp-server.
fr: <userinput> <command>ftp://</command> <replaceable>ftp.kde.org/pub/kde/</replaceable> </userinput>affiche un serveur ftp.

source: <userinput> <command>sftp://</command> <replaceable>sftp.foo/</replaceable> </userinput>views a secure ftp-server.
fr: <userinput> <command>sftp://</command> <replaceable>sftp.foo/</replaceable> </userinput>affiche un serveur sftp.

source: <userinput> <command>file:/</command> <replaceable>home/frank</replaceable> </userinput>views the homedirectory of Frank.
fr: <userinput> <command>file:/</command> <replaceable>home/frank</replaceable> </userinput>affiche le dossier personnel de Frank.

source: <userinput> <replaceable>/home/frank/archive.tar.gz</replaceable> </userinput>views a <literal role="extension">tar.gz</literal> archive.
fr: <userinput> <replaceable>/home/frank/archive.tar.gz</replaceable> </userinput>affiche une archive <literal role="extension">tar.gz</literal>.

source: KrViewer can have the following menus: <link linkend="kredit_file_menu">File</link>, <link linkend="kredit_edit_menu">Edit</link>, <link linkend="kredit_view_menu">View</link>, <link linkend="kredit_settings_menu">Settings</link> and <link linkend="kredit_krviewer_menu">Krviewer</link>, depending on which file type is viewed. They will be discussed in the <link linkend="kredit">Editor section</link>. The internal viewer can follow links on HTML pages. With <keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo> the viewer can start &krusader;'s internal editor (which is basically the same application).
fr: KrViewer possède les menus suivants : <link linkend="kredit_file_menu">Fichier</link>, <link linkend="kredit_edit_menu">Édition</link>, <link linkend="kredit_view_menu">Affichage</link>, <link linkend="kredit_settings_menu">Configuration</link> et <link linkend="kredit_krviewer_menu">Krviewer</link>, en fonction du type de fichier qui est affiché. Ils seront abordés dans la <link linkend="kredit">section éditeur</link>. L'éditeur interne peut suivre des liens dans des pages HTML. Avec <keycombo action="simul">&Ctrl; <keycap>E</keycap></keycombo> l'afficheur peut lancer l'éditeur interne de &krusader; (qui est en fait la même application).

source: The embedded viewer is not written by us, it is supplied via &kde; (libs) and KIO Slaves We cannot and do not want to change it, usings these libraries reduces the amount of written code. So we do not have to reinvent the wheel ;-)
fr: Nous n'écrivons pas l'afficheur embarqué, il est fournit via &kde; (bibliothèques) et KIO Slaves. Nous ne pouvons pas le modifier, il utilise ces bibliothèques afin de réduire la taille du code. Nous ne devons donc pas réinventer la roue ;-)

source: <title>Editor</title>
fr: <title>Éditeur</title>

source: <primary>Editor</primary>
fr: <primary>Éditeur</primary>

source: &krusader;'s internal editor has almost everything that you can expect of an editor. Editing is similar to viewing but with the <keycap>F4</keycap> key. The default editor is &krusader;'s internal editor. You can change the default editor in the <link linkend="konfig-general">Konfigurator General page</link>, if you prefer to use an external editor.
fr: L'éditeur interne de &krusader; a pratiquement tout ce que vous pouvez attendre d'un éditeur. L'édition est similaire à l'afficheur mais avec la touche<keycap>F4</keycap>. L'éditeur par défaut est l'éditeur interne de &krusader;. Vous pouvez modifier l'éditeur par défaut dans la <link linkend="konfig-general">page générale de Konfigurator</link>, si vous préférez utiliser un éditeur externe.

source: When you use &krusader;'s internal editor for the first time, it is recommended to look at each section of the <link linkend="kredit_settings_menu">Settings</link>menu, and configure it the way you want it.
fr: Si vous utilisez l'éditeur interne de &krusader; pour la première fois, il est recommandé de configurer chaque session du menu <link linkend="kredit_settings_menu">Configuration</link> comme vous le voulez.

source: Menu overview
fr: Aperçu du menu

source: Most of the menus are quite self-explanatory. ;-)
fr: La plupart des menus sont assez explicites. ;-)

source: <guimenu>File</guimenu>menu
fr: Le menu <guimenu>Fichier</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Save</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>S</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Enregistrer</guimenuitem>

source: Save file.
fr: Enregistrer le fichier.

source: <guimenu>File</guimenu> <guimenuitem>Save As</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Enregistrer sous</guimenuitem>

source: Save file with another name.
fr: Enregistrer le fichier avec un autre nom.

source: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>File</guimenu> <guimenuitem>Reload</guimenuitem>
fr: <shortcut> <keycap>F5</keycap> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Recharger</guimenuitem>

source: Reload file.
fr: Recharger le fichier.

source: <guimenu>File</guimenu> <guimenuitem>Export</guimenuitem>
fr: <guimenu>Fichier</guimenu> <guimenuitem>Exporter en HTML...</guimenuitem>

source: Export the file to <literal role="extension">HTML</literal> format.
fr: Exporter le fichier au format <literal role="extension">HTML</literal>.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> </shortcut> <guimenu>File</guimenu> <guimenuitem>Print</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>P</keycap></keycombo> </shortcut> <guimenu>Fichier</guimenu> <guimenuitem>Imprimer...</guimenuitem>

source: Print the file.
fr: Imprimer le fichier.

source: <guimenu>Edit</guimenu> menu
fr: Le menu <guimenu>Édition</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Undo</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Annuler</guimenuitem>

source: Undo last action.
fr: Annuler la dernière action.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Redo</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>Z</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Rétablir</guimenuitem>

source: Redo last action.
fr: Refaire la dernière action.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>X</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Cut</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>X</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Couper</guimenuitem>

source: Cut selected text to clipboard.
fr: Couper le texte sélectionné dans le presse-papiers.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Copy</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>C</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Copier</guimenuitem>

source: Copy selected text to clipboard.
fr: Copier le texte sélectionné dans le presse-papiers.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Paste</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>V</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Coller</guimenuitem>

source: Paste clipboard content to the document.
fr: Coller le contenu du presse-papiers dans le document.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Select All</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>A</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Tout sélectionner</guimenuitem>

source: Select whole document.
fr: Sélectionner le document complet.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>A</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Deselect</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>A</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Désélectionner</guimenuitem>

source: Deselect current selection.
fr: Déselectionner la sélection courante.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>B</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Block Selection Mode</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>B</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Mode de sélection par bloc</guimenuitem>

source: Toggle Block Selection, which will activate/deactivate the block selection possibility.
fr: Activer ou désactiver la sélection par bloc.

source: <shortcut> <keycap>Insert</keycap> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Overwrite Mode</guimenuitem>
fr: <shortcut> <keycap>Insert</keycap> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Mode « écrasement »</guimenuitem>

source: Toggle Insert/Overwrite Mode.
fr: Active ou désactive le mode d'écrasement.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>F</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Chercher</guimenuitem>

source: Find text.
fr: Rechercher du texte.

source: <shortcut> <keycombo action="simul"> <keycap>F3</keycap> </keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Next</guimenuitem>
fr: <shortcut> <keycombo action="simul"> <keycap>F3</keycap> </keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Poursuivre la recherche</guimenuitem>

source: Find next text.
fr: Rechercher le texte suivant.

source: <shortcut> <keycombo action="simul"><keycap>Backspace</keycap> <keycap>F3</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Find Previous</guimenuitem>
fr: <shortcut> <keycombo action="simul"><keycap>Backspace</keycap> <keycap>F3</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Chercher en arrière</guimenuitem>

source: Find previous text.
fr: Rechercher le texte précédent.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Replace</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>R</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Remplacer</guimenuitem>

source: Replace text.
fr: Remplacer du texte.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>G</keycap></keycombo> </shortcut> <guimenu>Edit</guimenu> <guimenuitem>Go to line</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>G</keycap></keycombo> </shortcut> <guimenu>Édition</guimenu> <guimenuitem>Aller à la ligne</guimenuitem>

source: Go to given line number.
fr: Aller au numéro de ligne donné.

source: <guimenu>View</guimenu>menu
fr: Le menu <guimenu>Affichage</guimenu>

source: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Switch to Command Line.</guimenuitem>
fr: <shortcut> <keycap>F7</keycap> </shortcut> <guimenu>Affichage<</guimenu> <guimenuitem>Passer dans la ligne de commande</guimenuitem>

source: Display Command Line.
fr: Afficher la ligne de commande.

source: <guimenu>View</guimenu> <guimenuitem>Schema.</guimenuitem>
fr: <guimenu>Visualisation</guimenu> <guimenuitem>Schéma</guimenuitem>

source: Set Schema e.g. &krusader; Normal, &krusader; Printing, &kate; Normal, &kwrite; Normal.
fr: Définir le mode &pex; &krusader; - normal, &krusader; - impression, &kate; - normal, &kwrite; - normal.

source: <shortcut> <keycap>F10</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Dynamic Word Wrap</guimenuitem>
fr: <shortcut> <keycap>F10</keycap> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Retour à la ligne dynamique</guimenuitem>

source: Go to the next line at the maximum number of characters per line (default 80).
fr: Aller à la ligne suivante au nombre maximum de caractères par ligne (80 par défaut).

source: <guimenu>View</guimenu> <guimenuitem>Dynamic Word Wrap Indicators</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Indicateurs de retour à la ligne dynamique</guimenuitem>

source: Off, Follow Line Numbers, Always On.
fr: Désactivés, Suivant l'affichage des numéros de ligne, Toujours affichés.

source: <guimenu>View</guimenu> <guimenuitem>Shows Static Word Wrap marker</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Afficher les indicateurs de retour à la ligne statique</guimenuitem>

source: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Icon Border</guimenuitem>
fr: <shortcut> <keycap>F6</keycap> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Afficher la bordure d'icônes</guimenuitem>

source: Shows Icon Border.
fr: Afficher la bordure d'icône.

source: <shortcut> <keycap>F11</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Show Line Numbers</guimenuitem>
fr: <shortcut> <keycap>F11</keycap> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Afficher les numéros de ligne</guimenuitem>

source: Shows the line numbers.
fr: Afficher les numéros de ligne.

source: <guimenu>View</guimenu> <guimenuitem>Show Scrollbar Marks.</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Afficher les repères sur les barres de défilement.</guimenuitem>

source: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>View</guimenu> <guimenuitem>Hide Folding Markers</guimenuitem>
fr: <shortcut> <keycap>F9</keycap> </shortcut> <guimenu>Affichage</guimenu> <guimenuitem>Afficher les indicateurs de pliage</guimenuitem>

source: <guimenu>View</guimenu> <guimenuitem>Code Folding.</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Pliage du code</guimenuitem>

source: <guimenu>View</guimenu> <guimenuitem>Set Encoding</guimenuitem>
fr: <guimenu>Affichage</guimenu> <guimenuitem>Définir le jeu de caractères</guimenuitem>

source: e.g. ISO8859-1, utf8, utf16, tscii, ... .
fr: &pex; ISO8859-1, utf8, utf16, tscii, ... .

source: <guimenu>Bookmarks</guimenu>menu
fr: Le menu <guimenu>Signets</guimenu>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> </shortcut> <guimenu>Bookmark</guimenu> <guimenuitem>Set Bookmark</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>B</keycap></keycombo> </shortcut> <guimenu>Signets</guimenu> <guimenuitem>Définir un signet</guimenuitem>

source: <guimenu>Bookmark</guimenu> <guimenuitem>Clear All Bookmarks</guimenuitem>
fr: <guimenu>Signets</guimenu> <guimenuitem>Effacer tous les signets</guimenuitem>

source: <guimenu>Tools</guimenu>menu
fr: Le menu <guimenu>Outils</guimenu>

source: <guimenu>Tools</guimenu> <guimenuitem>Read Only Mode</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Mode « lecture seule »</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Filetype Mode</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Mode</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Highlight mode</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Coloration syntaxique</guimenuitem>

source: Highlight mode for scripts, programming languages, markup file, &etc;: e.g. <literal role="extension">HTML, Bash, C++, XML, Makefile, Diff, ...</literal>.
fr: Coloration syntaxique pour les scripts, langages de programmation, balises, &etc; : &pex; <literal role="extension">HTML, Bash, C++, XML, Makefile, Diff, ...</literal>.

source: <guimenu>Tools</guimenu> <guimenuitem>End of Line</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Fin de ligne</guimenuitem>

source: Change the end of Line termination: &UNIX;, &Windows;/DOS, <trademark class="registered"> Macintosh</trademark>.
fr: Modifier la fin de la d'interruption de ligne : &UNIX;, &Windows;/DOS, <trademark class="registered"> Macintosh</trademark>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>I</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Indent</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>I</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Indentation</guimenuitem>

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>I</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Unindent</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>I</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Indentation</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Clean Indentation</guimenuitem>
fr: <guimenu>Outils</guimenu> <guimenuitem>Supprimer l'indentation</guimenuitem>

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>D</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Comment</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>D</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Commenter</guimenuitem>

source: Add appropriate comment tags, if available.
fr: Ajouter des étiquettes de commentaire appropriées, si disponible.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>D</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Uncomment</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>D</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Commenter</guimenuitem>

source: Removes the comment tags on the left.
fr: Supprimer les étiquettes de commentaire sur la gauche.

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Uppercase</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Majuscules</guimenuitem>

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Lowercase</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>U</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Minuscules</guimenuitem>

source: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Capitalize</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Alt;&Ctrl; <keycap>U</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Mettre une majuscule à chaque mot</guimenuitem>
