Repository: CodeCollect/krusader
Catalog: doc/i18n/*/viewer-editor.docbook.po
Languages: fr

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>J</keycap></keycombo> </shortcut> <guimenu>Tools</guimenu> <guimenuitem>Join Lines</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>J</keycap></keycombo> </shortcut> <guimenu>Outils</guimenu> <guimenuitem>Fusionner les lignes</guimenuitem>

source: <guimenu>Tools</guimenu> <guimenuitem>Word Wrap Document</guimenuitem>
fr: <guimenu>Outilss</guimenu> <guimenuitemPlacer des retours à la lignet</guimenuitem>

source: <guimenu>Settings -&gt; Configure Editor</guimenu>menu
fr: Le menu <guimenu>Configurations -&gt;Configurer l'éditeurr</guimenu>

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Colors</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Couleurs</guimenuitem>

source: Color configuration for the: Background, Selected text, Current line and Bracket highlighting.
fr: Configuration des couleurs pour : le fond, le texte sélectionné, la ligne courante et les lignes avec des accolades.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Fonts</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Polices</guimenuitem>

source: Fonts configuration for display and printer: Font, font Style and Size, with a preview window.
fr: Configuration des polices pour l'affichage et l'impression : polices, style et taille de polices, avec une fenêtre d'aperçu.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Indentation</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Indentation</guimenuitem>

source: Indentation configuration: Automatically indent, use Spaces to indent, &Tab; Keys indent, <keycap>Backspace</keycap> key unindents, keep indent profile, keep extra spaces.
fr: Configuration de l'indentation : indenter automatiquement, utiliser des espaces pour indenter, indenter avec la touche &Tab;, désindenter avec la touche <keycap>Backspace</keycap>, profil d'indentation et divers.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Selection</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Sélection</guimenuitem>

source: Selection configuration: Persistent selections, Overwrite selected text.
fr: Configuration de la sélection : sélections persistantes, écraser le texte sélectionné.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Editing</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Édition</guimenuitem>

source: Editing configuration: Word Wrap config., Whitespace config, Auto brackets, Smart home, Wrap cursor, Maximum undo steps.
fr: Configuration de l'édition : configuration des retours à la ligne, configuration des espaces blancs, accolades automatiques, retour à la ligne du curseur, nombre d'annulation maximum.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Shortcuts</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Raccourcis clavier</guimenuitem>

source: Shortcuts configuration.
fr: Configuration des raccourcis clavier.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Highlighting</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Coloration syntaxique</guimenuitem>

source: Highlighting configuration: Default styles and Highlight mode.
fr: Configuration de la coloration syntaxique : styles et modes par défaut.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>View defaults</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Vue par défaut</guimenuitem>

source: View defaults: Dynamic word wrap, show Line numbers, show Icon border, show Folder markers if available, sort Bookmarks menu method.
fr: Vue par défaut : césure dynamique des mots, affichage du nombre de ligne, affichage de l'icône sur la bordure, affichage des marqueurs de dossier s'ils sont disponibles, tri du menu des signets.

source: <guimenu>Settings</guimenu> <guimenuitem>Configure Editor</guimenuitem> <guimenuitem>Plugins</guimenuitem>
fr: <guimenu>Configuration</guimenu> <guimenuitem>Configurer l'éditeur</guimenuitem> <guimenuitem>Modules</guimenuitem>

source: Plugins configuration: e.g. kTexteditor incremental search plugin, kTexteditor insert file plugin, kTexteditor kdatatoolplugin...
fr: Configuration des modules : &pex; le module de recherche incrémentale de kTexteditor, le module d'insertion de fichier kTextEditor, le module kdatatool kTexteditor...

source: <guimenu>KrViewer</guimenu>menu
fr: Le menu <guimenu>KrViewer</guimenu>

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>G</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Generic viewer</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>G</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Afficheur général</guimenuitem>

source: &krusader;'s internal viewer is actually part of Konqueror, which can basically view every file type viewable by &konqueror; (e.g. display pictures, play music, show the content of an archive).
fr: L'afficheur interne de &krusader; est en fait une partie de Konqueror, qui peut voir tous les types de fichiers que &konqueror; gère (&pex; afficher des images, jouer de la musique, voire le contenu d'une archive).

source: <shortcut> <keycombo action="simul">&Ctrl; <keycap>T</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Text viewer</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Ctrl; <keycap>T</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Afficheur texte</guimenuitem>

source: View the file in text mode.
fr: Afficher le fichier en mode texte.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>H</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Hex viewer</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>H</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Afficheur texte</guimenuitem>

source: View the file in hex mode.
fr: Afficher le fichier en mode hexadécimal.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>E</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Text editor</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>E</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Éditeur texte</guimenuitem>

source: Edit the file in text mode.
fr: Éditer le fichier en mode texte.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>Right</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Next Tab</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>Droite</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Onglet suivant</guimenuitem>

source: Next browsing Tab.
fr: Onglet de navigation suivant.

source: <shortcut> <keycombo action="simul">&Alt; <keycap>Left</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Previous Tab</guimenuitem>
fr: <shortcut> <keycombo action="simul">&Alt; <keycap>Gauche</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Onglet précédent</guimenuitem>

source: Previous browsing Tab.
fr: Onglet de navigation précédent.

source: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>D</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Detach Tab</guimenuitem>
fr: <shortcut> <keycombo action="simul"> &Ctrl;<keycap>Backspace</keycap> <keycap>D</keycap></keycombo> </shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Détacher l'onglet</guimenuitem>

source: Detach browsing Tab and open in a new window.
fr: Détacher l'onglet de navigation courant dans une nouvelle fenêtre.

source: <shortcut><keycap>Esc</keycap></shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Close current Tab.</guimenuitem>
fr: <shortcut>Esc</shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Fermer l'onglet courant.</guimenuitem>

source: Close current browsing Tab.
fr: Fermer l'onglet de navigation courant.

source: <shortcut>&Ctrl; <keycap>Q</keycap></shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Close</guimenuitem>
fr: <shortcut>&Ctrl; <keycap>Q</keycap></shortcut> <guimenu>KrViewer</guimenu> <guimenuitem>Fermer</guimenuitem>

source: Closes &krusader;'s viewer/editor window.
fr: Ferme la fenêtre de l'éditeur / afficheur de &krusader;.
