Repository: CodeCollect/krusader
Catalog: po/*.po
Languages: jp, pt

source: <p>Shows the last cursor position in the non active list panel.</p><p>This option is only available when you don't use the <i>KDE default colors</i>.</p>
pt: <p>Mostra a última posição do cursor na lista do painel de não activos.</p><p>Esta opção só está disponível quando você não usa as <i>cores por defeito do KDE</i>.<>/p

source: Dim the colors of the inactive panel
pt: Diminuir as cores do painel inactivo

source: <p>The colors of the inactive panel are calculated by a dim color and a dim factor.</p>
pt: <p>As cores do painel inactivo são calculadas por uma cor de esbatimento e um factor de esbatimento.</p>

source: Active
pt: Activo

source: Transparent
pt: Transparente

source: Foreground:
pt: Frente:

source: Directory foreground:
pt: Directório frente:

source: Same as foreground
pt: O mesmo que frente

source: Executable foreground:
pt: Executável frente:

source: Symbolic link foreground:
pt: Ligação simbólica frente:

source: Invalid symlink foreground:
pt: Inválida ligação simbólica frente:

source: Background:
pt: Fundo:

source: Same as background
pt: Mesmo que fundo

source: Alternate background:
pt: Fundo alternado:

source: Selected foreground:
pt: Frente seleccionado:

source: Selected background:
pt: Fundo seleccionado:

source: Same as alt. background
pt: Mesmo que fundo alt.

source: Alternate selected background:
pt: Fundo seleccionado alternado:

source: Same as selected background
pt: O mesmo que fundo alternado

source: Current foreground:
pt: Frente actual:

source: Not used
pt: Não usado

source: Same as selected foreground
pt: Mesmo que frente seleccionado

source: Selected current foreground:
pt: Seleccione frente actual:

source: Current background:
pt: Fundo actual:

source: Inactive
pt: Inactivo

source: Same as active
pt: Mesmo que activo

source: Dim target color:
pt: Cor alvo dim:

source: Dim factor:
pt: Factor dim:

source: Synchronizer
pt: Sincronizador

source: KDE default
pt: Padrão do KDE

source: Equals foreground:
pt: Frentes iguais:

source: Equals background:
pt: Fundos iguais:

source: Differing foreground:
pt: Frentes diferentes:

source: Differing background:
pt: Fundos diferentes:

source: Copy to left foreground:
pt: Copiar para a frente esquerda:

source: Copy to left background:
pt: Copiar para o fundo esquerdo:

source: Copy to right foreground:
pt: Copiar para a frente direita:

source: Copy to right background:
pt: Copiar para o fundo direito:

source: Delete foreground:
pt: Apagar frente:

source: Delete background:
pt: Apagar fundo:

source: Import color-scheme
pt: Importar esquema de cores

source: Export color-scheme
pt: Exportar esquema de cores

source: Selected + Current
pt: Seleccionados + Actual

source: Selected 2
pt: Seleccionados 2

source: Selected 1
pt: Seleccionados 1

source: Current
pt: Actual

source: Invalid symlink
pt: Symlink inválido

source: Symbolic link
pt: Ligação simbólica

source: Application
pt: Aplicação

source: Copy to right
pt: Copiar para a direita

source: Copy to left
pt: Copiar para a esquerda

source: Differing
pt: Diferentes

source: Equals
pt: Iguais

source: Select a color-scheme file
pt: Seleccionar um ficheiro de esquema de cores

source: Error: unable to read from file
pt: Erro: incapaz de ler do ficheiro

source: Select a color scheme file
pt: Selecciona um ficheiro de esquema de cores

source: Error: unable to write to file
pt: Erro: incapaz de escrever no ficheiro

source: Defines the panel profile used at startup. A panel profile contains:<ul><li>all the tabs paths</li><li>the current tab</li><li>the active panel</li></ul><b>&lt;Last session&gt;</b> is a special panel profile which is saved automatically when Krusader is closed.
pt: Define o Painel de Perfil usado ao iniciar. Um Perfil de Painel contem:<ul><li>todos os separadores localizações</li><li>o separador actual</li><li>o painel activo</li></ul><b>&lt;Ultima sessão&gt;</b> é um perfil de painel especial que é gravado automaticamente quando se fecha o Krusader.

source: Startup profile:
pt: Perfil de arranque:

source: Last session
pt: Ultima sessão

source: Show splashscreen
pt: Mostrar imagem inicial

source: Display a splashscreen when starting krusader.
pt: Mostra uma imagem inicial quando o krusader é iniciado.

source: Single instance mode
pt: Modo de única instância

source: Only one Krusader instance is allowed to run.
pt: Apenas a execução de uma instância do Krusader é permitida.

source: User Interface
jp: ユーザインタフェース
pt: Interface do Utilizador

source: Save settings on exit
jp: 終了時の設定を保存
pt: Gravar as opções ao sair

source: Check the state of the user interface components and restore them to their condition when last shutdown.
pt: O Krusader verifica o estado dos componentes da interface do utilizador e restora-os para a mesma situação de quando foi encerrado.

source: Show toolbar
pt: Mostra a Barra de Ferramentas

source: Toolbar will be visible after startup.
pt: Barra de Ferramentas será visível depois do arranque.

source: Show statusbar
pt: Mostra a barra de estado

source: Statusbar will be visible after startup.
pt: Barra de estado ficará visível após arranque.

source: Show function keys
pt: Mostrar teclas de funções

source: Function keys will be visible after startup.
pt: Teclas de função ficarão visíveis após arranque.

source: Show command line
pt: Mostrar Linha de Comandos

source: Command line will be visible after startup.
pt: Linha de comandos ficará visível após arranque.

source: Show terminal emulator
pt: Mostrar Emulador de Terminal

source: Terminal emulator will be visible after startup.
pt: O Emulador de Terminal ficará visível após arranque.

source: Save last position, size and panel settings
pt: Restaurar última posição, tamanho e configurações do painel

source: <p>At startup, the main window will resize itself to the size it was when last shutdown. It will also appear in the same location of the screen, having panels sorted and aligned as they were before.</p><p>If this option is disabled, you can use the menu <i>Window -> Save Position</i> option to manually set the main window's size and position at startup.</p>
pt: <p>Quando iniciado, o Krusader irá restaurar o seu tamanho para o tamanho que tinha antes de ser encerrado.O Krusader também irá aparecer na mesma posição do ecrã, tendo os paineis divididos e alinhados como estavam antes.</p><p>Se esta opção estiver desactivada, você pode usar a opção do menu <i>Configurações->Gravar Posição</i>para por o tamanho e posição manualmente ao iniciar.</p>

source: Start to tray
pt: Iniciar para a bandeja

source: Krusader starts to tray (if minimize to tray is set), without showing the main window
pt: O Krusader incia na bandeja ( se minimizador para a bandeja está activado), sem mostrar a janela principal

source: Krusader transparently handles the following types of archives:
jp: Krusaderは以下の種類の書庫を扱うことができます:
pt: Krusader trabalha transparentemente com os seguintes tipos de arquivos:

source: The archives that are "greyed-out" were unavailable on your system last time Krusader checked. If you wish Krusader to search again, click the 'Auto Configure' button.
pt: Os arquivos que estão "cinzentos" estavam indisponiveis no seu sistema a última vez que o Krusader procurou. Se deseja que o Krusader procure outra vez, clica no botão de Auto Configuração.

source: Auto Configure
jp: 自動設定
pt: Auto Configurar

source: Test archive after packing
pt: Testar arquivos depois de compactá-los

source: Check the archive's integrity after packing it.
pt: Verificar a integridade dos arquivos após a compactação.

source: Test archive before unpacking
pt: Testar arquivos antes de extrai-los

source: Some corrupted archives might cause a crash; therefore, testing is suggested.
pt: Arquivos corruptos podem causar instabilidade no sistema, por isso um teste é sugerido.

source: Searching for packers...
pt: Procurando por compactadores...

source: Make sure to install new packers in your <code>$PATH</code> (e.g. /usr/bin)
pt: Certifique-se que instala novos compactadores na sua <code>$PATH</code> (ex. /usr/bin)

source: Information
pt: Informação

source: Here you can configure settings about useractions. To set up, configure and manage your useractions please use ActionMan.
pt: Aqui você pode configurar definições sobre as acções de utilizador. Para configurar, definir e gerir as suas acções de utilizador por favor utilize o ActionMan.

source: Start ActionMan
pt: Iniciar ActionMan

source: Terminal execution
pt: Execução do terminal

source: Terminal for UserActions:
pt: Terminal para Acções do Utilizador

source: Output collection
pt: Colecção de Output

source: Normal font:
pt: Fonte normal:

source: Font with fixed width:
pt: Fonte com largura fixa:

source: Use fixed width font as default
pt: Utilize fonte de largura fixa por defeito

source: Krusader can't find a supported mail client. Please install one to your path. Hint: Krusader supports Kmail.
pt: Krusader não consegue encontrar nenhum cliente de mail suportado. Por favor instale um na sua localização. Dica: o Krusader suporta o Kmail.

source: Don't know which files to compare.
jp: 比較するファイルを指定してください
pt: Não sei que ficheiros comparar.

source: To compare two files by content, you can either:<ul><li>Select one file in the left panel, and one in the right panel.</li><li>Select exactly two files in the active panel.</li><li>Make sure there is a file in the other panel, with the same name as the current file in the active panel.</li></ul>
pt: Para comparar dois ficheiros por conteúdo, você pode ou<ul><li>Seleccionar um ficheiro no painel da esquerda, e um no painel da direita.</li><li>Seleccionar exactamente dois ficheiros no painel activo.</li><li>Certifique-se que há um ficheiro no outro painel, com o mesmo nome que o ficheiro actual no painel activo

source: Krusader can't find any of the supported diff-frontends. Please install one to your path. Hint: Krusader supports Kompare, Kdiff3 and Xxdiff.
pt: Krusader não consegue encontrar nenhum dos diff-frontends suportados. Por favor Instale um na sua localização. Dica: Krusader suporta Kompare, Kdiff3 e Xxdiff.

source: Can't find the 'locate' command. Please install the findutils-locate package of GNU, or set its dependencies in Konfigurator
pt: Não consigo encontrar o comando 'locate'. Instale o pacote findutils-locate do GNU, ou configure as dependências no Konfigurador

source: Can't start 'mount'! Check the 'Dependencies' page in konfigurator.
pt: Não consigo iniciar o 'mount'! Verifique a página das Dependências no konfigurador.

source: Can't find "KsysCtrl". Please install KDE admin package
jp: KsysCtrlがありません。KDEの管理用パッケージをインストールしてください
pt: Não consigo encontrar "Ksys Ctrl". Por favor instale o pacote de administração KDE

source: Can't find a batch rename tool. You can get Krename at http://www.krename.net
pt: Não consigo encontrar uma ferramenta de renomeação batch. Pode encontrar o Krename em http://www.krename.net

source: Can't start root mode krusader, because krusader or kdesu is missing from the path. Please configure the dependencies in Konfigurator!
pt: Não posso começar o modo SUPERUTILIZADOR do Krusader, porque o krusader ou o kdesu não estão no seu directório. Por favor configure as dependências no Konfigurador!

source: Enter a URL to view:
pt: Introduza um URL para ver:

source: Enter the filename to edit:
pt: Introduza o nome do ficheiro para editar:

source: Don't know which file to split.
pt: Não sei que ficheiro dividir.

source: You can't split a directory!
pt: Não pode dividir um directório!

source: Don't know which files to combine.
pt: Não sei quais os ficheiro a combinar.

source: You can't combine a directory!
pt: Não pode juntar um directório!

source: Not a split file %1!
pt: Não é um ficheiro dividido %1!

source: Select only one split file!
pt: Selecione só um ficheiro dividido!

source: Not a splitted file %1!
pt: Não é um ficheiro dividido %1!

source: Combining %1.* to directory:
pt: Juntando %1 para o directório:

source: Split the file %1 to directory:
pt: Separar o ficheiro (%1) para o directório:

source: User Defined
pt: Definido pelo Utilizador

source: Max file size:
pt: Máximo tamanho de ficheiro:

source: &Split
pt: &Separar

source: Krusader::Splitter
pt: Krusader::Divisor

source: The directory path URL is malformed!
pt: A localização do directório do URL está errada!

source: Krusader::Combining...
pt: Krusader::Juntando...

source: Combining the file %1...
pt: Juntando o ficheiro %1...

source: The CRC information file (%1) is missing! Validity checking is impossible without it. Continue combining?
pt: O ficheiro de informação CRC (%1)está em falta! A verificação de validade é impossível sem ele. Continuo a junção?

source: Error at reading the CRC file (%1)!
pt: Erro a ler o ficheiro CRC (%1)!

source: Not a valid CRC file!
pt: Ficheiro CRC inválido!

source: Validity checking is impossible without a good CRC file. Continue combining?
pt: Verificação da validade é impossível sem um bom ficheiro de CRC. Continuo a junção?

source: Can't open the first split file of %1!
pt: Não posso abrir o primeiro ficheiro dividido de %1!

source: Incorrect filesize! The file might have been corrupted!
pt: Tamanho de ficheiro incorrecto! O ficheiro pode ter sido corrumpido!

source: Incorrect CRC checksum! The file might have been corrupted!
pt: Checksum CRC incorrecto! O ficheiro pode ter sido corrumpido!

source: Error writing file %1!
pt: Erro a escrever no ficheiro %1!

source: Krusader::Splitting...
pt: Krusader::Dividindo...

source: Splitting the file %1...
pt: Dividindo o ficheiro %1...

source: Can't split a directory!
pt: Não posso dividir um directório!

source: Error reading file %1!
pt: Erro a ler o ficheiro%1!

source: Error at writing file %1!
pt: Erro a escrever no ficheiro %1!

source: F2 Term
jp: F2 端末

source: Protocol not supported by Krusader:
jp: Krusaderでサポートしていないプロトコルです:

source: Can't Read
jp: 読めません

source: Archive might be corrupted !
jp: 書庫が競合しています

source: Deleting Files...
jp: ファイルを削除..

source: Unpacking Files
jp: ファイルを解凍

source: Repacking...
jp: 再圧縮..

source: Can't create a directory check your permissions.
jp: ディレクトリを作れません。権限を確認してください

source: Failed to pack
jp: 圧縮に失敗

source: Configure preview
jp: プレビューを設定

source: compare mode
jp: 比較モード

source: Newer files
jp: 新しいファイル

source: Older files
jp: 古いファイル

source: Identical files
jp: 同じファイル

source: Exclusive files
jp: 排他ファイル

source: Open your bookmarks
jp: ブックマークを開く

source: No space information inside archives
jp: 書庫なので空き情報はありません

source: Terminal
jp: ターミナル

source: Shred
jp: シュレッダ

source: new symlink
jp: 新しいシンボリックリンク

source: new hardlink
jp: 新しいハードリンク

source: Link handling
jp: リンクの操作

source: Send by email
jp: Emailで送る

source: Perms
jp: 権限

source: ListPanel
jp: リストパネル

source: Can't re-enter archive. Going to the nearest path
jp: 書庫を再閲覧できません。最も近いパスに移動します

source: A directory or a file with this file already exists.
jp: このファイルのディレクトリ/ファイルは既に存在しています

source: Are you sure you want to
jp: 以下を実行しますか

source: Directory
jp: ディレクトリ

source: is not empty ! Skip this one or Delete All ?
jp: は空ではありません。 スキップ/削除しますか？

source: already exists, Do you want to overwrite the archive
jp: は既に存在しています。以下の書庫を上書きしますか

source: (all data in previous archive will be lost)
jp: (書庫内の全データが失われます)

source: &Overwite
jp: 上書き(&O)

source: %1, test failed !
jp: %1, テスト失敗

source: Unpack
jp: 解凍

source: Total occupied space: %1 in %2 directories and %3 files
jp: Total Size: %1 %2 directories/%3 files

source: Unable to remove your krusaderrc file! Please remove it manually and rerun Krusader.
jp: krusaderrcファイルを削除できません。手動で削除してKrusaderを再実行してください

source: Welcome to Krusader, as this is your first run, Krusader will now run Konfigurator.
jp: Krusaderへようこそ。初めての起動ですのでKonfiguratorを実行します

source: F2 Terminal
jp: F2 端末

source: F3 View
jp: F3 閲覧

source: F4 Edit
jp: F4 編集

source: F5 Copy
jp: F5 コピー

source: F7 Mkdir
jp: F7 Dir作成

source: F10 Quit
jp: F10 終了

source: Tab: switch panel
jp: タブ: パネル切替

source: Compare Mode
jp: 比較モード

source: Show &Terminal Emulator
jp: ターミナルを表示(&T)

source: Show H&idden Files
jp: 隠しファイルを表示(&i)

source: Sort By E&xtention
jp: 拡張子順(&x)

source: Configure compare-mode
jp: 比較モードを設定

source: Test Archi&ve(s)
jp: 書庫をテスト(&v)

source: &FTP Connect
jp: &FTPに接続

source: FT&P New Connection
jp: 新しいFT&P接続

source: &Properties
jp: プロパティ(&P)

source: Pac&k
jp: 圧縮(&k)

source: &Unpack
jp: 解凍(&U)

source: Select &Group
jp: グループを選択(&G)

source: &Terminal
jp: ターミナル(&T)

source: FTP Disc&onnect
jp: FTPを切断(&T)

source: &Search
jp: 検索(&S)

source: &Unselect &Group
jp: グループ(&G)の選択を解除(&U)

source: &Device Manager
jp: デバイスマネージャ(&D)

source: &Executables
jp: 実行ファイル(&E)

source: Compare b&y content
jp: 内容を比較(&y)

source: Multi Rename
jp: マルチリネーム

source: Right-click menu
jp: 右クリックメニュー

source: Highlight files by using a filter
jp: フィルタを使ってファイルをハイライト

source: Highlight all the files in the current directory
jp: 現在のディレクトリの全ファイルをハイライト

source: Mount.Man: Krusader's mount-manager. Try it!
jp: Mount.Man: Krusaderのマウントマネージャ

source: Add the current path to your bookmarks
jp: 現在のパスをブックマークに追加

source: Ok to shutdown Krusader ?
jp: Krusaderを終了しますか？

source: The date '
jp: 日付'

source: Dates are inconsistent !
jp: 日付が不正です

source: Don't search in
jp: この中は検索しない

source: Search in
jp: この中を検索する

source: Case sensetive
jp: 大文字小文字を区別する

source: Text:
jp: 語句:

source: Of type:
jp: 種類:

source: Search in subdirectories
jp: サブディレクトリを検索

source: Search in archives
jp: 書庫内を検索

source: Follow links
jp: リンクを追跡

source: Smaller than
jp: 以下より小さい

source: Bigger than
jp: 以下より大きい

source: Not modified in the last
jp: この期間内は変更なし

source: Not modified after
jp: この日以降は変更なし

source: Modified in the last
jp: この期間内に変更あり

source: Modified between
jp: この日以内に変更あり

source: Belongs to user
jp: 所有ユーザ

source: Belongs to group
jp: 所有グループ

source: All
jp: 全て

source: A bookmark with the same name already exist. If you create another one with the same name, how will you know which is which ? :-)
jp: 同じ名前のブックマークがあります。同じ名前のものを複数つくると、どちらがどちらか分からなくなりますよ :-)

source: Edit Bookmark
jp: ブックマークを編集

source: Clear the Name field
jp: 名前の項目をクリア

source: Browse for a new path
jp: 新しいパスを見る

source: Book.Man: Your Bookmark Manager
jp: Book.Man: ブックマークマネージャ

source: Sorted bookmarks
jp: ブックマークをソート

source: (example: Drive C:)
jp: (例: Drive C:)

source: Adding A New Bookmark
jp: 新しいブックマークを追加

source: (example: /mnt/drivec)
jp: (例: /mnt/drivec)

source: Bookmark Editor
jp: ブックマークエディタ

source: Press this to move the selected bookmark UP one place in the list
jp: 選択したブックマークを上に移動

source: Press this to move the selected bookmark DOWN one place in the list
jp: 選択したブックマークを下に移動

source: Edit Bookmarks
jp: ブックマークを編集

source: Unable to execute 'mount' !!! check that /bin/mount or /sbin/mount are availble
jp: 'mount'を実行できません。 /bin/mount か /sbin/mount があるか確認してください

source: Unable to complete the mount.
jp: マウントを完了できません

source: The error reported was:
jp: エラーの内容:

source: Unable to execute 'mount' !!! check that /bin/mount or /sbin/mount are availble
jp: 'mount'を実行できません。/bin/mount か /sbin/mount があるか確認してください

source: Unmounting device, please wait ...
jp: デバイスをアンマウント中。お待ちください..

source: Unable to execute 'umount' !!! check that /bin/umount or /sbin/umount are availble
jp: 'umount'を実行できません。/bin/umount か /sbin/umount があるか確認してください

source: Unable to complete the un-mount.
jp: アンマウントを完了できません

source: Error ejecting device ! You need to have 'eject' in your path.
jp: デバイスのイジェクト中にエラーが発生。パスに'eject'が必要です

source: No space information on a [procfs]
jp: [procfs]には容量の情報はありません

source: MtMan: internal error, sorry.
jp: MtMan: 内部エラーが発生

source: free out of
jp: 空き(全体:

source: Filesystems
jp: ファイルシステム

source: _: NAME OF TRANSLATORS Your names
jp: UTUMI Hirosi

source: %n directory
jp: %n ディレクトリ

source: %n file
jp: %n ファイル

source: %1 / %n directory
jp: %1 / %n ディレクトリ

source: %1 / %n file
jp: %1 / %n ファイル

source: New FTP Connection
jp: 新しいFTP接続

source: Select Compare Mode
jp: 比較モードを選択

source: Left Panel
jp: 左パネル

source: Show identical files
jp: 同じファイル

source: Show older files
jp: 古いファイル

source: Show newer files
jp: 新しいファイル

source: Show exclusive files
jp: 排他ファイル

source: Right Panel
jp: 右パネル

source: * Exclusive files don't exist in the other panel. * Color masks do not apply to directories
jp: * 排他ファイルは他のパネルに存在しない * 色分けはディレクトリには適用されない

source: Supermount device.
jp: スーパーマウントデバイス

source: Unable to get information
jp: 情報を取得できません

source: For details, please read
jp: 詳細については以下をお読みください

source: Move into archive
jp: 書庫内に移動

source: Newer files (compare mode)
jp: 新しいファイル(比較モード)

source: Older files (compare mode)
jp: 古いファイル(比較モード)

source: Identical files (compare mode)
jp: 同じファイル(比較モード)

source: Exclusive files (compare mode)
jp: 排他ファイル(比較モード)

source: New group
jp: 新しいグループ

source: New session
jp: 新しいセッション

source: Sessions
jp: セッション

source: Are you sure you want to delete this item ???
jp: このアイテムを削除しますか？

source: RemoteMan: Connection Manager
jp: RemoteMan: 接続マネージャ

source: Session name:
jp: セッション名:

source: &More
jp: 詳細(&M)

source: User name:
jp: ユーザ名:

source: Remote directory:
jp: リモートディレクトリ:

source: Co&nnect
jp: 接続(&n)

source: New &Group
jp: 新しいグループ(&G)

source: New Connec&tion
jp: 新しい接続(&t)

source: * Warning: Storing your password is not secure !!!
jp: * 警告: パスワードを保存すると危険です

source: &Mark
jp: 選択(&M)

source: &Commands
jp: コマンド(&C)

source: Left panel homepage
jp: 左パネルのホーム

source: Right panel homepage
jp: 右パネルのホーム

source: Terminal:
jp: ターミナル:

source: Editor:
jp: エディタ:

source: Note: you must have full permissions for the temporary directory !
jp: 注意: 一時ディレクトリについては全ての権限が必要です

source: Reset ALL of Krusader's options to factory defaults
jp: Krusaderの全オプションをデフォルトに戻す

source: Changes to the GUI will be updated next time you run Krusader.
jp: GUIの変更は次回の起動から有効になります

source: Welcome
jp: ようこそ

source: Welcome to Konfigurator
jp: Konfiguratorへようこそ

source: Krusader's setting upon startup
jp: 起動時のKrusaderの設定

source: Be sure you know what you're doing
jp: 注意して設定してください

source: Costumize the way Krusader deals with archives
jp: 書庫の扱いをカスタマイズ

source: The minimum font size used by the html viewer.
jp: htmlビューアの最小フォントサイズ

source: HTML viewer's min font size:
jp: HTMLビューアの最小フォント:

source: Automark directories
jp: ディレクトリを自動選択

source: Mouse Selection Mode:
jp: マウスでの選択:

source: Classic (both keys combined)
jp: クラシック(左右どちらも使う)

source: Right button selects (Windows Commander style)
jp: 右クリック(Windows Commanderスタイル)

source: Toolbar
jp: ツールバー

source: Key-bindings
jp: キーの割り当て

source: Krusader will request user confirmation for the following operations:
jp: 以下の操作を行うときは確認を求める:

source: Deleting non-empty directorie(s)
jp: 空ではないディレクトリを削除

source: Deleting file(s)
jp: ファイルを削除

source: Copying file(s)
jp: ファイルをコピー

source: Moving file(s)
jp: ファイルを移動

source: I AM ROOT - use with caution !
jp: rootで使用しています。ご注意ください

source: Show a tray icon
jp: トレイアイコンを表示

source: Krusader's startup state
jp: Krusaderの起動時の状態

source: Panels
jp: パネル

source: Start with the following settings:
jp: 以下の設定で開始:

source: Panel types (left,right):
jp: パネルの種類(左/右):

source: Left panel starts at
jp: 左パネルの開始場所

source: Right panel starts at
jp: 右パネルの開始場所

source: Homepage:
jp: ホーム:

source: Toolbar visible
jp: ツールバーを表示

source: Command-line visible
jp: コマンドラインを表示

source: Terminal Emulator visible
jp: ターミナルを表示

source: Restore last position and size
jp: 終了時の位置とサイズに戻す

source: Function keys visible
jp: ファンクションキーを表示

source: Statusbar visible
jp: ステータスバーを表示

source: The archives that are "greyed-out" were unavaible on your system last time Krusader checked. If you wish Krusader to search again, click the 'Auto Configure' button.
jp: 灰色で表示された書庫は現在扱うことができません。 「自動設定」をクリックして再検索してください。

source: Allow moving into archives
jp: 書庫内への移動を許可

source: Test archive when finished packing
jp: 圧縮完了時に書庫をテスト

source: Search results:
jp: 検索結果:
