Repository: CodeCollect/krusader
Catalog: po/*.po
Languages: jp, pt

source: tar: found, packing and unpacking enabled.
jp: tar: あり。圧縮/解凍できます

source: tar: NOT found, packing and unpacking DISABLED. ==> tar can be obtained at www.gnu.org
jp: tar: なし。 packing and unpacking DISABLED. ==> tar can be obtained at www.gnu.org

source: gzip: found, packing and unpacking enabled.
jp: gzip: あり。圧縮/解凍できます

source: gzip: NOT found, packing and unpacking DISABLED. ==> gzip can be obtained at www.gnu.org
jp: gzip: なし。 packing and unpacking DISABLED. ==> gzip can be obtained at www.gnu.org

source: bzip2: found, packing and unpacking enabled.
jp: bzip2: あり。圧縮/解凍できます

source: bzip2: NOT found, packing and unpacking DISABLED. ==> bzip2 can be obtained at www.gnu.org
jp: bzip2: なし。 packing and unpacking DISABLED. ==> bzip2 can be obtained at www.gnu.org

source: unzip: found, unpacking enabled.
jp: unzip: あり。解凍できます

source: unzip: NOT found, unpacking DISABLED. ==> unzip can be obtained at www.info-zip.org
jp: unzip: なし。 unpacking DISABLED. ==> unzip can be obtained at www.info-zip.org

source: zip: found, packing enabled.
jp: zip: あり。圧縮できます

source: zip: NOT found, packing DISABLED. ==> zip can be obtained at www.info-zip.org
jp: zip: なし。 packing DISABLED. ==> zip can be obtained at www.info-zip.org

source: rpm: found, unpacking enabled.
jp: rpm: あり。解凍できます

source: rpm: NOT found, unpacking is DISABLED. ==> rpm can be obtained at www.gnu.org
jp: rpm: なし。解凍できません ==> rpm can be obtained at www.gnu.org

source: unrar: found, unpacking is enabled.
jp: unrar: あり。 unpacking is enabled.

source: unrar: NOT found, unpacking is DISABLED. ==> unrar can be obtained at www.rarsoft.com
jp: unrar: なし。解凍できません ==> unrar can be obtained at www.rarsoft.com

source: rar: found, packing is enabled.
jp: rar: あり。 packing is enabled.

source: rar: NOT found, packing is DISABLED. ==> rar can be obtained at www.rarsoft.com
jp: rar: なし。圧縮できません ==> rar can be obtained at www.rarsoft.com

source: unarj: found, unpacking is enabled.
jp: unarj: あり。 unpacking is enabled.

source: unarj: NOT found, unpacking is DISABLED. ==> unarj can be obtained at www.arjsoft.com
jp: unarj: なし。解凍できません ==> unarj can be obtained at www.arjsoft.com

source: unace: found, unpacking is enabled.
jp: unace: あり。 unpacking is enabled.

source: unace: NOT found, unpacking is DISABLED. ==> unace can be obtained at www.winace.com
jp: unace: なし。解凍できません ==> unace can be obtained at www.winace.com

source: Thanks for flying Krusader :-)
jp: Krusaderをお使いいただきありがとうございます

source: Choose an editor
jp: エディタを選択

source: Choose a terminal
jp: ターミナルを選択

source: Choose a temporary directory
jp: 一時ディレクトリを選択

source: Searching for tools... Search results:
jp: ツールを検索.. 検索結果:

source: Krusader can't find any of the supported mail clients. Please install one to your path. Hint: Krusader supports kmail.
jp: サポートしているメールクライアントがありません。パスに何かをインストールしてください。ヒント: Krusaderはkmailをサポートしています。

source: Sending file:
jp: 以下のファイルを送る:

source: Error executing
jp: 実行中にエラー

source: Krusader can't find any of the supported diff-frontends. Please install one to your path. Hint: Krusader supports kdiff and xxdiff.
jp: サポートしているdiffフロントエンドがありません。パスに何かをインストールしてください。ヒント: Krusaderはkdiffとxxdiffをサポートしています。

source: Can't find a batch renamer tool. You can get Krename at http://krename.sf.net
jp: batchリネームツールがありません。Krenameをhttp://krename.sf.netで取得してください
