Repository: CodeCollect/krusader
Catalog: po/*.po
Languages: jp, pt

source: Show file sizes
pt: Mostrar tamanho dos ficheiros:

source: Lines
pt: Linhas

source: Rainbow
pt: Arco-Iris

source: High Contrast
pt: Alto Contraste

source: Scheme
pt: Esquema

source: Increase contrast
pt: Aumentar Contraste

source: Decrease contrast
pt: Diminuir Contraste

source: Show small files
pt: Mostrar ficheiros pequenos

source: Vary label font sizes
pt: Variar tamanhos das etiquetas das fontes

source: Minimum font size
pt: Tamanho mínimo das fontes

source: Krusader::Disk Usage
pt: Krusader::Utilização Disco

source: Start new disk usage search
pt: Começar nova procura de utilização de disco

source: Refresh
pt: Refrescar

source: Parent directory
pt: Directório anterior

source: Line view
pt: Vista de linha

source: Detailed view
pt: Vista detalhada

source: Filelight view
pt: Vista Filelight

source: Viewing the usage of directory:
pt: Ver a utilização do directório:

source: Total size
pt: Tamanho Total

source: Own size
pt: Próprio tamanho

source: Loading Usage Information
pt: Carregando Informação de Utilização

source: Files:
pt: Ficheiros:

source: Directories:
pt: Directórios:

source: Total Size:
pt: Tamanho Total:

source: Loading the disk usage information...
pt: Carregando a informação da utilização de disco...

source: Stepping into the parent directory requires loading the content of the "%1" URL. Do you wish to continue?
pt: Ir para o directório superior requer carregar o conteúdo de "%1" URL. Deseja continuar?

source: Krusader::DiskUsage
pt: Krusader::UtilizaçãoDisco

# singularOnly
source: Do you really want to move this item to the trash?
pt: Tem a certeza que quer mover este item para o lixo?

# singularOnly
source: Do you really want to delete this item?
pt: Tem a certeza que quer apagar este item?

source: Deleting %1...
pt: A apagar %1...

source: Current directory:%1, Total size:%2, Own size:%3
pt: Directório actual: %1, Tamanho total:%2, Próprio tamanho:%3

source: Disk Usage
pt: Utilização Disco

source: Exclude
pt: Excluir

source: Up one directory
pt: Para cima um directório

source: New search
pt: Nova procura

source: Include all
pt: Incluir todos

source: Step into
pt: Ir para

source: Detailed
pt: Detalhada

source: Next
pt: Próximo

source: Previous
pt: Anterior

source: View
pt: Ver

source: Type:
pt: Tipo:

source: Own size:
pt: Próprio tamanho:

source: Last modified:
pt: Última modificação:

source: Permissions:
pt: Permissões:

source: Owner:
pt: Dono:

source: &File
pt: &Ficheiro

source: &Edit
pt: &Editar

source: Compare Se&tup
pt: Comparar Configuração(&t)

source: &View
pt: &Ver

source: &Go
pt: &Ir

source: &Tools
pt: Ferramentas(&T)

source: &Settings
pt: Configuraçõe&S

source: Command Execution Mode Se&tup
pt: Configuração do Modo de Execução(&t)

source: &Window
pt: Janela(&W)

source: &Help
pt: Ajuda(&H)

# NAME OF TRANSLATORS
source: Your names
pt: Bruno Miguel da Silva Queirós

# EMAIL OF TRANSLATORS
source: Your emails
pt: brunoqueiros@portugalmail.com

source: General
jp: 一般
pt: Geral

source: Packers
pt: Compactadores

source: Checksum Utilities
pt: Utilidades Checksum

source: The %1 path is incorrect, no valid path found.
pt: O caminho %1 está incorrecto, nenhum caminho válido encontrado.

source: The %1 path is incorrect, %2 used instead.
pt: O caminho %1 está incorrecto, %2 usado em vez desse.

source: Delete files
jp: 完全に削除
pt: Apagar ficheiros

source: Files will be permanently deleted.
pt: Os ficheiros serão apagados permanentemente.

source: Move to trash
jp: ゴミ箱へ移動
pt: Mover para o lixo

source: Files will be moved to trash when deleted.
pt: Os ficheiros serão movidos para o Lixo quando forem apagados.

source: Use mimetype magic
pt: Usar tipo-mime mágico

source: Mimetype magic allows better distinction of file types, but is slower.
pt: TipoMime mágico permite uma melhor distinção entre tipos de ficheiros, mas é mais lento.

source: Hint: use 'internal editor' if you want to use Krusader's fast built-in editor
jp: ヒント: Krusaderに組み込んでいる高速エディタを使う場合は、「内部エディタ」を使ってください
pt: Dica: use o editor interno se quiseres usar o rápido editor incorporado do Krusader

source: Default viewer mode:
pt: Modo padrão de visualização:

source: Generic mode
pt: Modo Genérico

source: Use the system's default viewer
pt: Usar o visualizador padrão do sistema

source: Text mode
pt: Modo Texto

source: View the file in text-only mode
pt: Ver o ficheiro em modo de texto

source: Hex mode
pt: Modo Hex

source: View the file in hex-mode (better for binary files)
pt: Ver o ficheiro em modo-hex (melhor para ficheiros binários)

source: Internal editor and viewer opens each file in a separate window
pt: Vizualizador e editor interno abre cada ficheiro numa janela separada

source: If checked, each file will open in a separate window, otherwise, the viewer will work in a single, tabbed mode
pt: Se seleccionado, cada ficheiro irá abrir numa janela separada, senão, o visualizador irá trabalhar num único, modo separado.

source: Atomic extensions:
pt: Extensões atómicas:

source: Terminal Emulator sends Chdir on panel change
pt: Emulador de Terminal envia Chdir na alteração de painel

source: When checked, whenever the panel is changed (for example, by pressing TAB), krusader changes the current directory in the terminal emulator.
pt: Quando seleccionado, sempre que o painel é alterado (por exemplo, ao pressionar TAB), krusader muda o directório actual no emulador de terminal.

source: Temp Directory:
jp: 一時ディレクトリ:
pt: Directório temporário:

source: Note: you must have full permissions for the temporary directory!
pt: Nota: Você tem que ter permissões totais para o directório temporário !

source: Searching for tools...
pt: Procurando ferramentas...

source: Make sure to install new tools in your <code>$PATH</code> (e.g. /usr/bin)
pt: Certifique-se que instala novas ferramentas na sua <code>$PATH</code> (ex. /usr/bin)

source: Add new atomic extension
pt: Adicionar nova extensão atómica

source: Extension:
pt: Extensão:

source: Atomic extensions must start with '.' and must contain at least one more '.' character
pt: Extensões atómicas devem começar com '.' e deve conter pelo menos mais um carater '.'

source: unarj not found, but arj found, which will be used for unpacking
pt: unarj não encontrado, mas arj encontrado, o que irá ser utilizado na compactação

source: rpm found, but cpio not found which is required for unpacking
pt: rpm encontrado, mas cpio não encontrado e é necessário para a extracção

source: Found
pt: Encontrado

source: Packing
pt: Compactando

source: Unpacking
pt: Extraindo

source: Note
pt: Nota

source: enabled
pt: activada

source: disabled
pt: desactivada

source: diff utility
pt: utilidade diff

source: email client
pt: cliente de email

source: batch renamer
pt: renomeador batch

source: checksum utility
pt: utilidade checksum

source: Tool
pt: Ferramenta

source: Defaults
jp: デフォルト
pt: Predefinições

source: Konfigurator - Creating Your Own Krusader
jp: Konfigurator - Krusaderを設定する
pt: Konfigurador - Criando O Seu Próprio Krusader

source: Startup
jp: 起動
pt: Arranque

source: Krusader's settings upon startup
pt: Configurações do Krusader após arranque

source: Look & Feel
jp: 外観
pt: Aparência & Comportamento

source: Colors
pt: Cores

source: Basic Operations
jp: 基本的な操作
pt: Operações Básicas

source: Advanced
jp: 詳細
pt: Avançado

source: Be sure you know what you're doing!
pt: Tenha a certeza do que está a fazer!

source: Customize the way Krusader deals with archives
pt: Personalizar a maneira como o Krusader trata os arquivos

source: Dependencies
pt: Dependências

source: Set the full path of the external applications
pt: Introduz o caminho completo das aplicações externas

source: Configure your personal actions
pt: Configure as suas acções pessoais

source: Protocols
pt: Protocolos

source: Link mimes to protocols
pt: Liga mimes aos protocolos

source: The current page has been changed. Do you want to apply changes?
pt: A página actual foi alterada. Quer aplicar as alterações?

source: Operation
pt: Operação

source: Look && Feel
pt: Aparência && Comportamento

source: Warn on exit
jp: 終了時に警告する
pt: Avisar ao sair

source: Display a warning when trying to close the main window.
pt: Mostra um aviso quando tentar fechar a janela principal.

source: Minimize to tray
jp: トレイに最小化
pt: Minimizar para o tabuleiro

source: The icon will appear in the system tray instead of the taskbar, when Krusader is minimized.
pt: Quando minimizar o Krusader, o seu icone irá aparecer no tabuleiro do sistema em vez da barra de tarefas.

source: Autoselect directories
pt: Autoseleccionar directórios

source: When matching the select criteria, not only files will be selected, but also directories.
pt: Ao encontrar a selecção escolhida, não só os ficheiros serã seleccionados, mas também directórios.

source: Rename selects extension
pt: Renomear extensão das selecções

source: When renaming a file, the whole text is selected. If you want Total-Commander like renaming of just the name, without extension, uncheck this option.
pt: Quando renomear um ficheiro, todo o texto é seleccionado. Se quiser uma renomeação ao estilo do Total Commander, do nome apenas, sem extensão, desmarque esta opção.

source: Use full path tab names
pt: Usa o caminho completo dos nomes das páginas

source: Display the full path in the folder tabs. By default only the last part of the path is displayed.
pt: Mostra a localização completa nos separadores das pastas. Por defeito só a última parte da localização será mostrada.

source: Fullscreen terminal (mc-style)
pt: Terminal de ecrã inteiro (estilo-mc)

source: Terminal is shown instead of the Krusader window (full screen).
pt: O terminal é mostrado em vez da janela do Krusader (ecrã inteiro).

source: Quicksearch
pt: Procura rápida

source: New style quicksearch
pt: Novo estilo de procura rápida

source: Opens a quick search dialog box.
pt: Abre uma caixa de diálogo de procura rápida.

source: Case sensitive quicksearch
pt: Procura rápida sensível à capitalização

source: All files beginning with capital letters appear before files beginning with non-capital letters (UNIX default).
pt: Todos os ficheiros que começam com letra grande aparecem antes dos ficheiros que começam com letras pequenas (padrão UNIX).

source: Panel settings
pt: Configurações do Painel

source: Panel font:
jp: パネルのフォント:
pt: Tipo de letra do Painel:

source: Filelist icon size:
jp: ファイルリストのアイコンサイズ:
pt: Tamanho do ícone da lista de ficheiros:

source: Use icons in the filenames
pt: Usar ícones nos nomes de ficheiros

source: Show the icons for filenames and folders.
pt: Mostra os ícones para os nomes de ficheiros e pastas.

source: Use human-readable file size
pt: Usar tamanho de ficheiro humanamente legível

source: File sizes are displayed in B, KB, MB and GB, not just in bytes.
pt: Tamanho de ficheiros são mostrados em B, KB, MB and GB, não só em bytes.

source: Show hidden files
jp: 隠しファイルを表示
pt: Mostrar os ficheiros escondidos

source: Display files beginning with a dot.
pt: Mostrar ficheiros começadas por um ponto.

source: Case sensitive sorting
jp: 大文字小文字を区別してソート
pt: Ordenação sensível à capitalização

source: Always sort dirs by name
pt: Ordenar sempre os dirs por nome

source: Directories are sorted by name, regardless of the sort column.
pt: Os directórios são ordenados por nome, independentemente da coluna de ordenação.

source: Numeric Permissions
pt: Permissões Numéricas

source: Show octal numbers (0755) instead of the standard permissions (rwxr-xr-x) in the permission column.
pt: Mostra número em octal (0755) em vez das permissões padrão (rwxr-xr-x) na coluna das permissões.

source: Default panel type:
pt: Painel esquerdo padrão:

source: Panel Toolbar
pt: Painel Barra de Ferramentas

source: Show Panel Toolbar
pt: Mostrar Painel Barra de Ferramentas

source: The panel toolbar will be visible.
pt: O painel Barra de Ferramentas ficará visível.

source: Visible Panel Toolbar buttons
pt: Botões Painel Barra de Ferramentas visiveis

source: Open button
pt: Botão abrir

source: Opens the directory browser.
pt: Abrir o navegador dos directórios

source: Equal button (=)
pt: Botão igual (=)

source: Changes the panel directory to the other panel directory.
pt: Muda o painel de directórios para o directório do outro painel.

source: Up button (..)
pt: Botão subir (..)

source: Changes the panel directory to the parent directory.
pt: Muda o directório do painel para o directório superior.

source: Home button (~)
pt: Botão Casa (~)

source: Changes the panel directory to the home directory.
pt: Muda o directório do painel para o directório Casa.

source: Root button (/)
pt: Botão Raiz (/)

source: Changes the panel directory to the root directory.
pt: Muda o directório painel para o directório raiz.

source: Toggle-button for sync-browsing
pt: Botão modificador para navegação-sincronizada

source: Each directory change in the panel is also performed in the other panel.
pt: Cada alteração no directório num painel também é feita no outro painel.

source: Selection Mode
pt: Modo Selecção

source: Krusader Mode
pt: Modo Krusader

source: Both keys allow selecting files. To select more than one file, hold the Ctrl key and click the left mouse button. Right-click menu is invoked using a short click on the right mouse button.
pt: Ambas as teclas permitem seleccionar ficheiros. Para seleccionar mais que um ficheiro, pressiona Ctrl e faz clique com o botão esquerdo do rato.O menu do Clique-direito é invocado dano um pequeno clique no botão direito do rato.

source: Konqueror Mode
pt: Modo Konqueror

source: Pressing the left mouse button selects files - you can click and select multiple files. Right-click menu is invoked using a short click on the right mouse button.
pt: Pressionando no botão esquerdo do rato selecciona ficheiros - você pode clicar e seleccionar múltiplos ficheiros.O menu Clique-direito é invocado dando um pequeno clique no botão direito do rato.

source: Total-Commander Mode
pt: Modo Total-Commander

source: The left mouse button does not select, but sets the current file without affecting the current selection. The right mouse button selects multiple files and the right-click menu is invoked by pressing and holding the right mouse button.
pt: O botão esquerdo do rato não selecciona, mas marca o currente ficheiro sem afectar a selecção actual.O botão direito do rato selecciona múltiplos ficheiros e o menu clique-direito é invocado pressionando e mantendo pressionado o botão direito do rato.

source: Custom Selection Mode
pt: Modo Selecção Personalizada

source: Design your own selection mode!
pt: Faça o seu próprio modo de selecção!

source: Details
pt: Detalhes

source: Double-click selects (classic)
pt: Duplo clique selecciona (clássico)

source: A single click on a file will select and focus, a double click opens the file or steps into the directory.
pt: Um único clique num ficheiro selecciona e foca, um duplo clique abre o ficheiro ou entra dentro de um directório.

source: Obey KDE's global selection policy
pt: Obedece à política global de selecção do KDE

source: <p>Use KDE's global setting:</p><p><i>KDE Control Center -> Peripherals -> Mouse</i></p>
pt: <p>Usar a configuração global do KDE:</p><p><i> KDE Centro de Controlo->Periféricos->Rato</i></p>

source: Based on KDE's selection mode
pt: Baseado no modo de selecção do KDE

source: If checked, use a mode based on KDE's style.
pt: Se seleccionado, usará um modo baseado no estilo do KDE.

source: Left mouse button selects
jp: 左クリック
pt: O botão esquerdo do rato selecciona

source: If checked, left clicking an item will select it.
pt: Se seleccionado, clickando com o botão esquerdo irá seleccioná-lo.

source: Left mouse button preserves selection
pt: O botão esquerdo do rato preserva selecção

source: If checked, left clicking an item will select it, but will not unselect other, already selected items.
pt: Se seleccionado, clickando com o botão esquerdo irá seleccioná-lo, mas não irá desmarcar outros, items previamente seleccionados.

source: Shift/Ctrl-Left mouse button selects
pt: Shift/Ctrl-O botão esquerdo do rato selecciona

source: If checked, shift/ctrl left clicking will select items. Note: This is meaningless if 'Left Button Selects' is checked.
pt: Se seleccionado,shift/ctrl clickando com o botão esquerdo irá seleccionar items. Nota: Isto não terá significado se Botão Esquerdo Selecciona está seleccionado.

source: Right mouse button selects
pt: O botão direito do rato selecciona

source: If checked, right clicking an item will select it.
pt: Se seleccionado, clicando com o botão direito num item irá seleccioná-lo.

source: Right mouse button preserves selection
pt: O botão direito do rato preserva selecção

source: If checked, right clicking an item will select it, but will not unselect other, already selected items.
pt: Se seleccionado, clickando com o botão direito num item irá seleccioná-lo, mas não irá desmarcar outros, items previamente seleccionados.

source: Shift/Ctrl-Right mouse button selects
pt: Shift/Ctrl-O botão direito do rato selecciona

source: If checked, shift/ctrl right clicking will select items. Note: This is meaningless if 'Right Button Selects' is checked.
pt: Se seleccionado,shift/ctrl clickando com o botão direito irá seleccionar items. Nota: Isto não terá significado se Botão Direito Selecciona está seleccionado.

source: Spacebar moves down
pt: Barra de espaços move para baixo

source: If checked, pressing the spacebar will select the current item and move down. Otherwise, current item is selected, but remains the current item.
pt: Se seleccionado, premindo a barra de espaços irá seleccionar o currente item e mover para baixo. Noutro caso, o currente item é seleccionado, mas permanece o currente item.

source: Spacebar calculates disk space
pt: Barra de espaços calcula tamanho do disco

source: If checked, pressing the spacebar while the current item is a folder, will (except from selecting the folder) calculate space occupied by the folder (recursively).
pt: Se seleccionado, premindo a barra de espaços enquanto o currente item é uma pasta, irá (sem ser seleccionado de uma pasta) calcular o espaço ocupado pela pasta (recursivamente).

source: Insert moves down
pt: Insert move para baixo

source: If checked, pressing INSERT will select the current item, and move down to the next item. Otherwise, current item is not changed.
pt: Se seleccionado, premindo o INSERT irá seleccionar o currente item e mover para baixo para o próximo item. Noutro caso, o currente item não é alterado.

source: Right clicking pops context menu immediately
pt: Click direito abre o menu de contexto imediatamente

source: If checked, right clicking will result in an immediate showing of the context menu. Otherwise, user needs to click and hold the right mouse button for 500ms.
pt: Se seleccionado, clickando com o botão direito irá resultar na visualização imediata do menu de contexto. Noutro caso, o utilizador necessita de clickar e segurar o botão direito do rato por 500ms.

source: Preserve attributes for local copy/move (slower)
pt: Preservar atributos para copiar/mover local (mais rápido)

source: Krusader will try to preserve all attributes (time, owner, group) of the local files according to the source depending on your permissions:<ul><li>User preserving if you are root</li><li>Group preserving if you are root or member of the group</li><li>Preserving the timestamp</li></ul><b>Note</b>: This can slow down the copy process.
pt: O Krusader irá tentar preservar todos os atributos (tempo, dono, grupo) dos ficheiros locais de acordo com a origem, dependendo das suas permissões:<ul><li>Preservação de Utilizador se você for root</li><li>Preservação de Grupo se você é root ou membro do grupo</li><li>Preservação da marca de tempo</li></ul><b>Nota</b>: Isto pode atrasar o processodecópia.

source: Automount filesystems
jp: 自動的にマウント
pt: Automontar sistemas de ficheiros

source: When stepping into a directory which is defined as a mount point in the <b>fstab</b>, try mounting it with the defined parameters.
pt: Ao entrar num directório que está definido como ponto de montagem no <b>fstab</b>, tenta montá-lo com os parâmetros lá definidos.

source: MountMan won't (un)mount the following mount-points:
pt: MountMan não irá (des)montar os seguintes pontos de montagem:

source: Confirmations
jp: 確認
pt: Confirmações

source: Request user confirmation for the following operations:
pt: Pede ao utilizador confirmação para as seguintes operações:

source: Deleting non-empty directories
pt: Apagando directórios não-vazios

source: Deleting files
pt: A apagar ficheiros

source: Copying files
pt: A copiar ficheiros

source: Moving files
pt: Movendo ficheiros

source: Confirm feed to listbox
pt: Confirmar feed para a caixa de listas

source: Ask for a result name when feeding items to the listbox. By default the standard value is used.
pt: Pede por um nome dos resultados quando fornecendo items para a caixa de listas. Por defeito o valor padrão é usado.

source: Removing Useractions
pt: Removendo Acções do utilizador

source: Fine-Tuning
jp: 細かい設定
pt: Ajuste detalhado

source: Icon cache size (KB):
jp: アイコンキャッシュのサイズ(KB):
pt: Tamanho da cache do ícone (KB):

source: The icon cache size influences how fast the contents of a panel can be displayed. However, too large a cache might consume your memory.
pt: O tamanho da cache dos icones influencia a velocidade a que o Krusader pode mostrar os conteúdos de um painel; Contudo uma cache muito grande consome muita memória.

source: Arguments of updatedb:
pt: Argumentos de actualizaçãobd:

source: Links
pt: Ligações

source: Defined Links
pt: Ligações Definidas

source: Add protocol to the link list.
pt: Adicionar protocolo à lista de ligações.

source: Remove protocol from the link list.
pt: Remover protocolo da lista de ligações.

source: Add mime to the selected protocol on the link list.
pt: Adicionar mimme ao protocolo seleccionado na lista de ligações.

source: Remove mime from the link list.
pt: Remover mime da lista de ligações.

source: Custom color
pt: Cor personalizada

source: Red
pt: Vermelho

source: Green
pt: Verde

source: Blue
pt: Azul

source: Cyan
pt: Rosa

source: Magenta
pt: Roxo

source: Yellow
pt: Amarelo

source: Dark Red
pt: Vermelho escuro

source: Dark Green
pt: Verde Escuro

source: Dark Blue
pt: Azul Escuro

source: Dark Cyan
pt: Rosa Escuro

source: Dark Magenta
pt: Roxo Escuro

source: Dark Yellow
pt: Amarelo Escuro

source: White
pt: Branco

source: Light Gray
pt: Cinzento Claro

source: Gray
pt: Cinzento

source: Dark Gray
pt: Cinzento Escuro

source: Black
pt: Negro

source: Use the default KDE colors
pt: Usar as cores por defeito do KDE

source: <p>Use KDE's global color configuration.</p><p><i>KDE Control Center -> Appearance & Themes -> Colors</i></p>
pt: <p>Use a configuração de cores global do KDE.</p><p><i>KDE Centro de Controlo -> Aparência & Temas -> Cores</i></p>

source: Use alternate background color
pt: Usar cor de fundo alternada

source: <p>The <b>background color</b> and the <b>alternate background</b> color alternates line by line.</p><p>When you don't use the <i>KDE default colors</i>, you can configure the alternate colors in the <i>colors</i> box.</p>
pt: <p>A <b>cor de fundo</b> e a cor <b>fundo alternado</b> mudam linha a linha.</p><p>Quando não usa as <i>cores por defeito do Krusader</i>, você pode configurar as cores alternativas na caixa <i>cores</i>.</p>

source: Show current item even if not focused
pt: Mostrar item actual mesmo se não tiver foco
