Repository: CodeCollect/krusader
Catalog: po/*.po
Languages: jp, pt

source: %1 (Link)
jp: %1 (リンク)
pt: %1 (Ligação)

source: %1 out of %2, %3 (%4) out of %5 (%6)
pt: %1 de %2, %3 (%4) de %5 (%6)

source: Rename
jp: リネーム
pt: Renomear

source: Rename
pt: Renomear

source: to:
pt: para:

source: Tree Panel: a tree view of the local file system
pt: Árvore Painel: uma vista em árvore do sistema de ficheiros local

source: Preview Panel: display a preview of the current file
pt: Painel de Antevisão: mostra a antevisão do ficheiro actual

source: Quick Panel: quick way to perform actions
pt: Painel Rápido: maneira rápida de executar acções

source: View Panel: view the current file
pt: Painel de Visualização: visualiza o ficheiro actual

source: Disk Usage Panel: view the usage of a directory
pt: Painel Utilização Disco: vê a ocupação de um directório

source: Disk Usage:
pt: Utilização Disco:

source: Quick Select
pt: Selecção Rápida

source: apply the selection
pt: aplicar a selecção

source: store the current selection
pt: armazenar a selecção actual

source: select group dialog
pt: diálogo de selecção de grupo

source: Tree:
pt: Árvore:

source: Preview:
pt: Antevisão:

source: Quick Select:
pt: Selecção Rápida:

source: View:
pt: Ver:

source: Disk Usage:
pt: Utilização Disco:

source: Preview:
pt: Antevisão:

source: View:
pt: Ver:

source: Calculate Occupied Space
pt: Calcular Espaço Ocupado

source: Name:
pt: Nome:

source: Total occupied space: %1
pt: Total de espaço ocupado: %1

source: in %1 directory
pt: : em %1 directório

source: and %1 file
pt: : e %1 ficheiro

source: Open/Run
pt: Abrir/Executar

source: Run
jp: 実行
pt: Executar

source: Open in New Tab
pt: Abrir num Separador Novo

source: Preview
jp: プレビュー
pt: Antevisão

source: Other...
jp: その他..
pt: Outro...

source: Open With
pt: Abrir Com

source: Konqueror Menu
pt: Menu Konqueror

source: Copy...
pt: Copiar...

source: Move...
pt: Mover...

source: Move to Trash
pt: Mover para o Lixo

source: Delete
pt: Apagar

source: New Symlink...
pt: Novo Symlink...

source: New Hardlink...
pt: Novo Hardlink...

source: Redirect Link...
pt: Redireccionar Ligação...

source: Link Handling
pt: Manuseamento de Ligação

source: Send by Email
pt: Enviar por E-mail

source: Synchronize Selected Files...
pt: Sincronizar Ficheiros Seleccionados...

source: Copy to Clipboard
pt: Copiar para a Área de Transferência

source: Cut to Clipboard
pt: Cortar para Área de Transferência

source: Paste from Clipboard
pt: Colar da Área de Transferência

source: Folder...
pt: Pasta...

source: Text File...
pt: Ficheiro Texto...

source: Create New
pt: Criar Novo

source: You can edit links only on local file systems
jp: 編集できるのはローカルファイルのリンクだけです
pt: Só pode editar ligações em sistemas de ficheiros locais

source: The current file is not a link, so I can't redirect it.
pt: O ficheiro actual não é uma ligação, por isso não posso redireccioná-lo.

source: Link Redirection
pt: Redireccionamento da Ligação

source: Please enter the new link destination:
pt: Por favor introduza o novo destino da ligação:

source: Can't remove old link:
jp: 古いリンクを削除できません:
pt: Não posso remover a ligação antiga:

source: Failed to create a new link:
jp: 新しいリンクの作成に失敗:
pt: Falhou a criação de uma nova ligação:

source: You can create links only on local file systems
jp: 作成できるのはローカルファイルのリンクだけです
pt: Só pode criar ligações em sistemas de ficheiros locais

source: New link
pt: Nova ligação

source: Create a new link to:
jp: 以下へのリンクを作成:
pt: Criar uma nova ligação para:

source: A directory or a file with this name already exists.
pt: Um directório ou um ficheiro com este nome já existe.

source: Failed to create a new symlink:
jp: 新しいシンボリックリンクの作成に失敗:
pt: Falhou a criação de um novo symlink:

source: To:
pt: Para:

source: No permissions to view this file.
jp: このファイルを閲覧する権限がありません
pt: Não tem permissões para ver este ficheiro.

source: You can't edit a directory
jp: ディレクトリを編集できません
pt: Não pode editar um directório

source: No permissions to edit this file.
jp: このファイルを編集する権限がありません
pt: Não tem permissões para editar este ficheiro.

source: Moving into archive is disabled
pt: Mover para o arquivo está desactivado

source: Move %1 to:
pt: Mover %1 para:

source: Move %1 file to:
pt: Mover %1 ficheiro para:

source: You can't move files to this file system
jp: このファイルシステムにファイルを移動することはできません
pt: Não pode mover ficheiros para este sistema de ficheiros

source: New directory
pt: Novo directório

source: Directory's name:
jp: ディレクトリ名:
pt: Nome do directório:

source: Copy %1 to:
pt: Copiar %1 para:

source: Copy %1 file to:
pt: Copiar %1 ficheiro para:

source: You can't copy files to this file system
jp: コピーできるのはこのファイルシステムのファイルだけです
pt: Não pode copiar ficheiros para este sistema de ficheiros

source: You do not have write permission to this directory
jp: このディレクトリを読み込む権限がありません
pt: Você não tem permissões para escrever neste directório

source: Do you really want to move this item to the trash?
pt: Tem a certeza que quer mover este item para o lixo?

source: &Trash
jp: ゴミ箱(&T)
pt: Lixo(&T)

source: &Delete
pt: Apagar(&D)

source: <qt>Do you really want to delete this item <b>physically</b> (not just removing it from the virtual items)?</qt>
pt: <qt>Você quer mesmo apagar este item <b>fisicamente</b> (não só apenas removê-lo dos items virtuais)?</qt>

source: Do you really want to delete this item?
pt: Você quer mesmo apagar este item?

source: Warning
pt: Aviso

source: <qt><p>Directory <b>%1</b> is not empty!</p><p>Skip this one or Delete All?</p></qt>
pt: <qt><p>Directório <b>%1</b> não está vazio!</p><p>Ignorar este ou Apagar Todos?</p></qt>

source: &Skip
jp: スキップ(&S)
pt: &Saltar

source: &Delete All
jp: 全て削除(&D)
pt: Apagar Todos(&D)

source: Cannot pack files onto a virtual destination!
pt: Impossível compactar ficheiros para um destino virtual!

source: <qt><p>The archive <b>%1.%2</b> already exists. Do you want to overwrite it?</p><p>All data in the previous archive will be lost!</p></qt>
pt: <qt><p>O arquivo <b>%1.%2</b> já existe. Você quer gravar por cima?</p><p>Toda a informação no arquivo antigo será perdida!</p></qt>

source: <qt><p>The archive <b>%1.%2</b> already exists. Do you want to overwrite it?</p><p>Zip will replace identically named entries in the zip archive or add entries for new names.</p></qt>
pt: <qt><p>O arquivo <b>%1.%2</b> já existe. Você quer gravar por cima?</p><p>O ZIP irá substiuir entradas com nomes idênticos no arquivo zip ou adicionar entradas para os novos nomes.</p></qt>

source: Counting files to pack
jp: 圧縮するためファイルを数える
pt: Contando os ficheiros para compactar

source: Krusader is unable to download:
jp: Krusaderは以下をダウンロードできません:
pt: O Krusader não é capaz de fazer a tranferência:

source: %1, unknown archive type.
jp: %1, 書庫の種類が不明
pt: %1, tipo de arquivo desconhecido.

source: %1, test passed.
jp: %1, テスト成功
pt: %1, passou no teste.

source: %1, test failed!
pt: %1, falhou o teste!

source: Unpack %1 to:
pt: Extrair %1 para:

source: Unpack %1 file to:
pt: Extrair %1 ficheiro para:

source: %1, unknown archive type
jp: %1, 書庫の種類が不明
pt: %1, tipo de arquivo desconhecido

source: Cannot cut a virtual URL collection to the clipboard!
pt: Impossível de cortar uma colecção virtual URL para a área de transferência!

source: Cannot copy a virtual URL collection onto the clipboard!
pt: Não é possível copiar uma colecção virtual de URL para a área de transferência!

source: Locate
pt: Localizar

source: Stop
pt: Parar

source: Update DB
pt: Actualizar BD

source: Krusader::Locate
pt: Krusader::Localizar

source: Search for:
jp: 検索する語句:
pt: Procurar por:

source: Don't search in path
pt: Não procurar na localização

source: Show only the existing files
pt: Mostrar apenas os ficheiros existentes

source: Case Sensitive
pt: Distinguir Maiúsculas

source: Results
jp: 結果
pt: Resultados

source: Can't start 'locate'! Check the 'Dependencies' page in konfigurator.
pt: Não consigo executar o 'localizar'! Verifica a página das Dependências no konfigurador.

source: Error during the start of 'locate' process!
pt: Erro durante o início do processo de localização!

source: Locate produced the following error message:
pt: Localizar produziu a seguinte mensagem de erro:

source: Feed to listbox
pt: Feed para a listbox

source: View (F3)
pt: Ver (F3)

source: Edit (F4)
pt: Editar (F4)

source: Find (Ctrl+F)
pt: Procurar (Ctrl F)

source: Find next (Ctrl+N)
pt: Procurar seguinte (Ctrl+N)

source: Find previous (Ctrl+P)
pt: Procurar anterior (Ctrl+P)

source: Copy selected to clipboard
pt: Copiar seleccionados para a Área de Transferência

source: Search string not found!
pt: A sequência procurada não foi encontrada!

source: Locate results
pt: Resultados da localização

source: Query name
pt: Nome da pergunta

source: Here you can name the file collection
pt: Aqui você pode nomear a colecção de ficheiros

source: Statusbar will show basic information about file below mouse pointer.
pt: A barra de estado irá mostrar informações básicas sobre o ficheiro que se encontra sob o ponteiro do rato.

source: A configuration of 1.51 or older was detected. Krusader has to reset your configuration to default values. Note: Your bookmarks and keybindings will remain intact. Krusader will now run Konfigurator.
pt: Uma configuração do 1.51 ou mais antiga foi detectada. O Krusader tem que reiniciar a tua configuração para os valores padrão. O Krusader vai agora iniciar o Konfigurador.

source: <qt><b>Welcome to Krusader!</b><p>As this is your first run, your machine will now be checked for external applications. Then the Konfigurator will be launched where you can customize Krusader to your needs.</p></qt>
pt: <qt><b>Bemvindo ao Krusader!</b><p>Como é a primeira vez que está a usar este programa, a sua máquina vai ser pesquisada por aplicações externas. Depois o Konfigurador irá ser executado onde você pode personalizar o Krusader conforme as suas necessidades.</p></qt>

source: &Reload
pt: &Recarregar

source: Show Actions Toolbar
pt: Mostrar Acções da Barra de Ferramentas

source: Show &FN Keys Bar
jp: ファンクションバーを表示(&F)
pt: Mostrar &FN Barra de Teclas

source: Show &Command Line
jp: コマンドラインを表示(&C)
pt: Mostrar Linha de &Comando

source: Show Terminal &Emulator
pt: Mostrar &Emulador de Terminal

source: Show &Hidden Files
pt: Mostrar os Fic&heiros Escondidos

source: S&wap Panels
pt: Paineis S&wap

source: Sw&ap Sides
pt: Troc&ar Lados

source: popup cmdline
pt: linha de comandos popup

source: &New Text File...
pt: &Novo Ficheiro de Texto...

source: Start &Root Mode Krusader
pt: Iniciar K&rusader Modo de SuperUtilizador

source: F3 View Dialog
pt: F3 Ver Diálogo

source: T&est Archive
pt: T&estar Arquivo

source: New Net &Connection...
pt: Nova &Conexão Net...

source: Pro&files
pt: Per&fis

source: Calculate &Occupied Space
jp: 容量を計算(&O)
pt: Calcular Espaço &Ocupado

source: Create Checksum...
pt: Criar Cheksum...

source: Verify Checksum...
pt: Verificar Checksum...

source: &Properties...
pt: &Propriedades...

source: Pac&k...
pt: Empacotar(&k)...

source: &Unpack...
pt: Extrair(&U)...

source: Sp&lit File...
pt: Separar Ficheiro(&l)...

source: Com&bine Files...
pt: Com&binar Ficheiros...

source: Select &Group...
pt: Seleccionar &Grupo...

source: &Select All
jp: 全て選択(&S)
pt: &Seleccionar Tudo

source: &Unselect Group...
pt: Deseleccionar Gr&upo...

source: U&nselect All
jp: 全ての選択を解除(&n)
pt: Deseleccio&nar Todos

source: &Invert Selection
jp: 選択を反転(&I)
pt: &Inverter a Selecção

source: &Compare Directories
pt: &Comparar Directórios

source: &Select Newer and Single
pt: &Seleccionar Novos e Únicos

source: Select &Newer
pt: Seleccionar &Novos

source: Select &Single
pt: Seleccionar Único&s

source: Select Different &and Single
pt: Seleccionar Diferentes &E Únicos

source: Select &Different
pt: Seleccionar &Diferentes

source: Start and &Forget
pt: Começar e Esquecer (&F)

source: Display &Separated Standard and Error Output
pt: Mostrar Saída Erro Separada e Padrão

source: Display &Mixed Standard and Error Output
pt: Mostrar Saída Erro &Misturada e Padrão

source: Start in &New Terminal
pt: Iniciar num Novo &Terminal

source: Send to &Embedded Terminal Emulator
pt: Enviar para Emulador de Terminal &Embebido

source: Start &Terminal
pt: Iniciar &Terminal

source: Disconnect &from Net
pt: Desligar Da Net(&f)

source: &Search...
pt: Procurar(&S...)

source: &Locate...
pt: &Localizar...

source: Synchronize &Directories...
pt: Sincronizar &Directórios...

source: S&ynchron Directory Changes
pt: Sincronizar Alterações de Directórios (&y)

source: D&isk Usage...
pt: Utilização do D&isco...

source: Configure &Krusader...
pt: Configurar &Krusader...

source: Back
pt: Voltar

source: Save &Position
jp: 位置を保存(&p)
pt: Gravar &Posição

source: &All Files
jp: 全てのファイル(&A)
pt: &Todos os Ficheiros

source: &Custom
jp: カスタム(&C)
pt: &Personalizada

source: Compare b&y Content...
pt: Comparar por Conteúdo...(&y)

source: Multi &Rename...
pt: Multi &Renomear...

source: Right-click Menu
pt: Menu Click-direito

source: Right Bookmarks
pt: Favoritos da Direita

source: Left Bookmarks
pt: Favoritos da Esquerda

source: Bookmarks
pt: Favoritos

source: Bookmark Current
pt: Favorito Actual

source: History
pt: Histórico

source: Sync Panels
pt: Sincronizar Paineis

source: Left History
pt: Histórico da Esquerda

source: Right History
pt: Histórico da Direita

source: Media
pt: Média

source: Left Media
pt: Média Esquerda

source: Right Media
pt: Média Direita

source: Toggle Popup Panel
pt: Mudar de Painel de Popups

source: Vertical Mode
pt: Modo Vertical

source: New Tab
pt: Novo Separador

source: Duplicate Current Tab
pt: Duplicar Separador Actual

source: Close Current Tab
pt: Fechar Separador Actual

source: Next Tab
pt: Próximo Separador

source: Previous Tab
pt: Separador Anterior

source: User Menu
pt: Menu Utilizador

source: User&actions
pt: Acçõesutiliz&ador

source: Manage User Actions...
pt: Gerir Acções Utilizador...

source: Select Remote Charset
pt: Seleccionar Mapa de Caracteres Remoto

source: Start Terminal Here
pt: Iniciar Terminal Aqui

source: View File
pt: Ver Ficheiro

source: Edit File
pt: Editar Ficheiro

source: New Directory...
pt: Novo Directório...

source: Quit
pt: Sair

source: Popular URLs...
pt: URLs Populares...

source: Go to Location Bar
pt: Ir para a Barra de Localização

source: Jump Back
pt: Ir para Trás

source: Set Jump Back Point
pt: Pôr Ponto de Salto Atrás

source: Toggle Fullwidget Terminal Emulator
pt: Mostrar Emulador de Terminal Fullwidget

source: Select files using a filter
pt: Seleccionar ficheiros usando um filtro

source: Select all files in the current directory
pt: Seleccionar todos os ficheiros no directório actual

source: Unselect all selected files
pt: Deseleccionar todos os ficheiros seleccionados

source: Setup Krusader the way you like it
jp: 好きな方法でKrusaderをセットアップ
pt: Configure o Krusader da maneira que mais gostar

source: Back to the place you came from
jp: 元の場所に戻る
pt: Voltar ao sítio de onde veio

source: ROOT (/)
pt: RAIZ (/)

source: Search for files
jp: ファイルを検索
pt: Procurar por ficheiros

source: JavaScript Console...
pt: Consola JavaScript...

source: Are you sure you want to quit?
pt: Tem a certeza que quer sair?

source: No file selected or selected file can't be displayed.
pt: Nenhum ficheiro seleccionado ou o ficheiro seleccionado não pode ser mostrado.

source: KrViewer is unable to download:
jp: KrViewerは以下をダウンロードできません:
pt: KrVisualizador é incapaz de fazer a transferência:

source: &Generic viewer
jp: 一般ビューア(&G)
pt: Visualizador &Genérico

source: &Text viewer
jp: テキストビューア(&T)
pt: Visualizador &Texto

source: &Hex viewer
jp: Hexビューア(&H)
pt: Visualizador &Hexadecimal

source: Text &editor
jp: テキストエディタ(&e)
pt: &Editor de Texto

source: &Next tab
pt: Próximo separador(&n)

source: &Previous tab
pt: Se&Parador anterior

source: &Detach tab
pt: &Destacar separador

source: &Close current tab
pt: En&Cerrar separador actual

source: &Quit
pt: Sair(&Q)

source: &KrViewer
pt: &KrVisualizador

source: Viewing
pt: Vendo

source: Can't open
jp: 開けません
pt: Impossível abrir

source: Editing
pt: Edição

source: Sorry, can't find internal editor
jp: 内部エディタがありません
pt: Desculpe, não consigo encontrar o terminal interno

source: Location
jp: 場所
pt: Localização

source: Permissions
jp: 権限
pt: Permissões

source: Krusader::Search
jp: Krusader:検索
pt: Krusader::Procurar

source: Search
jp: 検索
pt: Procurar

source: Found 0 matches.
jp: 一致するものがありません
pt: Encontrei 0 ocorrências.

source: Text found:
pt: Texto encontrado:

source: &Results
pt: &Resultados

source: Found %1 matches.
pt: Encontrei %1 ocorrências.

source: Since you chose to also search in archives, note the following limitations: You cannot search for text (grep) while doing a search that includes archives.
pt: Já que também escolheu procurar em arquivos, repare nas seguintes limitações: Não pode procurar por texto (grep) enquanto faz uma procura que inclui arquivos.

source: Finished searching.
jp: 検索終了
pt: Procura terminada.

source: Krusader Search
pt: Procura Krusader

source: View File (F3)
pt: Ver Ficheiro (F3)

source: Edit File (F4)
pt: Editar Ficheiro (F4)

source: Search results
pt: Resultados da procura

source: Open a new tab in home
pt: Abrir novo separador em Casa

source: Close current tab
pt: Fechar separador actual

source: Unable to write to %1
pt: Incapaz de escrever para %1

source: instead of
pt: em vez de

source: missing tag
pt: tag em falta

source: %1 doesn't seem to be a valid Bookmarks file
pt: %1 não parece ser um ficheiro de Favoritos válido

source: Error reading bookmarks file: %1
pt: Erro ao ler o ficheiro de favoritos: %1

source: Popular URLs
pt: URLs Populares

source: Manage Bookmarks
pt: Gerir Favoritos

source: Enable special bookmarks
pt: Activar Favoritos especiais

source: Devices
pt: Dispositivos

source: Local Network
pt: Rede Local

source: Virtual Filesystem
pt: Sistema de Ficheiros Virtual

source: Jump back
pt: Ir para atrás

source: Add Bookmark
jp: ブックマークを追加
pt: Adicionar Favorito

source: New Folder
pt: Novo Directório

source: Name:
jp: 名前:
pt: Nome:

source: Create in:
pt: Criar em:

source: Folder name:
pt: Nome da pasta:

source: MountMan is not operational. Sorry
pt: MountMan não está operacional. Desculpe

source: &Close
pt: En&Cerrar

source: MountMan - Your Mount-Manager
jp: MountMan - マウントマネージャ
pt: MountMan - O seu Gestor-Mount

source: Mnt.Point
jp: マウントポイント
pt: Ponto de Montagem

source: Total Size
jp: 全体のサイズ
pt: Tamanho Total

source: Free Size
jp: 空き容量
pt: Tamanho Livre

source: Free %
jp: 空き %
pt: Livre %

source: Critical Error
pt: Erro Crítico

source: Internal error in MountMan Please email the developers
pt: Erro interno no MountMan Por favor envie um email aos criadores

source: Internal error in MountMan Call the developers
pt: Erro interno no MountMan Contacte os criadores

source: MountMan has an internal error. Please notify the developers. Thank you.
jp: MountManが内部エラーを起こしました。開発者に連絡してください
pt: MountMan tem um erro interno. Por favor contacte os criadores. Obrigado.

source: Format
jp: 形式
pt: Formato

source: Krusader - ROOT PRIVILEGES
pt: Krusader - PRIVILÉGIOS DE SUPERUTILIZADOR

source: Start left panel at <path>
pt: Iniciar painel da esquerda em <path>

source: Start right panel at <path>
pt: Iniciar painel da direita em<path>

source: Load this profile on startup
pt: Carrega este perfil ao iniciar

source: Application already running!
pt: Aplicação já está a ser executada!

source: Function keys allow performing fast operations on files.
pt: As teclas de função permitem operações rápidas em ficheiros.

source: Preserve attributes (only for local targets)
pt: Preservar atributos (somente para alvos locais)

source: Keep virtual directory structure
pt: Manter a estrutura do directório virtual

source: Source:
jp: 元:
pt: Origem:

source: Destination:
jp: 対象:
pt: Destino:

source: Krusader Progress
jp: Krusaderの進行
pt: Progresso do Krusader

source: %1 directory
pt: %1 directório

source: %1 file
pt: %1 ficheiro

source: (Reading)
jp: (読み込み)
pt: (Lendo)

source: %1 of %2 complete
jp: %1 / %2 完了
pt: %1 de %2 completos

source: %2 / %1 directory
pt: %2 / %1 directório

source: %2 / %1 file
pt: %2 / %1 ficheiro

source: Working
pt: A trabalhar

source: %1/s ( %2 remaining )
jp: %1/s(残り %2)
pt: %1/s ( falta %2 )

source: Pack %1
pt: Compactar %1

source: Pack %1 file
pt: Compactar %1 ficheiro

source: Please select a directory
jp: ディレクトリを選んでください
pt: Por favor escolha um directório

source: Choose Files
jp: ファイルを選択
pt: Escolha os Ficheiros

source: Select the following files:
jp: 以下のファイルを選択:
pt: Seleccionar os seguintes ficheiros:

source: Predefined Selections
jp: 定義済みの選択
pt: Selecções Predefinidas

source: A predefined selection is a file-mask which you use often. Some examples are: "*.c, *.h", "*.c, *.o", etc. You can add these masks to the list by typing them and pressing the Add button. Delete removes a predefined selection and Clear removes all of them. Notice that the line in which you edit the mask has it's own history, you can scroll it, if needed.
pt: Uma selecção predefenida é uma máscara de ficheiros que pode usar muitas vezes. Alguns exemplos são: "*.c, *.h", "*.o", etc. Você pode adicionar estas máscaras à lista escrevendo-as e pressionando o botão Adicionar. Apagar remove uma selecção predefenida e Limpar remove todas. Note que a linha onde edita a máscara tem o seu próprio historial, você pode vê-lo se precisar.

source: Add
pt: Adicionar

source: Adds the selection in the line-edit to the list
pt: Adiciona a selecção na edição de linha à lista

source: Delete the marked selection from the list
jp: 選択したものをリストから削除
pt: Apaga a selecção marcada da lista

source: Clear
pt: Limpar

source: Clears the entire list of selections
jp: 選択したリストをクリア
pt: Limpa toda a lista de selecções

source: New Network Connection
pt: Nova Ligação de Rede

source: About to connect to...
jp: 接続先..
pt: Prestes a ligar a...

source: Protocol:
pt: Protocolo:

source: Host:
jp: ホスト:
pt: Máquina:

source: Port:
jp: ポート:
pt: Porta:

source: Username:
jp: ユーザ名:
pt: Nome de utilizador:

source: Password:
jp: パスワード:
pt: Palavra passe:

source: &Connect
jp: 接続(&C)
pt: &Conectar

source: &Cancel
pt: &Cancelar

source: Saved 'Popular Urls' are invalid. List will be cleared
pt: Os 'Urls Populares' gravados são inválidos. A lista será limpa

source: Popular Urls
pt: Urls Populares

source: &Search:
pt: Procurar(&S):

source: Capacity:
pt: Capacidade:

source: Used:
pt: Utilizado:

source: Free:
jp: 空き:
pt: Livre:

source: Not mounted.
jp: マウントされませんでした
pt: Não montado.

source: *.keymap|Krusader keymaps *|all files
pt: *.keymap|Krusader mapas de caracteres *|todos os ficheiros

source: Import shortcuts
pt: Importar atalhos

source: Load a keybinding profile, e.g., total_commander.keymap
pt: Carregar um perfil de configuração chave, ex., total_commander.keymap

source: Export shortcuts
pt: Exportar atalhos

source: Save current keybindings in a keymap file.
pt: Gravar configurações chave actuais num ficheiro de mapa de caracteres.

source: Select a keymap file
pt: Seleccione um ficheiro de mapa de caracteres

source: This file does not seem to be a valid keymap. It may be a keymap using a legacy format. The import can't be undone!
pt: Este ficheiro não parece ser um mapa de caracteres válido. Pode ser uma mapa de caracteres a utilizar um formato legacy. A importação não pode ser desfeita!

source: Try to import legacy format?
pt: Tentar importar formato legacy?

source: Import anyway
pt: Importar à mesma

source: The following information was attached to the keymap. Do you really want to import this keymap?
pt: A seguinte informação foi copiada para o mapa de caracteres.Tem a certeza que deseja importar este mapa de caracteres ?

source: Please restart this dialog in order to see the changes
pt: Por favor reinicie esta janela de diágolo para poder ver as alterações
