Repository: CodeCollect/krusader
Catalog: po/*.po
Languages: jp, pt

source: Legacy import completed
pt: Importação legacy completa

source: <qt>File <b>%1</b> already exists. Do you really want to overwrite it?</qt>
pt: <qt>O ficheiro <b>%1</b> já existe.Tem a certeza que quer substituí-lo?</qt>

source: <qt>Can't open <b>%1</b> for writing!</qt>
pt: <qt>Não consigo abrir <b>%1</b> para escrita!</qt>

source: Pack
jp: 圧縮
pt: Compactar

source: To archive
jp: 書庫名
pt: Para o arquivo

source: In directory
jp: ディレクトリ
pt: No directório

source: Multiple volume archive
pt: Volume múltiplo de arquivos

source: Size:
pt: Tamanho:

source: Set compression level
pt: Defina nível de compressão

source: Password
pt: Palavra Passe

source: Again
pt: Outra vez

source: Encrypt headers
pt: Encriptar cabeçalhos

source: Command line switches:
pt: Opções linha de comandos:

source: No password specified
pt: Nenhuma palavra passe especificada

source: The passwords are equal
pt: As palavras passe são iguais

source: The passwords are different
pt: As palavras passe são diferentes

source: Cannot pack! The passwords are different!
pt: Impossível compactar! As palavras passe são diferentes!

source: Invalid volume size!
pt: Tamanho de volume inválido!

source: Invalid command line switch! Switch must start with '-'!
pt: Opção de linha de comando inválido! A opção tem que começar com '-'!

source: Invalid command line switch! Backslash cannot be the last character
pt: Opção de linha de comando inválido! A barra não pode ser o último caracter

source: Invalid command line switch! Unclosed quotation mark!
pt: Opção de linha de comando inválida! Aspas não fechadas!

source: Enter a selection:
jp: 選択を入力:
pt: Introduza uma selecção:

source: Quick Navigation
pt: Navegação Rápida

source: Already at <i>%1</i>
pt: Já em <i>%1</i>

source: Click to go to <i>%1</i>
pt: Click para ir para <i>%1</i>

source: Krusader::Wait
pt: Krusader::Esperar

source: Create Checksum
pt: Criar Cheksum

source: <qt>Can't calculate checksum since no supported tool was found. Please check the <b>Dependencies</b> page in Krusader's settings.</qt>
pt: <qt>Não posso calcular o checksum já que nenhuma ferramenta suportada foi encontrada. Por favor verifique a página <b>Dependências</b> nas configurações do Krusader.</qt>

source: <qt><b>Note</b>: you've selected directories, and probably have no recursive checksum tool installed. Krusader currently supports <i>md5deep, sha1deep, sha256deep, tigerdeep and cfv</i></qt>
pt: <qt><b>Nota</b>: seleccionou directórios, e provavelmente não tem nenhuma ferramenta de checksum recursiva instalada. Krusader actualmente suporta <i>md5deep, sha1deep, sha256deep, tigerdeep e cfv</i></qt>

source: About to calculate checksum for the following files
pt: Prestes a calcular o checksum para os seguintes ficheiros

source: and folders:
pt: e pastas:

source: Select the checksum method:
pt: Seleccione o metodo de checksum:

source: Calculating checksums ...
pt: Calculando checksums ...

source: <qt>There was an error while running <b>%1</b>.</qt>
pt: <qt>Houve um erro ao executar <b>%1</b>.</qt>

source: Error reading stdout or stderr
pt: Erro ao ler o stdout ou stderr

source: Verify Checksum
pt: Verificar Checksum

source: <qt>Can't verify checksum since no supported tool was found. Please check the <b>Dependencies</b> page in Krusader's settings.</qt>
pt: <qt>Impossível verificar o checksum já que nenhuma ferramenta suportada foi encontrada. Por favor verifique a página <b>Dependências</b> nas configurações do Krusader.</qt>

source: About to verify checksum for the following files
pt: Prestes a verificar o cheksum para os seguintes ficheiros

source: Checksum file:
pt: Ficheiro de Checksum:

source: <qt>Error reading checksum file <i>%1</i>.<br />Please specify a valid checksum file.</qt>
pt: <qt>Erro ao ler ficheiro de checksum <i>%1</i>.<br>Por favor especifique um ficheiro de checksum válido.</qt>

source: <qt>Krusader can't find a checksum tool that handles %1 on your system. Please check the <b>Dependencies</b> page in Krusader's settings.</qt>
pt: <qt>O Krusader não consegue encontrar uma ferramenta de checksum que trabalhe com %1 no seu sistema. Por favor verifique a página <b>Dependências</b> nas configurações do Krusader.</qt>

source: Verifying checksums ...
pt: Verificando checksums ...

source: Errors were detected while verifying the checksums
pt: Foram detectados erros ao verificar os checksums

source: Checksums were verified successfully
pt: Checksums foram verificados com sucesso

source: The following files have failed:
pt: Os seguintes ficheiros falharam:

source: Errors were detected while creating the checksums
pt: Erros detectados quando criando os checksums

source: Checksums were created successfully
pt: Checksums criados com sucesso

source: Here are the calculated checksums:
pt: Aqui estão os checksums calculados:

source: File
pt: Ficheiro

source: File and hash
pt: Ficheiro e hash

source: Here are the errors received:
pt: Aqui estão os erros recebidos:

source: Save checksum to file:
pt: Gravar checksum para o ficheiro:

source: Checksum file for each source file
pt: Ficheiro de Checksum para cada ficheiro de origem

source: File %1 already exists. Are you sure you want to overwrite it?
pt: O ficheiro %1 já existe. Tem a certeza que quer substituí-lo?

source: Select a file to save to
pt: Seleccione um ficheiro para onde gravar

source: Error saving file %1
pt: Erro ao gravar o ficheiro%1

source: Saving checksum files...
pt: Gravando ficheiros de cheksum...

source: Errors occured while saving multiple checksums. Stopping
pt: Ocorreram erros ao gravar vários chescksums. Parando

source: Action Property
pt: Propriedade da acção

source: A detailed description of the <b>Useraction</b>. It is only displayed in the <i>Konfigurator</i> and via <code>Shift-F1</code>.
pt: Uma descrição detalhada sobre <b>Acçãoutilizador</b>. só é mostrada no<i>Konfigurador</i> e via <code>Shift-F1</code>.

source: Description:
jp: 説明:
pt: Descrição:

source: Command accepts
pt: Comandos aceites

source: Substitute the <b>Placeholders</b> with local filenames.
pt: Substituta os <b>Placeholders</b> com nomes de ficheiros locais.

source: Local files only (no URL's)
pt: Só ficheiros locais(URL s não)

source: Substitute the <b>Placeholders</b> with valid URL's.
pt: Substitua os <b>marcadores</b> por URL s válidos

source: URL's (remote and local)
pt: URL s(remotos e locais)

source: The title displayed in the <b>Usermenu</b>.
pt: O título mostrado no <b>Menutilizador</b>.

source: Title:
pt: Título:

source: Unique name of the <b>Useraction</b>. It is only used in the <i>Konfigurator</i> and doesn't appear in any other menu.<p><b>Note</b>: The <i>Title</i> shown in the <b>Usermenu</b> can be set below.
pt: Nome único da <b>Acçãoutilizador</b>. Só é utilizada no <i>Konfigurador</i> e não aparece noutro menu.<p><b>Nota</b>: O <i>Título</i> mostrado no <b>Menutilizador</b> não pode ser configurado abaixo.

source: <b>Useractions</b> can be grouped in categories for better distinction. Choose a existing <i>Category</i> or create a new one by entering a name.
pt: <b>Acçõesutilizador</b> podem ser agrupadas em categorias para uma malhor diferenciação. Escolha uma <i>Categoria</i>existente, ou crie uma nova introduzindo um nome.

source: Each <b>Useraction</b> can have its own icon. It will appear in front of the title in the <b>Usermenu</b>.
pt: Cada <b>Acçãoutilizador</b> pode ter o seu icone. Aparecerá à frente do título no <b>Menutilizador</b>.

source: Icon
pt: ícone

source: <p>Unique name of the <b>Useraction</b>. It is only used in the <i>Konfigurator</i> and doesn't appear in any other menu.</p><p><b>Note</b>: The <i>Title</i> shown in the <b>Usermenu</b> can be set below.</p>
pt: <p>Nome único da <b>Acçãoutilizador</b>. Só é usada no <i>Konfigurador</i> e não aparece noutro menu.</p><p><b>Nota</b>: O <i>Título</i> mostrado no <b>Menutilizador</b> não pode ser configurado abaixo.</p>

source: Identifier:
pt: Identificador:

source: <p>The <i>Command</i> defines the command that will be executed when the <b>Useraction</b> is used. It can be a simple shell command or a complex sequence of multiple commands with <b>Placeholders</b>.</p><p>Examples:<ul><code><li>eject /mnt/cdrom</li><li>amarok --append %aList("Selected")%</li></code></ul> Please consult the handbook to learn more about the syntax.</p>
pt: <'>O <i>Comando</i> define o comando que será executado quando a <b>Acçãoutilizador</b> é usada. Pode ser um simples comando de shell ou uma sequência complexa de vários comandos com <b>Placeholders</b>.</p><p> Exemplos:<ul><code><li>eject /mnt/cdrom</li><li>amarok --append %aList("Selected")%</li></code></ul> Por favor consulte o handbook para aprender mais sobre a sintaxe.</p>

source: Command:
pt: Comando:

source: The <i>Tooltip</i> is shown when the mouse cursor is hold over an entry of the <b>Useraction Toolbar</b>.
pt: O <i>Tooltip</i> é mostrado quando o cursor do rato é posto sobre uma entrada no <b>Barra de Ferramentas Acçãoutilizador</b>.

source: The <i>Workdir</i> defines in which directory the <i>Command</i> will be executed.
pt: O <i>DirTrabalho</i> define em qual directório o <i>Comando</i> será executado.

source: The <i>Command</i> defines the command that will be executed when the <b>Useraction</b> is used. It can be a simple shell command or a complex sequence of multiple commands with <b>Placeholders</b>.<p> Examples:<ul><code><li>eject /mnt/cdrom</li><li>amarok --append %aList("Selected")%</li></code></ul> Please consult the handbook to learn more about the syntax.
pt: O <i>Comando</i> define o comando que será executado quando a <b>Acçãoutilizador</b> é usada. Pode ser um simples comando de shell ou uma sequência complexa de vários comandos com <b>Placeholders</b>.<p> Exemplos:<ul><code><li>eject /mnt/cdrom</li><li>amarok --append %aList("Selected")%</li></code></ul> Por favor consulte o handbook para aprender mais sobre a syntax.

source: Category:
pt: Categoria:

source: Workdir:
pt: DirTrabalho:

source: Default shortcut:
pt: Atalho padrão:

source: Set a default keyboard shortcut.
pt: Escolha um atalho de teclado padrão.

source: None
pt: Nenhum

source: Collect the output of the executed program.
pt: Recolher saída do programa executado.

source: Collect output
pt: Recolher saída

source: Separate standard out and standard error in the output collection.
pt: Separar saída padrão e erro padrão no colecção de saída.

source: Separate standard error
pt: Separar erro padrão

source: Run the command in a terminal.
pt: Executar o comando num terminal.

source: Run in terminal
pt: Correr num terminal

source: Basic Properties
pt: Propriedades Básicas

source: The Useraction is only available for
pt: A Acçãoutilizador só está disponível para

source: &New...
pt: &Novo...

source: Chan&ge...
pt: Mudar(&g)...

source: De&lete
pt: E&liminar

source: Show the <b>Useraction</b> only for the values defined here.
pt: Mostrar a <b>Acçãoutilizador</b> apenas para os valores definidos aqui.

source: Protocol
pt: Protocolo

source: Path
pt: Localização

source: Mime-type
pt: Tipo-Mime

source: Show the <b>Useraction</b> only for the filenames defined here. The wildcards '<code>?</code>' and '<code>*</code>' can be used.
pt: Mostrar a <b>Acçãoutilizador</b> apenas para os nomes de ficheiros definidos aqui. Caracteres especiais '<code>?</code>' e '<code>*</code>' podem ser utilizados.

source: Filename
pt: Nome de ficheiro

source: Allows to tweak the <i>Command</i> before it is executed.
pt: Isto permite que você altere o <i>Comando</i> antes de ele ser executado.

source: Confirm each program call separately
pt: Confirmar cada chamada do programa separadamente

source: Execute the <i>Command</i> under a different user-id.
pt: Executar o <i>Comando</i> usando um id-utilizador diferente.

source: Run as different user:
pt: Correr como um utilizador diferente:

source: Advanced Properties
pt: Propriedades Avançadas

source: Title
pt: Título

source: *.xml|xml-files *|all files
pt: *.xml|xml-ficheiros *|todos os ficheiros

source: Create new useraction
pt: Criar nova acçãoutilizador

source: Import useractions
pt: Importar acçõesutilizador

source: Export useractions
pt: Exportar acçõesutilizador

source: Copy useractions to clipboard
pt: Copiar acçõesutilizador para a área de transferência

source: Paste useractions from clipboard
pt: Colar acçõesutilizador da Área de Transferência

source: Delete selected useractions
pt: Remover acçõesutilizador seleccionadas

source: The current action has been modified. Do you want to apply these changes?
pt: A acção actual foi modificada. Quer aplicar estas alterações?

source: Are you sure that you want to remove all selected actions?
pt: Tem a certeza que quer remover todas as acções seleccionadas?

source: Remove selected actions?
pt: Remover acções seleccionadas?

source: This file already contains some useractions. Do you want to overwrite it or should it be merged with the selected actions?
pt: Este ficheiro já contem algumas acções de utilizador. Você quer substituí-lo ou deverá ser adicionado com as acções seleccionadas?

source: Overwrite or merge?
pt: Substituir ou adicionar?

source: Merge
pt: Adicionar

source: This file already exists. Do you want to overwrite it?
pt: Este ficheiro já existe.Você quer substituí-lo?

source: Overwrite existing file?
pt: Substituir ficheiro existente?

source: New protocol
pt: Novo protocolo

source: Set a protocol:
pt: Configure um protocolo:

source: Edit protocol
pt: Editar protocolo

source: Set another protocol:
pt: Configure outro protocolo:

source: Edit path
pt: Editar localização

source: Set another path:
pt: Introduza outra localização:

source: New mime-type
pt: Novo tipo-mime

source: Set a mime-type:
pt: Configurar um tipo-mime:

source: Edit mime-type
pt: Editar tipo-mime

source: Set another mime-type:
pt: Configure outro tipo-mime:

source: New filename
pt: Novo nome de ficheiro

source: Set a filename:
pt: Insira um nome de ficheiro:

source: Edit filename
pt: Editar nome de ficheiro

source: Set another filename:
pt: Inserir outro nome de ficheiro:

source: Please set a unique name for the useraction
pt: Por favor insira um nome unico para a acçãoutilizador

source: Please set a title for the menu entry
pt: Insira um título para a entrada do menu

source: Command line is empty
pt: A linha de comandos está vazia

source: There already is an action with this name If you don't have such an useraction the name is used by Krusader for an internal action
pt: Já existe uma acção com esse nome Se você não tem uma acçãoutilizador com esse nome então o Krusader está a utilizá-lo para uma acção interna

source: ActionMan - Manage Your Useractions
pt: ActionMan - Gerir as Suas Acçõesutilizador

source: Active panel
pt: Painel activo

source: Other panel
pt: Outro painel

source: Left panel
pt: Painel esquerdo

source: Right panel
pt: Painel direito

source: Panel independent
pt: Painel independente

source: Choose executable...
pt: Escolha executável...

source: User Action Parameter Dialog
pt: Diálogo dos Parâmetros das Accções Utilizador

source: This placeholder allows some parameter:
pt: Este placeholder permite alguns parâmetros:

source: Manage user actions
pt: Gerir acções do utilizador

source: Krusader::Synchronize Directories
pt: Krusader::Sincronizar Directórios

source: Directory Comparison
pt: Comparação de Directórios

source: File &Filter:
pt: Filtro de &Ficheiros:

source: The left base directory used during the synchronisation process.
pt: O directório base esquerdo utilizado durante o processo de sincronização.

source: The right base directory used during the synchronisation process.
pt: O directório base direito utilizado durante o processo de sincronização.

source: Recurse subdirectories
pt: Subdirectórios recursivos

source: Compare not only the base directories but their subdirectories as well.
pt: Compara não só os directórios base mas também os seus subdirectórios.

source: Follow symlinks
pt: Seguir ligações simbólicas

source: Follow symbolic links during the compare process.
pt: Segue as ligações simbólicas durante o processo de comparação.

source: Compare by content
pt: Comparar por conteúdo

source: Compare duplicated files with same size by content.
pt: Compara os ficheiros duplicados com o mesmo tamanho, pelo seu conteúdo.

source: Ignore Date
pt: Ignorar Data

source: <p>Ignore date information during the compare process.</p><p><b>Note</b>: useful if the files are located on network filesystems or in archives.</p>
pt: <p>Ignorar informação da data durante o processo de comparação.</p><p><b>Nota</b>: útil se os ficheiros são localizados num sistema de ficheiros de rede ou em arquivos.</p>

source: Asymmetric
pt: Assimétrico

source: <p><b>Asymmetric mode</b></p><p>The left side is the destination, the right is the source directory. Files existing only in the left directory will be deleted, the other differing ones will be copied from right to left.</p><p><b>Note</b>: useful when updating a directory from a file server.</p>
pt: <p><b>Modo assimétrico</b></p><p> O lado esquerdo é o destino, o direito é o directório de destino.Os ficheiros existentes apenas no directório esquerdo serão apagados, os outros serão copiados da direita para a esquerda.</p><p><b>Nota</b>:útil quando se actualiza um directório de um servidor de ficheiros.</p>

source: Ignore Case
pt: Ignorar Capitalização

source: <p>Case insensitive filename compare.</p><p><b>Note</b>: useful when synchronizing Windows filesystems.</p>
pt: <p>Comparação de nomes de ficheiros sem capitalização.</p><p><b>Nota</b>: útil na sincronização em sistemas de ficheiros Windows.</p>

source: S&how options
pt: Mostrar opções (&h)

source: Show files marked to <i>Copy from left to right</i> (CTRL+L).
pt: Mostrar os ficheiros marcados para <i>Copiar da esquerda para a direita</i> (CTRL+L).

source: Show files considered to be identical (CTRL+E).
pt: Mostra os ficheiros considerados idênticos (CTRL+E).

source: Show excluded files (CTRL+D).
pt: Mostra os ficheiros excluídos (CTRL+D).

source: Show files marked to <i>Copy from right to left</i> (CTRL+R).
pt: Mostra os ficheiros marcados para <i>Copiar da direita para a esquerda</i> (CTRL+R).

source: Duplicates
pt: Duplicados

source: Show files that exist on both sides.
pt: Mostra os ficheiros que existem em ambos os lados.

source: Singles
pt: Únicos

source: Show files that exist on one side only.
pt: Mostra os ficheiros que existem num dos lados apenas.

source: The compare results of the synchronizer (CTRL+M).
pt: Os resultados da comparação do sincronizador (CTRL+M).

source: &Synchronizer
pt: &Sincronizador

source: &Options
pt: &Opções

source: Parallel threads:
pt: Threads paralelas:

source: Equality threshold:
pt: Threshold de igualdade:

source: sec
pt: seg

source: hour
pt: hora

source: day
pt: dia

source: Time shift (right-left):
pt: Deslocação tempo (direita-esquerda):

source: Ignore hidden files
pt: Ignorar ficheiros escondidos

source: Profile manager (Ctrl+P).
pt: Gestor de perfis (CTRL+P).

source: Swap sides (Ctrl+S).
pt: Trocar lados (CTRL+S).

source: Compare
pt: Comparar

source: Quiet
pt: Silencioso

source: Scroll Results
pt: Resultados do Scroll

source: Synchronize
pt: Sincronizar

source: Selected files from targ&et directory:
pt: Ficheiros escolhidos do directório d&estino:

source: Selected files from sou&rce directory:
pt: Ficheiros seleccionados do directório de o&rigem:

source: Selected files from &left directory:
pt: Ficheiros se&leccionados do directório da esquerda:

source: Selected files from &right directory:
pt: Ficheiros seleccionados do directório da di&reita:

source: Targ&et directory:
pt: Directório de d&estino:

source: Sou&rce directory:
pt: Directório de o&rigem:

source: &Left directory:
pt: Directório da esquerda (&l):

source: &Right directory:
pt: Directório da di&reita:

source: URL must be the descendant of either the left or the right base URL!
pt: URL tem que ser descendente ou do URL base da direita ou da esquerda!

source: Synchronize Directories
pt: Sincronizar Directórios

source: E&xclude
pt: E&xcluir

source: Restore ori&ginal operation
pt: Restaurar operação o&riginal

source: Re&verse direction
pt: Re&verter direcção

source: Copy from &right to left
pt: Copiar da di&reita para a esquerda

source: Copy from &left to right
pt: Copiar da esquerda para a direita (&l)

source: &Delete (left single)
pt: Apagar (único &da esquerda)

source: V&iew left file
pt: Ver f&icheiro da esquerda

source: Vi&ew right file
pt: Ver f&icheiro da direita

source: &Compare Files
pt: &Comparar Ficheiros

source: C&opy selected to clipboard (left)
pt: C&opiar seleccionados para a Área de Transferência (esquerda)

source: Co&py selected to clipboard (right)
pt: Co&piar seleccionados para a Área de Transferência (direita)

source: &Select items
pt: &Seleccionar items

source: Deselec&t items
pt: Deseleccionar i&tems

source: I&nvert selection
pt: I&nverter selecção

source: Synchronize with &KGet
pt: Sincronizar com o &KGet

source: Select items
pt: Seleccionar items

source: Deselect items
pt: Deseleccionar items

source: Synchronizer has nothing to do!
pt: O sincronizador não tem nada para fazer!

source: The synchronizer window contains data from a previous compare. If you exit, this data will be lost. Do you really want to exit?
pt: A janela do sincronizador contém informações de uma comparação anterior. Se sair, esta informação será perdida. Deseja mesmo sair?

source: Error at opening %1!
pt: Erro ao abrir %1!

source: IO error at comparing file %1 with %2!
pt: Erro ES ao comparar ficheiro %1 com %2!

source: Comparing file %1 (%2)...
pt: Comparando ficheiro %1 (%2)...

source: Krusader::Synchronize
pt: Krusader::Sincronizar

source: Right to left: Copy 1 file
pt: _n: Direita para a esquerda: Copiar 1 ficheiro

source: (1 byte)
pt: _n: (1 byte)

source: Left to right: Copy 1 file
pt: _n: Esquerda para a direita: Copiar 1 ficheiro

source: Left: Delete 1 file
pt: _n: Esquerda: Apagar 1 ficheiro

source: Confirm overwrites
pt: Confirmação de substituição

source: &Start
pt: Iniciar(&S)

source: &Pause
pt: &Pausa

source: Ready: %1/%2 files, %3/%4
pt: Pronto: %1/%2 ficheiros, %3/%4

source: Pause
pt: Pausa

source: Resume
pt: Continuar

source: Number of files: %1
pt: Número de ficheiros: %1

source: Number of compared directories: %1
pt: Número de directórios comparados: %1

source: Error at copying file %1 to %2!
pt: Erro ao copiar ficheiro %1 para %2!

source: Error at deleting file %1!
pt: Erro ao apagar ficheiro %1!

source: Krusader::Synchronizer
pt: Krusader::Sincronizador

source: Feeding the URLs to Kget
pt: Dando os URL-s ao Kget

source: Krusader::Feed to listbox
pt: Krusader::Feed para a listbox

source: No elements to feed!
pt: Nenhum elemento para dar!

source: Synchronize results
pt: Resultados da Sincronização

source: Side to feed:
pt: Mover para dar:

source: Left
pt: Esquerdo

source: Right
pt: Direito

source: Both
pt: Ambos

source: Selected files only
pt: Seleccionar apenas ficheiros

source: Cannot open %1!
pt: Impossível abrir %1!

source: Panel
pt: Painel

source: Open &Konqueror Here
pt: Abrir &Konqueror Aqui

source: Open &Konsole Here
pt: Abrir &Konsole Aqui

source: &Center Map Here
pt: &Centrar Mapa Aqui

source: &Open
pt: Abrir(&O)

source: <qt>The directory at <i>'%1'</i> will be <b>recursively</b> and <b>permanently</b> deleted!</qt>
pt: <qt>O directório em <i>'%1'</i> será <b>recursivamente</b> e <b>permanentemente</b> apagado!</qt>

source: <qt><i>'%1'</i> will be <b>permanently</b> deleted!</qt>
pt: <qt><i>'%1'</i> será <b>permanentemente</b> apagado!</qt>

source: %1 files: ~ %2
pt: %1 ficheiros: ~ %2

source: Files: %1
pt: Ficheiros: %1

source: Line View
pt: Vista de Linha

source: Percent
pt: Percentagem
