Repository: CodeCollect/krusader
Catalog: po/*.po
Languages: jp, pt

source: Open the directory history list
pt: Abrir a lista do histórico dos directórios

source: Ready.
jp: 準備完了
pt: Pronto.

source: Profiles
pt: Perfis

source: Remove entry
pt: Apagar entrada

source: Overwrite entry
pt: Substituir entrada

source: Add new entry
pt: Adicionar nova entrada

source: Krusader::ProfileManager
pt: Krusader::GestorPerfis

source: Enter the profile name:
pt: Introduza o nome do perfil:

source: Reload
pt: Actualizar

source: Default
pt: Padrão

source: Open the available media list
pt: Abrir a lista da média disponível

source: Remote Share
pt: Partilha Remota

source: Unknown
pt: Desconhecido

source: Floppy
pt: Disquete

source: Hard Disk
pt: Disco Rígido

source: Open
pt: Abrir

source: Open in a new tab
pt: Abrir num separador novo

source: Mount
jp: マウント
pt: Montar

source: Unmount
jp: アンマウント
pt: Desmontar

source: Eject
jp: イジェクト
pt: Ejectar

source: This button toggles the sync-browse mode. When active, each directory change is performed in the active and inactive panel - if possible.
pt: Este botão activa o modo sync-browse. Quando activo, cada mudança de directório é feita no painel activo e inactivo - se possível.

source: Execution mode
pt: Modo de execução

source: Name of directory where command will be processed.
pt: Nome do directório onde o comando irá ser executado.

source: <qt><p>Well, it's actually quite simple: You type your command here and Krusader obeys.</p><p><b>Tip</b>: Move within command line history with &lt;Up&gt; and &lt;Down&gt; arrows.</p></qt>
pt: <qt><p>Bem,é bastante simples: Você escreve o comando aqui, e o Krusader obedece.</p><p><b><Dica:></b>Percorra o histórico da linha de comandos com &lt;SETA CIMA&gt; e &lt;SETA BAIXO&gt;.</p></qt>

source: Add <b>Placeholders</b> for the selected files in the panel.
pt: Adicione <b>Marcadores</b> para os ficheiros seleccionados no painel.

source: <p>Open terminal in current directory.</p><p>The terminal can be defined in Konfigurator, default is <b>konsole</b>.</p>
pt: <p>Abrir terminal no directório actual.</p><p>Você pode definir o terminal no Konfigurador, por omissão é o <b>konsole</b>.</p>

source: F3 View
jp: F3 閲覧
pt: F3 Ver

source: Open file in viewer.
pt: Abrir ficheiro no visualizador.

source: F4 Edit
jp: F4 編集
pt: F4 Editar

source: <p>Edit file.</p><p>The editor can be defined in Konfigurator, default is <b>internal editor</b>.</p>
pt: <p>Editar ficheiro.</p><p>O editor é configurável no Konfigurador, por omissão é o <b>editor interno</b>.</qt>

source: F5 Copy
jp: F5 コピー
pt: F5 Copiar

source: Copy file from one panel to the other.
pt: Copiar ficheiro de um painel para o outro.

source: F6 Move
jp: F6 移動
pt: F6 Mover

source: Move file from one panel to the other.
pt: Mover ficheiro de um painel para o outro.

source: F7 Mkdir
jp: F7 Dir作成
pt: F7 CriarDir

source: Create directory in current panel.
pt: Criar directório no painel actual.

source: F8 Delete
jp: F8 削除
pt: F8 Apagar

source: Delete file, directory, etc.
pt: Apagar ficheiro, directório, etc.

source: F9 Rename
jp: F9リネーム
pt: F9 Renomear

source: Rename file, directory, etc.
pt: Renomear ficheiro, directório, etc.

source: F10 Quit
jp: F10 終了
pt: F10 Sair

source: Quit Krusader.
pt: Sair do Krusader.

source: View
pt: Ver

source: Edit
pt: Editar

source: Copy
pt: Copiar

source: Move
pt: Mover

source: Mkdir
pt: Criardir

source: Delete
pt: Apagar

source: Rename
pt: Renomear

source: Quit
pt: Sair

source: Malformed URL: %1
jp: 不正なURL: %1
pt: URL inválido: %1

source: Krusader doesn't support FTP access via HTTP. If it is not the case, please check and change the Proxy settings in kcontrol.
pt: O Krusader não suporta acesso FTP via HTTP. Se não é este o caso, por favor verifique e altere as definições de Proxy no kcontrol.

source: Protocol not supported by Krusader: %1
pt: Protocolo não suportado pelo Krusader: %1

source: Directory
pt: Directório

source: File Already Exists
pt: O Ficheiro Já Existe

source: Directory %1 does not exist!
pt: Directório %1 não existe!

source: Error
pt: Erro

source: Can't open the %1 directory!
pt: Impossível abrir o directório %1!

source: Access denied to
pt: Acesso negado a

source: Can't create a directory. Check your permissions.
pt: impossível criar o directório. Verifique as suas permissões.

source: You can't copy files directly to the 'virt:/' directory. You can create a sub directory and copy your files into it.
pt: Você não pode copiar ficheiros para o 'virt:/' directório. Você pode criar um sub directório e copiar os ficheiros para ai.

source: Creating new directories is allowed only in the 'virt:/' directory.
pt: A criação de novos directórios só é permitida no virt':/' directório.

source: Status
pt: Estado

source: Archives
jp: 書庫
pt: Arquivos

source: Directories
jp: ディレクトリ
pt: Directórios

source: Image Files
jp: 画像ファイル
pt: Ficheiros de Imagem

source: Text Files
jp: テキストファイル
pt: Ficheiros de Texto

source: Video Files
jp: 動画ファイル
pt: Ficheiros de Vídeo

source: Audio Files
jp: オーディオファイル
pt: Ficheiros de Áudio

source: Custom
jp: カスタム
pt: Personalizado

source: Searching content of '%1' (%2%)
pt: Procurando o conteúdo de '%1' (%2%)

source: Counting files in archive
jp: 書庫内のファイルを数える
pt: Contando os ficheiros no arquivo

source: Failed to list the content of the archive (%1)!
pt: Falha ao listar o conteúdo do arquivo (%1)!

source: Failed to unpack
jp: 解凍に失敗
pt: Falhou a extracção

source: Failed to convert rpm (%1) to cpio!
pt: Falhou a conversão de rpm (%1) para cpio!

source: Failed to convert deb (%1) to tar!
pt: Falhou a conversão de deb (%1) para tar!

source: Unpacking File(s)
jp: ファイルを解凍
pt: Extraindo Ficheiro(s)

source: Failed to unpack %1!
pt: Falhou a extracção de %1!

source: User cancelled.
pt: Cancelado pelo utilizador.

source: Testing Archive
jp: 書庫をテスト
pt: Testando o Arquivo

source: Packing File(s)
jp: ファイルを圧縮
pt: Compactando Ficheiro(s)

source: Failed to pack %1!
pt: Falhou a compactação de %1!

source: Failed to pack:
jp: 圧縮に失敗:
pt: Falhou a compactação:

source: This archive is encrypted, please supply the password:
pt: Este arquivo está protegido, por favor introduza a palavra passe:

source: In %1: Uncaught JavaScript exception '%2' %3
pt: Em %1: Apanhada excepção JavaScript '%2' %3

source: In %1: Uncaught JavaScript exception '%2' at line %3 %4
pt: Em %1: Apanhada excepção JavaScript '%2' na linha %3 %4

source: JavaScript error
pt: Erro do JavaScript

source: &General
pt: &Geral

source: &Advanced
pt: &Avançado

source: Krusader::Choose Files
pt: Krusader::Escolha os Ficheiros

source: File name
pt: Nome de ficheiro

source: &Case sensitive
pt: Distinguir &Capitalização

source: Search &for:
pt: Procurar por (&f):

source: <p>The filename filtering criteria is defined here.</p><p>You can make use of wildcards. Multiple patterns are separated by space (means logical OR) and patterns are excluded from the search using the pipe symbol.</p><p>If the pattern is ended with a slash (<code>*pattern*/</code>), that means that pattern relates to recursive search of directories.<ul><li><code>pattern</code> - means to search those files/directories that name is <code>pattern</code>, recursive search goes through all subdirectories independently of the value of <code>pattern</code></li><li><code>pattern/</code> - means to search all files/directories, but recursive search goes through/excludes the directories that name is <code>pattern</code></li></ul><p></p><p>It's allowed to use quotation marks for names that contain space. Filter <code>"Program&nbsp;Files"</code> searches out those files/directories that name is <code>Program&nbsp;Files</code>.</p><p>Examples:<ul><code><li>*.o</li><li>*.h *.c??</li><li>*.cpp *.h | *.moc.cpp</li><li>* | CVS/ .svn/</li></code></ul><b>Note</b>: the search term '<code>text</code>' is equivalent to '<code>*text*</code>'.</p>
pt: <p>O criterio da filtragem dos nomes de ficheiro é definido aqui.</p><p>Você pode utilizar caracteres especiais. Vários padrões são separados por espaços (equivalente a OU lógico) e padrões são excluídos da pesquisa através da utilização do símbolo pipe.</p><p>Se o padrão é terminado com uma barra (slash) (<code>*pattern*/</code>), significa que o padrão diz respeito a pesquisas recursivas de directórios.<ul><li><code>pattern</code> - significa procurar os ficheiros/directórios cujo nome é <code>pattern</code>, pesquisa recursiva procura em todos os subdirectórios independentemente do valor de <code>pattern</code></li><li><code>pattern/</code> - significa procurar todos os ficheiros/directórios, mas pesquisa recursiva procura através/exclui os directórios que o nome é <code>pattern</code></li></ul><p></p><p>Pode-se usar aspas para nomes que contêm espaços. Filtro <code>"Ficheiros&nbsp;Programas"</code> procura ficheiros/directórios cujo nome seja <code>Ficheiros&nbsp;Program</code>.</p><p>Exemplos:<ul><code><li>*.o</li><li>*.h *.c??</li><li>*.cpp *.h | *.moc.cpp</li><li>* | CVS/ .svn/</li></code></ul><b>Nota</b>: o termo de procura '<code>texto</code>' é equivalente a '<code>*texto*</code>'.</p>

source: &Of type:
pt: D&O tipo:

source: All Files
jp: 全てのファイル
pt: Todos os Ficheiros

source: &Profile handler
pt: Gestor de &Perfis

source: &Add
pt: &Adicionar

source: &Load
pt: Carregar(&L)

source: &Overwrite
pt: S&Obrepor

source: &Remove
pt: &Remover

source: &Search in
pt: Procurar em(&S)

source: &Don't search in
pt: &Não procurar em

source: Containing text
jp: 含む語句
pt: Contendo o texto

source: &Text:
pt: &Texto:

source: &Match whole word only
pt: Coincidir so&Mente a palavra toda

source: Cas&e sensitive
pt: Capitalização(&e)

source: &Remote content search
pt: Procura &Remota de conteúdos

source: Search in s&ubdirectories
pt: Procurar em s&ubdirectórios

source: Search in arch&ives
pt: Procurar em arqu&ivos

source: Follow &links
pt: Seguir &ligações

source: No search criteria entered!
pt: Nenhum critério de procura introduzido !

source: Please specify a location to search in.
jp: 検索する場所を指定してください
pt: Por favor especifique uma localização para procurar.

source: Size
jp: サイズ
pt: Tamanho

source: &Bigger than
pt: Maior que(&B)

source: &Smaller than
pt: Menor que(&S)

source: Date
jp: 日付
pt: Data

source: &Modified between
pt: &Modificado entre

source: an&d
pt: e(&d)

source: &Not modified after
pt: &Não modificado depois

source: Mod&ified in the last
pt: Mod&ificado nos últimos

source: days
jp: 日
pt: dias

source: weeks
jp: 週
pt: semanas

source: months
jp: 月
pt: meses

source: years
jp: 年
pt: anos

source: No&t modified in the last
pt: Não modificado nos úl&timos

source: Ownership
jp: 所有権
pt: Dono

source: Belongs to &user
pt: Pertence ao &utilizador

source: Belongs to gr&oup
pt: Pertence ao grup&o

source: P&ermissions
pt: P&ermissões

source: O&wner
pt: Dono(&w)

source: Grou&p
pt: Gru&po

source: A&ll
pt: Todos(&A)

source: Note: a '?' is a wildcard
jp: 注意: '?'はワイルドカードです
pt: Nota: o '?' é um caracter especial

source: Invalid date entered.
jp: 日付が不正です
pt: Data inválida introduzida.

source: The date %1 is not valid according to your locale. Please re-enter a valid date (use the date button for easy access).
pt: A data %1 não é válida segundo a sua localização. Por favor introduza uma data válida ( use o botão de data para um acesso mais fácil).

source: Specified sizes are inconsistent!
pt: Os tamanhos especificados são inconsistentes !

source: Please re-enter the values, so that the left side size will be smaller than (or equal to) the right side size.
pt: Por favor re-introduza os valores, para que o tamanho mais à esquerda seja mais pequeno (ou igual) ao tamanho à direita.

source: Dates are inconsistent!
pt: As datas são inconsistentes !

source: The date on the left is later than the date on the right. Please re-enter the dates, so that the left side date will be earlier than the right side date.
pt: A data no lado esquerdo é mais velha que a data no lado direito. Por favor re-introduza as datas, para que a data mais à esquerda seja anterior à do lado direito.

source: The date on top is later than the date on the bottom. Please re-enter the dates, so that the top date will be earlier than the bottom date.
pt: A data no topo é mais velha que a data no fundo.Por favor re-introduza as datas, para que a data do topo seja anterior à data do fundo.

source: Needed panel specification missing in expander %1
pt: Falta uma especificação do painel necessária no expansor %1

source: Expander: Bad argument to %1: %2 is not valid item specifier
pt: Expansor: Argumento inválido em %1: %2 não é um especificador de item válido

source: Panel's Path...
pt: Localização dos Paineis...

source: Automatically escape spaces
pt: Ignora automáticamente os espaços

source: Number of...
pt: Número de...

source: Count:
pt: Contar:

source: Expander: Bad argument to Count: %1 is not valid item specifier
pt: Expansor: Argumento inválido em Contar: %1 não é um especificador de item válido

source: Filter Mask (*.h, *.cpp, etc.)
pt: Máscara Filtro (*.h, *.cpp, etc.)

source: Current File (!= Selected File)...
pt: Ficheiro Actual (!= Ficheiro Seleccionado)...

source: Omit the current path (optional)
pt: Omitir a localização actual (opcional)

source: Item List of...
pt: Lista de Items de ...

source: Which items:
pt: Quais items:

source: Separator between the items (optional):
pt: Separador entre os items (opcional):

source: Mask (optional, all but 'Selected'):
pt: Máscara (opcional, todos menos 'Seleccionado'):

source: Filename of an Item List...
pt: Nome de ficheiro de uma Lista de Items ...

source: Separator between the items (optional)
pt: Separador entre items (opcional)

source: Expander: tempfile couldn't be opened (%1)
pt: Expansor: ficheirotemp não pode ser aberto (%1)

source: Manipulate the Selection...
pt: Manipular a Selecção...

source: Selection mask:
pt: Máscara de selecção:

source: Manipulate in which way:
pt: Manipular em que sentido:

source: Jump to a Location...
pt: Saltar para uma Localização...

source: Choose a path:
pt: Escolha uma localização:

source: Open location in a new tab
pt: Abrir a localização num novo separador

source: Ask Parameter from User...
pt: Perguntar Parâmetro ao Utilizador...

source: Question:
pt: Pergunta:

source: Preset (optional):
pt: Predefinição (opcional):

source: Caption (optional):
pt: Captação (opcional):

source: User Action
pt: Acção do Utilizador

source: Copy to Clipboard...
pt: Copiar para a Área de Transferência...

source: What to copy:
pt: Copiar o quê:

source: Append to current clipboard content with this separator (optional):
pt: Adicionar ao conteudo actual da Área de Transferência com este separador (opcional):

source: Expander: %Each% may not be in the second argument of %Clipboard%
pt: Expansor: %Each% não pode estar no segundo argumentos de %Clipboard%

source: Copy a File/Folder...
pt: Copiar um Ficheiro/Pasta...

source: Where to copy:
pt: Copiar para onde:

source: Expander: %Each% may not be in the second argument of %Copy%
pt: Expansor: %Each% não pode estar no segundo argumentos de %Copy%

source: Expander: invalid URL's in %_Copy("src", "dest")%
pt: Expansor: URL's inválidos em %_Copy("src", "dest")%

source: Move/Rename a File/Folder...
pt: Mover/Renomear um Ficheiro/Pasta...

source: What to move/rename:
pt: Mover/Renomear o que:

source: New target/name:
pt: Novo alvo/nome.

source: %Each% may not be in the second argument of %Move%
pt: %Each% não pode estar no segundo argumentos de %Move%

source: Expander: invalid URL's in %_Move("src", "dest")%
pt: Expansor: URL's inválidos em %_Move("src", "dest")%

source: Load a Synchronizer Profile...
pt: Carregar um Perfil Sincronizador...

source: Choose a profile:
pt: Escolha um perfil:

source: Expander: no profile specified for %_Sync(profile)%
pt: Expansor: nenhum perfil especificado para %_Sync(profile)%

source: Load a Searchmodule Profile...
pt: Carregar um Perfil Pesquisamódulos...

source: Expander: no profile specified for %_NewSearch(profile)%
pt: Expansor: nenhum perfil especificado para %_NewSearch(profile)%

source: Load a Panel Profile...
pt: Carregar um Perfil Painel...

source: Expander: no profile specified for %_Profile(profile)%; abort...
pt: Expansor: nenhum perfil especificado para %_Prfile(profile)%, abortar...

source: Separate Program Call for Each...
pt: Separar cada Chamada de Programas para Cada...

source: Set Sorting for This Panel...
pt: Escolha a selecção para Este Painel...

source: Choose a column:
pt: Escolha uma coluna:

source: Choose a sort sequence:
pt: Escolha a sequência de selecção:

source: Expander: no column specified for %_ColSort(column)%
pt: Expansor: nenhuma coluna especificada para %_ColSort(column)%

source: Expander: unknown column specified for %_ColSort(%1)%
pt: Expansor: nenhuma coluna especificada para %_ColSort(%1)%

source: Set Relation Between the Panels...
pt: Escolha a Relação Entre os Paineis...

source: Set the new size in percent:
pt: Escolha o novo tamanho em percentagem:

source: Expander: Value %1 out of range for %_PanelSize(percent)%. The first parameter has to be >0 and <100
pt: Expansor: Valor %1 fora de alcance para %_PanelSize(percent)%. o primeiro parâmetro tem que ser >0 e <100

source: Execute a JavaScript Extension...
pt: Executa uma Extensão JavaScript...

source: Location of the script
pt: Localização do script

source: Set some variables for the execution (optional). i.e. "return=return_var;foo=bar", consult the handbook for more information
pt: Escolha algumas variáveis para a execução (opcional). i.e. "return=cmd;foo=bar", consulte o handbook para mais informação

source: Expander: no script specified for %_Script(script)%
pt: Expansor: nenhum script especificado para %_Script(script)%

source: View File with Krusader's Internal Viewer...
pt: Ver um ficheiro com o Visualizador Interno do Krusader...

source: Which file to view (normally '%aCurrent%'):
pt: Que ficheiro ver (normalmente '%aCurrent%'):

source: Choose a view mode:
pt: Escolha um modo-visualização:

source: Choose a window mode:
pt: Escolha um modo janela:

source: Expander: no file to view in %_View(filename)%
pt: Expansor: nenhum ficheiro para ver em %_View(filename)%

source: %Each% is not allowed in parameter to %1
pt: %Each% não é um parâmetro permitido para %1

source: Expander: Bad panel specifier %1 in placeholder %2
pt: Expansorr: Especificador de painel inválido %1 em marcador %2

source: Error: unterminated % in Expander::expandCurrent
pt: Erro: indeterminado % no Expansor::expandCurrent

source: Error: unrecognized %%%1%2%% in Expander::expand
pt: Erro: não reconhecido %%%1%2%% no Expansor::expand

source: Error: missing ')' in Expander::separateParameter
pt: Erro: falta ')' no Expansor::separateParameter

source: User Actions
pt: Acções Utilizador

source: Confirm execution
pt: Confirmar execução

source: Command being executed:
pt: Comando em execução:

source: Close
pt: Fechar

source: Kill
pt: Matar

source: Kill the running process
pt: Matar o processo em execução

source: Save as
pt: Gravar como

source: Standard Output (stdout)
pt: Saída Padrão (stdout)

source: Standard Error (stderr)
pt: Erro Padrão (stderr)

source: Output
pt: Saída

source: Use font with fixed width
pt: Usar fonte com largura definida

source: *.txt|Text files *|all files
pt: *.txtl|Ficheiros de texto *|todos os ficheiros

source: This file already exists. Do you want to overwrite it or append the output?
pt: Este ficheiro já existe. Quer substituí-lo ou adicionar ao output?

source: Overwrite or append?
pt: Substituir ou adicionar?

source: Overwrite
pt: S&obrepor

source: Append
pt: Adicionar

source: Can't open %1 for writing! Nothing exported.
pt: Não foi possível abrir%1 para escrita! Não foi nada exportado.

source: Export failed!
pt: Exportação falhou!

source: Support for more than one command doesn't work in a terminal. Only the first is executed in the terminal.
pt: Suporte para mais que um comando não funciona num terminal. Apenas o primeiro é executado no terminal.

source: Embedded terminal emulator does not work, using output collection instead.
pt: Emulador de terminal embebido não funciona, utilizando coleção de saída em vez disso.

source: The file %1 does not contain valid UserActions.
pt: O ficheito %1 não contém AcçõesUtilizador válidas.

source: UserActions - can't read from file!
pt: AcçõesUtilizador - incapaz de ler do ficheiro!

source: Unable to open actionfile %1
pt: Incapaz de abrir ficheiroacção %1

source: Action without name detected. This action will not be imported! This is an error in the file, you may want to correct it.
pt: Acção sem nome detectada. Esta acção não vai ser importada! Isto é um erro no ficheiro, você deverá querer corrigi-lo.

source: UserActions - invalid action
pt: AcçõesUtilizador - acção inválida

source: Preview not available
pt: Antevisão não disponível

source: &Brief View
pt: Vista &Breve

source: Name
jp: 名前
pt: Nome

source: Columns
pt: Colunas

source: The statusbar displays information about the FILESYSTEM which holds your current directory: Total size, free space, type of filesystem, etc.
pt: A barra de estado mostra informação sobre o SISTEMA DE FICHEIROS que contém a sua directoria actual: Tamanho total, espaço livre, tipo de sistema de ficheiros, etc.

source: Open menu with bookmarks. You can also add current location to the list, edit bookmarks or add subfolder to the list.
pt: Abrir menu com favoritos. Você também pode adicionar a localização actual para a lista, editar os favoritos ou adicionar um sub-directório à lista.

source: The totals bar shows how many files exist, how many selected and the bytes math
pt: A barra de totais mostra quantos ficheiros existem, quantos estão seleccionados e matemática de bytes

source: Open the popup panel
pt: Abre o painel de popus

source: Use superb KDE file dialog to choose location.
pt: Usar o soberbo diálogo de ficheiros do KDE para escolher a localização.

source: Name of directory where you are. You can also enter name of desired location to move there. Use of Net protocols like ftp or fish is possible.
pt: Nome do directório onde você está. Você também pode entrar com o nome da localização para onde quer ir. Use protocolos da Net como ftp ou fish se possível.

source: Equal
pt: Igual

source: Up
pt: Cima

source: Home
pt: Casa

source: Root
pt: Raiz

source: Close the popup panel
pt: Fechar o painel de popups

source: Select Files
jp: ファイルを選択
pt: Seleccionar Ficheiros

source: Unselect Files
jp: ファイルの選択を解除
pt: Deseleccionar Ficheiros

source: No space information on non-local filesystems
jp: ローカル以外のファイルシステムについては容量を取得できません
pt: Nenhuma informação de espaço em sistemas de ficheiros não locais

source: No space information on [dev]
pt: Nenhuma informação de espaço em [dev]

source: No space information on [procfs]
pt: Nenhuma informação de espaço em [procfs]

source: No space information on [proc]
pt: Nenhuma informação de espaço em [proc]

source: Mt.Man: working ...
jp: Mt.Man: 実行中..
pt: Mt.Man: a trabalhar ...

source: unknown
pt: desconhecido

source: %1 free out of %2 (%3%) on %4 [ (%5) ]
pt: %1 livres de %2 (%3%) em %4 [ (%5) ]

source: Can't drop here, no write permissions.
jp: ドロップできません。書き込み権限がありません
pt: Não posso pôr aqui, sem permissões de escrita.

source: Copy Here
jp: ここにコピー
pt: Copiar Aqui

source: Move Here
jp: ここに移動
pt: Mover Aqui

source: Link Here
jp: ここにリンクする
pt: Ligar Aqui

source: Cancel
pt: Cancelar

source: >> Reading...
pt: >> Lendo...

source: Reading
pt: Lendo

source: Reading:
pt: Lendo:

source: &Detailed View
pt: Vista &Detalhada

source: Type
jp: 種類
pt: Tipo

source: Modified
pt: Modificado

source: Owner
jp: 所有者
pt: Dono

source: Group
jp: グループ
pt: Grupo

source: Climb up the directory tree
pt: Subir a árvore de directórios

source: (broken link !)
jp: (リンクが壊れています)
pt: (ligação quebrada !)

source: Symbolic Link
jp: シンボリックリンク
pt: Ligação Simbólica
